#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_LevelPrefabDaiyu

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_LevelPrefabDaiyu.ABP_LevelPrefabDaiyu_C.ExecuteUbergraph_ABP_LevelPrefabDaiyu
// 0x0014 (0x0014 - 0x0000)
struct ABP_LevelPrefabDaiyu_C_ExecuteUbergraph_ABP_LevelPrefabDaiyu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_3;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_4;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_5;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ABP_LevelPrefabDaiyu_C_ExecuteUbergraph_ABP_LevelPrefabDaiyu;

// Function ABP_LevelPrefabDaiyu.ABP_LevelPrefabDaiyu_C.SetState
// 0x0010 (0x0010 - 0x0000)
struct ABP_LevelPrefabDaiyu_C_SetState final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_LevelPrefabDaiyu_C_SetState;

// Function ABP_LevelPrefabDaiyu.ABP_LevelPrefabDaiyu_C.SetPlayRate
// 0x0004 (0x0004 - 0x0000)
struct ABP_LevelPrefabDaiyu_C_SetPlayRate final
{
public:
	float                                         playRate;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_LevelPrefabDaiyu_C_SetPlayRate;

// Function ABP_LevelPrefabDaiyu.ABP_LevelPrefabDaiyu_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_LevelPrefabDaiyu_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_LevelPrefabDaiyu_C_AnimGraph;

}

