#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BasePathLine_Edgewall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BasePathLine_Edgewall.BP_BasePathLine_Edgewall_C
// 0x0030 (0x02E0 - 0x02B0)
class ABP_BasePathLine_Edgewall_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OriginalLocation;                                  // 0x02C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DebugTarget;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAttachedToEntity;                                // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BasePathLine_Edgewall(int32 EntryPoint);
	void ReceiveBeginPlay();
	void 贴地处理();
	void Save();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BasePathLine_Edgewall_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BasePathLine_Edgewall_C")
	}
	static class ABP_BasePathLine_Edgewall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BasePathLine_Edgewall_C>();
	}
};
DUMPER7_ASSERTS_ABP_BasePathLine_Edgewall_C;

}

