#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KuroMasterSeqEvent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C
// 0x0038 (0x02E8 - 0x02B0)
class ABP_KuroMasterSeqEvent_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ModifiedNearClipPlane;                             // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnScreenShotFade;                                  // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         DelayMerge;                                        // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Icon透明度;                                        // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Icon遮罩透明度;                                    // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	int32                                         counter;                                           // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_KuroMasterSeqEvent(int32 EntryPoint);
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);
	void 禁用动态模糊();
	void 启用动态模糊();
	void 主触发切镜(bool shouldBlend, float blendTime, EViewTargetBlendFunction blendFunction, float blendExp);
	void 副触发切镜();
	void 调整镜头裁剪距离(int32 NearClip);
	void 恢复镜头裁剪距离();
	void 开关人物飘带(bool enable);
	void 执行流程行为(const class FString& key);
	void 开始叠化();
	void 触发切镜();
	void 打开章节提示(int32 ChapterState, int32 ChapterId);
	void 展示游戏Logo(float time);
	void 显示预览图(const class FString& MaleAssetPath, const class FString& FemaleAssetPath, const class FString& maleSpineName, const class FString& femaleSpineName, bool needLoop);
	void 显示预览图_数组_(const class FString& MaleAssetPath, const class FString& FemaleAssetPath, TArray<struct FSpineThingsInfo>& maleSpineArray, TArray<struct FSpineThingsInfo>& femaleSpineArray);
	void 关闭预览图();
	void 播放预览图动画(const class FString& seqName);
	void 执行实体帧事件(const class FString& Key, int32 EntityId);
	void 播放Spine动画(const class FString& SpineName, bool needLoop);
	void 播放Spine动画_性别_(const class FString& maleSpineName1, const class FString& femaleSpineName1, bool needLoop);
	void 播放Spine动画_数组_(TArray<struct FSpineThingsInfo>& maleSpineArray, TArray<struct FSpineThingsInfo>& femaleSpineArray);
	void 关闭Spine动画(const class FString& spineName);
	void 关闭Spine动画_数组_(TArray<class FString>& spineArray);
	void 背景Icon(bool 显示, class UTexture2D* Icon);
	void 额外Seq播放(class ULevelSequence* Seq, class FName componentName, class FName boneName, float frame);
	void 额外Seq停止();
	void 绑定物品检视Actor(const struct FMovieSceneObjectBindingID& binding);
	void 启用剧情交互按钮(bool bEnable);
	void 相机振动(bool 启用, TSoftClassPtr<class UClass> 资产);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_KuroMasterSeqEvent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_KuroMasterSeqEvent_C")
	}
	static class ABP_KuroMasterSeqEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_KuroMasterSeqEvent_C>();
	}
};
DUMPER7_ASSERTS_ABP_KuroMasterSeqEvent_C;

}

