#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainGameInstance

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MainGameInstance.BP_MainGameInstance_C.ExecuteUbergraph_BP_MainGameInstance
// 0x0004 (0x0004 - 0x0000)
struct BP_MainGameInstance_C_ExecuteUbergraph_BP_MainGameInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_MainGameInstance_C_ExecuteUbergraph_BP_MainGameInstance;

// Function BP_MainGameInstance.BP_MainGameInstance_C.MountLauncherPak
// 0x0040 (0x0040 - 0x0000)
struct BP_MainGameInstance_C_MountLauncherPak final
{
public:
	class FString                                 CallFunc_GameSavedDir_ReturnValue;                 // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAppVersion_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_MainGameInstance_C_MountLauncherPak;

// Function BP_MainGameInstance.BP_MainGameInstance_C.MountGamePak
// 0x0040 (0x0040 - 0x0000)
struct BP_MainGameInstance_C_MountGamePak final
{
public:
	class FString                                 CallFunc_GameSavedDir_ReturnValue;                 // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAppVersion_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_MainGameInstance_C_MountGamePak;

}

