#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MovePathLine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MovePathLine.BP_MovePathLine_C
// 0x0028 (0x02D8 - 0x02B0)
class ABP_MovePathLine_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UKuroMoveSplineComponent*               Spline;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DebugTarget;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OriginalLocation;                                  // 0x02C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAttachedToEntity;                                // 0x02D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_BP_MovePathLine(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Save();
	void 贴地处理();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MovePathLine_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MovePathLine_C")
	}
	static class ABP_MovePathLine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MovePathLine_C>();
	}
};
DUMPER7_ASSERTS_ABP_MovePathLine_C;

}

