#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequenceData_Generated

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SSequencesKeyFrames_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SequenceData_Generated.BP_SequenceData_Generated_C
// 0x0158 (0x0190 - 0x0038)
class UBP_SequenceData_Generated_C final : public UPrimaryDataAsset
{
public:
	TArray<struct FSSequencesKeyFrames>           KeyFrames;                                         // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<struct FTransform>                     FinalPos;                                          // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         BindingBP;                                         // 0x0058(0x0010)(Edit, BlueprintVisible)
	TArray<bool>                                  IsFadeEnd;                                         // 0x0068(0x0010)(Edit, BlueprintVisible)
	class FName                                   BlendInTag;                                        // 0x0078(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           BlendInTags;                                       // 0x0088(0x0010)(Edit, BlueprintVisible)
	class FName                                   BlendOutTag;                                       // 0x0098(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           BlendOutTags;                                      // 0x00A8(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         PreloadUiArray;                                    // 0x00B8(0x0010)(Edit, BlueprintVisible)
	bool                                          IsCustomizedFinalPos;                              // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   MalePlayerBP;                                      // 0x00D0(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   FemalePlayerBP;                                    // 0x0100(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           MaleMesh;                                          // 0x0130(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           FemaleMesh;                                        // 0x0160(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SequenceData_Generated_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SequenceData_Generated_C")
	}
	static class UBP_SequenceData_Generated_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SequenceData_Generated_C>();
	}
};
DUMPER7_ASSERTS_UBP_SequenceData_Generated_C;

}

