#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SM_TaskBeHitMontage

#include "Basic.hpp"

#include "EHitAnim_structs.hpp"
#include "SMSystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SM_TaskBeHitMontage.BP_SM_TaskBeHitMontage_C
// 0x0068 (0x0098 - 0x0030)
class UBP_SM_TaskBeHitMontage_C final : public UASMTask
{
public:
	class FString                                 DefaultAnim;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TMap<EHitAnim, class FString>                 HitAnim;                                           // 0x0040(0x0050)(Edit, BlueprintVisible)
	bool                                          允许打断;                                          // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BlendInTime;                                       // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SM_TaskBeHitMontage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SM_TaskBeHitMontage_C")
	}
	static class UBP_SM_TaskBeHitMontage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SM_TaskBeHitMontage_C>();
	}
};
DUMPER7_ASSERTS_UBP_SM_TaskBeHitMontage_C;

}

