#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Wwise_AudioSpectrum

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Wwise_AudioSpectrum.BP_Wwise_AudioSpectrum_C
// 0x0050 (0x0300 - 0x02B0)
class ABP_Wwise_AudioSpectrum_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UConstantQNRT*                          Synesthesia_Analysis;                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Frequency_Band_Strengths;                          // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 OutputArray;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAkAudioEvent*                          AkResource;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Event;                                          // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Wwise_AudioSpectrum(int32 EntryPoint);
	void AkCall(class UAkComponent* Ak_0, class UAkAudioEvent* AkEvent);
	void ReceiveTick(float DeltaSeconds);
	void NotifyAnalyser(class UAkComponent* Ak_0, class UAkAudioEvent* akEvent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Wwise_AudioSpectrum_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Wwise_AudioSpectrum_C")
	}
	static class ABP_Wwise_AudioSpectrum_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Wwise_AudioSpectrum_C>();
	}
};
DUMPER7_ASSERTS_ABP_Wwise_AudioSpectrum_C;

}

