#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EffectBlueprintFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.RecycleEffect
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_RecycleEffect final
{
public:
	class UEffectViewComponent_C*                 view;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_RecycleEffect;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.AddDebugLineFromPlayer
// 0x0030 (0x0030 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer final
{
public:
	struct FVector                                location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           color;                                             // 0x000C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         width;                                             // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.ClearDebugDraw
// 0x0008 (0x0008 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_ClearDebugDraw final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_ClearDebugDraw;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.SetMaterialControllerDataSync
// 0x0028 (0x0028 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 materialDataPath;                                  // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          isGroup;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.ValidateKuroAnimNotify
// 0x0018 (0x0018 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotify final
{
public:
	class UKuroAnimNotify*                        asset;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotify;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.ValidateKuroAnimNotifyState
// 0x0018 (0x0018 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotifyState final
{
public:
	class UKuroAnimNotifyState*                   asset;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotifyState;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.SetEffectSpawnLogEnabled
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_SetEffectSpawnLogEnabled final
{
public:
	bool                                          enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_SetEffectSpawnLogEnabled;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.BeginDebugDrawFoliageDetect
// 0x0020 (0x0020 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_BeginDebugDrawFoliageDetect final
{
public:
	struct FLinearColor                           color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         width;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_BeginDebugDrawFoliageDetect;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.EndDebugDrawFoliageDetect
// 0x0008 (0x0008 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_EndDebugDrawFoliageDetect final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_EndDebugDrawFoliageDetect;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.RefreshFoliageDetectConfig
// 0x0008 (0x0008 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_RefreshFoliageDetectConfig final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_RefreshFoliageDetectConfig;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.SetVisualizeCharacterWaterEffectTrace
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_SetVisualizeCharacterWaterEffectTrace final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_SetVisualizeCharacterWaterEffectTrace;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.SetEffectInPoolEnabled
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_SetEffectInPoolEnabled final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_SetEffectInPoolEnabled;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.SetEffectOutPoolEnabled
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_SetEffectOutPoolEnabled final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_SetEffectOutPoolEnabled;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.EnableSceneObjectWaterEffectShowDebugTrace
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_EnableSceneObjectWaterEffectShowDebugTrace final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_EnableSceneObjectWaterEffectShowDebugTrace;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.SetTsWriteTimeToCollectionEnabled
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_SetTsWriteTimeToCollectionEnabled final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_SetTsWriteTimeToCollectionEnabled;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.EffectCgMode
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_EffectCgMode final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_EffectCgMode;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetScreenEffectSystem
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetScreenEffectSystem final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ScreenEffectSystem_C*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_GetScreenEffectSystem;

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.ChangeMaterialTextures
// 0x0020 (0x0020 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_ChangeMaterialTextures final
{
public:
	class AActor*                                 actor1;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 assetPath1;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffectBlueprintFunctionLibrary_C_ChangeMaterialTextures;

}

