#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EffectClusteredStuffSettings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass EffectClusteredStuffSettings.EffectClusteredStuffSettings_C
// 0x0048 (0x0080 - 0x0038)
class UEffectClusteredStuffSettings_C final : public UPrimaryDataAsset
{
public:
	float                                         DensityChangeSpeed;                                // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AttachToActor;                                     // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AbsoluteWorldPosition;                             // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UEffectModelBase>        EffectDataRef;                                     // 0x0050(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EffectClusteredStuffSettings_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EffectClusteredStuffSettings_C")
	}
	static class UEffectClusteredStuffSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEffectClusteredStuffSettings_C>();
	}
};
DUMPER7_ASSERTS_UEffectClusteredStuffSettings_C;

}

