#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroMath

#include "Basic.hpp"

#include "KuroMath_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KuroMath.KuroBitwiseLibrary.BitwiseLeftShift
// 0x0018 (0x0018 - 0x0000)
struct KuroBitwiseLibrary_BitwiseLeftShift final
{
public:
	int64                                         Source;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Bit;                                               // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBitwiseLibrary_BitwiseLeftShift;

// Function KuroMath.KuroBitwiseLibrary.BitwiseRightShift
// 0x0018 (0x0018 - 0x0000)
struct KuroBitwiseLibrary_BitwiseRightShift final
{
public:
	int64                                         Source;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Bit;                                               // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBitwiseLibrary_BitwiseRightShift;

// Function KuroMath.KuroBitwiseLibrary.IntBitwiseAnd
// 0x000C (0x000C - 0x0000)
struct KuroBitwiseLibrary_IntBitwiseAnd final
{
public:
	int32                                         Num1;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Num2;                                              // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBitwiseLibrary_IntBitwiseAnd;

// Function KuroMath.KuroBitwiseLibrary.IntBitwiseNot
// 0x0008 (0x0008 - 0x0000)
struct KuroBitwiseLibrary_IntBitwiseNot final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBitwiseLibrary_IntBitwiseNot;

// Function KuroMath.KuroBitwiseLibrary.IntBitwiseOr
// 0x000C (0x000C - 0x0000)
struct KuroBitwiseLibrary_IntBitwiseOr final
{
public:
	int32                                         Num1;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Num2;                                              // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBitwiseLibrary_IntBitwiseOr;

// Function KuroMath.KuroBitwiseLibrary.IntBitwiseXOr
// 0x000C (0x000C - 0x0000)
struct KuroBitwiseLibrary_IntBitwiseXOr final
{
public:
	int32                                         Num1;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Num2;                                              // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBitwiseLibrary_IntBitwiseXOr;

// Function KuroMath.KuroBitwiseLibrary.KuroStringToInt64
// 0x0018 (0x0018 - 0x0000)
struct KuroBitwiseLibrary_KuroStringToInt64 final
{
public:
	class FString                                 StringNum;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBitwiseLibrary_KuroStringToInt64;

// Function KuroMath.KuroBitwiseLibrary.LongBitwiseAnd
// 0x0018 (0x0018 - 0x0000)
struct KuroBitwiseLibrary_LongBitwiseAnd final
{
public:
	int64                                         Num1;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Num2;                                              // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBitwiseLibrary_LongBitwiseAnd;

// Function KuroMath.KuroBitwiseLibrary.LongBitwiseNot
// 0x0010 (0x0010 - 0x0000)
struct KuroBitwiseLibrary_LongBitwiseNot final
{
public:
	int64                                         Num;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBitwiseLibrary_LongBitwiseNot;

// Function KuroMath.KuroBitwiseLibrary.LongBitwiseOr
// 0x0018 (0x0018 - 0x0000)
struct KuroBitwiseLibrary_LongBitwiseOr final
{
public:
	int64                                         Num1;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Num2;                                              // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBitwiseLibrary_LongBitwiseOr;

// Function KuroMath.KuroBitwiseLibrary.LongBitwiseXOr
// 0x0018 (0x0018 - 0x0000)
struct KuroBitwiseLibrary_LongBitwiseXOr final
{
public:
	int64                                         Num1;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Num2;                                              // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBitwiseLibrary_LongBitwiseXOr;

// Function KuroMath.KuroEasingLibrary.EaseInBack
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInBack final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInBack;

// Function KuroMath.KuroEasingLibrary.EaseInBounce
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInBounce final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInBounce;

// Function KuroMath.KuroEasingLibrary.EaseInCirc
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInCirc final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInCirc;

// Function KuroMath.KuroEasingLibrary.EaseInCubic
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInCubic final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInCubic;

// Function KuroMath.KuroEasingLibrary.EaseInElastic
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInElastic final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInElastic;

// Function KuroMath.KuroEasingLibrary.EaseInExpo
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInExpo final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInExpo;

// Function KuroMath.KuroEasingLibrary.EaseInOutBack
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInOutBack final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInOutBack;

// Function KuroMath.KuroEasingLibrary.EaseInOutBounce
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInOutBounce final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInOutBounce;

// Function KuroMath.KuroEasingLibrary.EaseInOutCirc
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInOutCirc final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInOutCirc;

// Function KuroMath.KuroEasingLibrary.EaseInOutCubic
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInOutCubic final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInOutCubic;

// Function KuroMath.KuroEasingLibrary.EaseInOutElastic
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInOutElastic final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInOutElastic;

// Function KuroMath.KuroEasingLibrary.EaseInOutExpo
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInOutExpo final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInOutExpo;

// Function KuroMath.KuroEasingLibrary.EaseInOutQuad
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInOutQuad final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInOutQuad;

// Function KuroMath.KuroEasingLibrary.EaseInOutQuart
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInOutQuart final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInOutQuart;

// Function KuroMath.KuroEasingLibrary.EaseInOutQuint
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInOutQuint final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInOutQuint;

// Function KuroMath.KuroEasingLibrary.EaseInOutSine
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInOutSine final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInOutSine;

// Function KuroMath.KuroEasingLibrary.EaseInQuad
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInQuad final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInQuad;

// Function KuroMath.KuroEasingLibrary.EaseInQuart
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInQuart final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInQuart;

// Function KuroMath.KuroEasingLibrary.EaseInQuint
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInQuint final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInQuint;

// Function KuroMath.KuroEasingLibrary.EaseInSine
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseInSine final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseInSine;

// Function KuroMath.KuroEasingLibrary.EaseOutBack
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseOutBack final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseOutBack;

// Function KuroMath.KuroEasingLibrary.EaseOutBounce
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseOutBounce final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseOutBounce;

// Function KuroMath.KuroEasingLibrary.EaseOutCirc
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseOutCirc final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseOutCirc;

// Function KuroMath.KuroEasingLibrary.EaseOutCubic
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseOutCubic final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseOutCubic;

// Function KuroMath.KuroEasingLibrary.EaseOutElastic
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseOutElastic final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseOutElastic;

// Function KuroMath.KuroEasingLibrary.EaseOutExpo
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseOutExpo final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseOutExpo;

// Function KuroMath.KuroEasingLibrary.EaseOutQuad
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseOutQuad final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseOutQuad;

// Function KuroMath.KuroEasingLibrary.EaseOutQuart
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseOutQuart final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseOutQuart;

// Function KuroMath.KuroEasingLibrary.EaseOutQuint
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseOutQuint final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseOutQuint;

// Function KuroMath.KuroEasingLibrary.EaseOutSine
// 0x0008 (0x0008 - 0x0000)
struct KuroEasingLibrary_EaseOutSine final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_EaseOutSine;

// Function KuroMath.KuroEasingLibrary.GetEasedValue
// 0x000C (0x000C - 0x0000)
struct KuroEasingLibrary_GetEasedValue final
{
public:
	EEasingType                                   EaseType;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         X;                                                 // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEasingLibrary_GetEasedValue;

// Function KuroMath.KuroSimplePolygonLibrary.Conv_ArrayToKuroGeometrySimplePolygon
// 0x0020 (0x0020 - 0x0000)
struct KuroSimplePolygonLibrary_Conv_ArrayToKuroGeometrySimplePolygon final
{
public:
	TArray<struct FVectorDouble>                  PathVertices;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FKuroGeometrySimplePolygon             ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSimplePolygonLibrary_Conv_ArrayToKuroGeometrySimplePolygon;

// Function KuroMath.KuroSimplePolygonLibrary.Conv_KuroGeometrySimplePolygonToArray
// 0x0020 (0x0020 - 0x0000)
struct KuroSimplePolygonLibrary_Conv_KuroGeometrySimplePolygonToArray final
{
public:
	struct FKuroGeometrySimplePolygon             Polygon;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVectorDouble>                  ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSimplePolygonLibrary_Conv_KuroGeometrySimplePolygonToArray;

// Function KuroMath.KuroSimplePolygonLibrary.SampleSplineToPolygon
// 0x0028 (0x0028 - 0x0000)
struct KuroSimplePolygonLibrary_SampleSplineToPolygon final
{
public:
	const class USplineComponent*                 Spline;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKuroGeometrySimplePolygon             Polygon;                                           // 0x0008(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FKuroSplineSamplingOptions             SamplingOptions;                                   // 0x0018(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSimplePolygonLibrary_SampleSplineToPolygon;

// Function KuroMath.KuroPolygonListLibrary.AddPolygonToList
// 0x0038 (0x0038 - 0x0000)
struct KuroPolygonListLibrary_AddPolygonToList final
{
public:
	struct FKuroGeometryGeneralPolygonList        PolygonList;                                       // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FKuroGeometrySimplePolygon             OuterPolygon;                                      // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FKuroGeometrySimplePolygon>     HolePolygons;                                      // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bFixHoleOrientations;                              // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPolygonListLibrary_AddPolygonToList;

// Function KuroMath.KuroPolygonListLibrary.AppendPolygonList
// 0x0020 (0x0020 - 0x0000)
struct KuroPolygonListLibrary_AppendPolygonList final
{
public:
	struct FKuroGeometryGeneralPolygonList        PolygonList;                                       // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FKuroGeometryGeneralPolygonList        PolygonsToAppend;                                  // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPolygonListLibrary_AppendPolygonList;

// Function KuroMath.KuroPolygonListLibrary.CreatePolygonListFromSimplePolygons
// 0x0020 (0x0020 - 0x0000)
struct KuroPolygonListLibrary_CreatePolygonListFromSimplePolygons final
{
public:
	TArray<struct FKuroGeometrySimplePolygon>     OuterPolygons;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FKuroGeometryGeneralPolygonList        ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPolygonListLibrary_CreatePolygonListFromSimplePolygons;

// Function KuroMath.KuroPolygonListLibrary.CreatePolygonListFromSinglePolygon
// 0x0038 (0x0038 - 0x0000)
struct KuroPolygonListLibrary_CreatePolygonListFromSinglePolygon final
{
public:
	struct FKuroGeometrySimplePolygon             OuterPolygon;                                      // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FKuroGeometrySimplePolygon>     HolePolygons;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bFixHoleOrientations;                              // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroGeometryGeneralPolygonList        ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPolygonListLibrary_CreatePolygonListFromSinglePolygon;

// Function KuroMath.KuroPolygonListLibrary.GetPolygonCount
// 0x0018 (0x0018 - 0x0000)
struct KuroPolygonListLibrary_GetPolygonCount final
{
public:
	struct FKuroGeometryGeneralPolygonList        PolygonList;                                       // 0x0000(0x0010)(ConstParm, Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPolygonListLibrary_GetPolygonCount;

// Function KuroMath.KuroPolygonListLibrary.GetSimplePolygon
// 0x0030 (0x0030 - 0x0000)
struct KuroPolygonListLibrary_GetSimplePolygon final
{
public:
	struct FKuroGeometryGeneralPolygonList        PolygonList;                                       // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	bool                                          bValidIndices;                                     // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PolygonIndex;                                      // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HoleIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroGeometrySimplePolygon             ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPolygonListLibrary_GetSimplePolygon;

// Function KuroMath.KuroPolygonListLibrary.PolygonsDifference
// 0x0030 (0x0030 - 0x0000)
struct KuroPolygonListLibrary_PolygonsDifference final
{
public:
	struct FKuroGeometryGeneralPolygonList        PolygonList;                                       // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FKuroGeometryGeneralPolygonList        PolygonsToSubtract;                                // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FKuroGeometryGeneralPolygonList        ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPolygonListLibrary_PolygonsDifference;

// Function KuroMath.KuroPolygonListLibrary.PolygonsExclusiveOr
// 0x0030 (0x0030 - 0x0000)
struct KuroPolygonListLibrary_PolygonsExclusiveOr final
{
public:
	struct FKuroGeometryGeneralPolygonList        PolygonList;                                       // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FKuroGeometryGeneralPolygonList        PolygonsToExclusiveOr;                             // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FKuroGeometryGeneralPolygonList        ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPolygonListLibrary_PolygonsExclusiveOr;

// Function KuroMath.KuroPolygonListLibrary.PolygonsIntersection
// 0x0030 (0x0030 - 0x0000)
struct KuroPolygonListLibrary_PolygonsIntersection final
{
public:
	struct FKuroGeometryGeneralPolygonList        PolygonList;                                       // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FKuroGeometryGeneralPolygonList        PolygonsToIntersect;                               // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FKuroGeometryGeneralPolygonList        ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPolygonListLibrary_PolygonsIntersection;

// Function KuroMath.KuroPolygonListLibrary.PolygonsOpenPathsDifference
// 0x0040 (0x0040 - 0x0000)
struct KuroPolygonListLibrary_PolygonsOpenPathsDifference final
{
public:
	struct FKuroGeometryGeneralPolygonList        PolygonList;                                       // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FKuroGeometryGeneralPolygonList        PolygonsToSubtract;                                // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
	double                                        StrokeWidth;                                       // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJoinType                                     JoinType;                                          // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndType                                      EndType;                                           // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroGeometryGeneralPolygonList        ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPolygonListLibrary_PolygonsOpenPathsDifference;

// Function KuroMath.KuroPolygonListLibrary.PolygonsUnion
// 0x0028 (0x0028 - 0x0000)
struct KuroPolygonListLibrary_PolygonsUnion final
{
public:
	struct FKuroGeometryGeneralPolygonList        PolygonList;                                       // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	bool                                          bCopyInputOnFailure;                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroGeometryGeneralPolygonList        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPolygonListLibrary_PolygonsUnion;

// Function KuroMath.KuroPolygonLibrary.ClipPolygonByWeilerAtherton
// 0x0030 (0x0030 - 0x0000)
struct KuroPolygonLibrary_ClipPolygonByWeilerAtherton final
{
public:
	TArray<struct FVector2D>                      Polygon;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      Window;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPolygonLibrary_ClipPolygonByWeilerAtherton;

// Function KuroMath.KuroPolygonLibrary.EliminateSplineGaps
// 0x0018 (0x0018 - 0x0000)
struct KuroPolygonLibrary_EliminateSplineGaps final
{
public:
	TArray<class USplineComponent*>               Splines;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         Tolerance;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPolygonLibrary_EliminateSplineGaps;

}

