#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroDevice

#include "Basic.hpp"


namespace SDK::Params
{

// Function KuroDevice.DeviceHandle.GetPidAndVidArray
// 0x0010 (0x0010 - 0x0000)
struct DeviceHandle_GetPidAndVidArray final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DeviceHandle_GetPidAndVidArray;

// Function KuroDevice.KuroDeviceBPLibrary.FindAllDeviceVidAndPid
// 0x0018 (0x0018 - 0x0000)
struct KuroDeviceBPLibrary_FindAllDeviceVidAndPid final
{
public:
	TArray<class FString>                         DevicePathList;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroDeviceBPLibrary_FindAllDeviceVidAndPid;

// Function KuroDevice.KuroDeviceBPLibrary.NewDeviceHandle
// 0x0010 (0x0010 - 0x0000)
struct KuroDeviceBPLibrary_NewDeviceHandle final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDeviceHandle*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroDeviceBPLibrary_NewDeviceHandle;

}

