#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroRhythmGame

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "KuroRhythmGame_structs.hpp"


namespace SDK::Params
{

// Function KuroRhythmGame.KuroRhythmGameEffectManager.Initialize
// 0x0010 (0x0010 - 0x0000)
struct KuroRhythmGameEffectManager_Initialize final
{
public:
	class USplineComponent*                       InSplineComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         InEffectSystem;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameEffectManager_Initialize;

// Function KuroRhythmGame.KuroRhythmGameEffectManager.OnHoldNoteCompleted
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameEffectManager_OnHoldNoteCompleted final
{
public:
	int32                                         NoteIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameEffectManager_OnHoldNoteCompleted;

// Function KuroRhythmGame.KuroRhythmGameEffectManager.OnHoldNoteInterrupted
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameEffectManager_OnHoldNoteInterrupted final
{
public:
	int32                                         NoteIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameEffectManager_OnHoldNoteInterrupted;

// Function KuroRhythmGame.KuroRhythmGameEffectManager.OnNoteHit
// 0x0008 (0x0008 - 0x0000)
struct KuroRhythmGameEffectManager_OnNoteHit final
{
public:
	int32                                         NoteIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroRhythmGameNoteType                       NoteType;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroRhythmGameEffectManager_OnNoteHit;

// Function KuroRhythmGame.KuroRhythmGameEffectManager.OnNoteMiss
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameEffectManager_OnNoteMiss final
{
public:
	int32                                         NoteIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameEffectManager_OnNoteMiss;

// Function KuroRhythmGame.KuroRhythmGameEffectManager.SetNiagaraBPM
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameEffectManager_SetNiagaraBPM final
{
public:
	float                                         BPM;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameEffectManager_SetNiagaraBPM;

// Function KuroRhythmGame.KuroRhythmGameEffectManager.SetNiagaraCurrentTrackIndex
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameEffectManager_SetNiagaraCurrentTrackIndex final
{
public:
	int32                                         CurrentTrackIndex;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameEffectManager_SetNiagaraCurrentTrackIndex;

// Function KuroRhythmGame.KuroRhythmGameEffectManager.Tick
// 0x0010 (0x0010 - 0x0000)
struct KuroRhythmGameEffectManager_Tick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentSplineLength;                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentAbsoluteTime;                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentTrackSpeed;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameEffectManager_Tick;

// Function KuroRhythmGame.KuroRhythmGameEffectManager.GetEffectSystem
// 0x0008 (0x0008 - 0x0000)
struct KuroRhythmGameEffectManager_GetEffectSystem final
{
public:
	class UNiagaraSystem*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameEffectManager_GetEffectSystem;

// Function KuroRhythmGame.KuroRhythmGameEffectManager.GetNiagaraComponent
// 0x0008 (0x0008 - 0x0000)
struct KuroRhythmGameEffectManager_GetNiagaraComponent final
{
public:
	class UNiagaraComponent*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameEffectManager_GetNiagaraComponent;

// Function KuroRhythmGame.KuroRhythmGameEffectManager.GetSplineComponent
// 0x0008 (0x0008 - 0x0000)
struct KuroRhythmGameEffectManager_GetSplineComponent final
{
public:
	class USplineComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameEffectManager_GetSplineComponent;

// Function KuroRhythmGame.KuroRhythmGameJudgement.Initialize
// 0x0110 (0x0110 - 0x0000)
struct KuroRhythmGameJudgement_Initialize final
{
public:
	struct FKuroRhythmGameConfig                  InGameConfig;                                      // 0x0000(0x0110)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameJudgement_Initialize;

// Function KuroRhythmGame.KuroRhythmGameJudgement.JudgeHit
// 0x0010 (0x0010 - 0x0000)
struct KuroRhythmGameJudgement_JudgeHit final
{
public:
	float                                         TimingError;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKuroRhythmGameHitResult               ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameJudgement_JudgeHit;

// Function KuroRhythmGame.KuroRhythmGameJudgement.GetHoldingNoteIndex
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameJudgement_GetHoldingNoteIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameJudgement_GetHoldingNoteIndex;

// Function KuroRhythmGame.KuroRhythmGameJudgement.GetRemainUpgradeRatingCount
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameJudgement_GetRemainUpgradeRatingCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameJudgement_GetRemainUpgradeRatingCount;

// Function KuroRhythmGame.KuroRhythmGameJudgement.GetScoreBad
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameJudgement_GetScoreBad final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameJudgement_GetScoreBad;

// Function KuroRhythmGame.KuroRhythmGameJudgement.GetScoreGood
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameJudgement_GetScoreGood final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameJudgement_GetScoreGood;

// Function KuroRhythmGame.KuroRhythmGameJudgement.GetScoreGreat
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameJudgement_GetScoreGreat final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameJudgement_GetScoreGreat;

// Function KuroRhythmGame.KuroRhythmGameJudgement.GetScoreMiss
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameJudgement_GetScoreMiss final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameJudgement_GetScoreMiss;

// Function KuroRhythmGame.KuroRhythmGameJudgement.GetScorePerfect
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameJudgement_GetScorePerfect final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameJudgement_GetScorePerfect;

// Function KuroRhythmGame.KuroRhythmGameJudgement.IsDisableRecordUpLoad
// 0x0001 (0x0001 - 0x0000)
struct KuroRhythmGameJudgement_IsDisableRecordUpLoad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameJudgement_IsDisableRecordUpLoad;

// Function KuroRhythmGame.KuroRhythmGameManager.GetGameConfig
// 0x0110 (0x0110 - 0x0000)
struct KuroRhythmGameManager_GetGameConfig final
{
public:
	struct FKuroRhythmGameConfig                  ReturnValue;                                       // 0x0000(0x0110)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_GetGameConfig;

// Function KuroRhythmGame.KuroRhythmGameManager.HandleHoldScoreUpdated
// 0x0008 (0x0008 - 0x0000)
struct KuroRhythmGameManager_HandleHoldScoreUpdated final
{
public:
	int32                                         ScoreGained;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentBeat;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_HandleHoldScoreUpdated;

// Function KuroRhythmGame.KuroRhythmGameManager.InitializeGame
// 0x0138 (0x0138 - 0x0000)
struct KuroRhythmGameManager_InitializeGame final
{
public:
	struct FKuroRhythmGameConfig                  InConfig;                                          // 0x0000(0x0110)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FKuroRhythmSkillEffectParam>    InSkillEffectParams;                               // 0x0110(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class AActor*                                 InShipActor;                                       // 0x0120(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       InSpline;                                          // 0x0128(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0130(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroRhythmGameManager_InitializeGame;

// Function KuroRhythmGame.KuroRhythmGameManager.OnNoteHit
// 0x0010 (0x0010 - 0x0000)
struct KuroRhythmGameManager_OnNoteHit final
{
public:
	int32                                         NoteIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKuroRhythmGameHitResult               HitResult;                                         // 0x0004(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_OnNoteHit;

// Function KuroRhythmGame.KuroRhythmGameManager.OnNoteMissed
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameManager_OnNoteMissed final
{
public:
	int32                                         NoteIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_OnNoteMissed;

// Function KuroRhythmGame.KuroRhythmGameManager.OnPlayerInputDown
// 0x0001 (0x0001 - 0x0000)
struct KuroRhythmGameManager_OnPlayerInputDown final
{
public:
	EKuroRhythmGameInputType                      InputType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_OnPlayerInputDown;

// Function KuroRhythmGame.KuroRhythmGameManager.OnPlayerInputUp
// 0x0001 (0x0001 - 0x0000)
struct KuroRhythmGameManager_OnPlayerInputUp final
{
public:
	EKuroRhythmGameInputType                      InputType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_OnPlayerInputUp;

// Function KuroRhythmGame.KuroRhythmGameManager.ParseChartDataFromJson
// 0x0060 (0x0060 - 0x0000)
struct KuroRhythmGameManager_ParseChartDataFromJson final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKuroRhythmChartData                   OutChartData;                                      // 0x0010(0x0048)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroRhythmGameManager_ParseChartDataFromJson;

// Function KuroRhythmGame.KuroRhythmGameManager.SendChartDataToNiagara
// 0x0048 (0x0048 - 0x0000)
struct KuroRhythmGameManager_SendChartDataToNiagara final
{
public:
	struct FKuroRhythmChartData                   InChartData;                                       // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_SendChartDataToNiagara;

// Function KuroRhythmGame.KuroRhythmGameManager.SetShipMovementSpeed
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameManager_SetShipMovementSpeed final
{
public:
	float                                         InSpeed;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_SetShipMovementSpeed;

// Function KuroRhythmGame.KuroRhythmGameManager.StopGame
// 0x0001 (0x0001 - 0x0000)
struct KuroRhythmGameManager_StopGame final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_StopGame;

// Function KuroRhythmGame.KuroRhythmGameManager.SwitchTrack
// 0x0002 (0x0002 - 0x0000)
struct KuroRhythmGameManager_SwitchTrack final
{
public:
	bool                                          bGoLeft;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_SwitchTrack;

// Function KuroRhythmGame.KuroRhythmGameManager.SwitchTrackInfinity
// 0x0001 (0x0001 - 0x0000)
struct KuroRhythmGameManager_SwitchTrackInfinity final
{
public:
	bool                                          bGoLeft;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_SwitchTrackInfinity;

// Function KuroRhythmGame.KuroRhythmGameManager.Tick
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameManager_Tick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_Tick;

// Function KuroRhythmGame.KuroRhythmGameManager.GetCurrentPhase
// 0x0001 (0x0001 - 0x0000)
struct KuroRhythmGameManager_GetCurrentPhase final
{
public:
	EKuroRhythmGamePhase                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_GetCurrentPhase;

// Function KuroRhythmGame.KuroRhythmGameManager.GetCurrentTrackIndex
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameManager_GetCurrentTrackIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_GetCurrentTrackIndex;

// Function KuroRhythmGame.KuroRhythmGameManager.GetEffectManager
// 0x0008 (0x0008 - 0x0000)
struct KuroRhythmGameManager_GetEffectManager final
{
public:
	class UKuroRhythmGameEffectManager*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_GetEffectManager;

// Function KuroRhythmGame.KuroRhythmGameManager.GetFeverScore
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameManager_GetFeverScore final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_GetFeverScore;

// Function KuroRhythmGame.KuroRhythmGameManager.GetGameplayDuration
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameManager_GetGameplayDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_GetGameplayDuration;

// Function KuroRhythmGame.KuroRhythmGameManager.GetGameplayTime
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameManager_GetGameplayTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_GetGameplayTime;

// Function KuroRhythmGame.KuroRhythmGameManager.GetHiddenScore
// 0x0078 (0x0078 - 0x0000)
struct KuroRhythmGameManager_GetHiddenScore final
{
public:
	struct FKuroRhythmGameHiddenScore             ReturnValue;                                       // 0x0000(0x0078)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_GetHiddenScore;

// Function KuroRhythmGame.KuroRhythmGameManager.GetShipController
// 0x0008 (0x0008 - 0x0000)
struct KuroRhythmGameManager_GetShipController final
{
public:
	class UKuroRhythmGameShipController*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_GetShipController;

// Function KuroRhythmGame.KuroRhythmGameManager.GetStatistics
// 0x002C (0x002C - 0x0000)
struct KuroRhythmGameManager_GetStatistics final
{
public:
	struct FKuroRhythmGameStatistics              ReturnValue;                                       // 0x0000(0x002C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_GetStatistics;

// Function KuroRhythmGame.KuroRhythmGameManager.IsFeverActive
// 0x0001 (0x0001 - 0x0000)
struct KuroRhythmGameManager_IsFeverActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_IsFeverActive;

// Function KuroRhythmGame.KuroRhythmGameManager.IsGameInitialized
// 0x0001 (0x0001 - 0x0000)
struct KuroRhythmGameManager_IsGameInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_IsGameInitialized;

// Function KuroRhythmGame.KuroRhythmGameManager.IsGameRunning
// 0x0001 (0x0001 - 0x0000)
struct KuroRhythmGameManager_IsGameRunning final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameManager_IsGameRunning;

// Function KuroRhythmGame.KuroRhythmGamePlayer.Initialize
// 0x0110 (0x0110 - 0x0000)
struct KuroRhythmGamePlayer_Initialize final
{
public:
	struct FKuroRhythmGameConfig                  InConfig;                                          // 0x0000(0x0110)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGamePlayer_Initialize;

// Function KuroRhythmGame.KuroRhythmGamePlayer.GetCurrentPlayTime
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGamePlayer_GetCurrentPlayTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGamePlayer_GetCurrentPlayTime;

// Function KuroRhythmGame.KuroRhythmGamePlayer.GetTotalDuration
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGamePlayer_GetTotalDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGamePlayer_GetTotalDuration;

// Function KuroRhythmGame.KuroRhythmGamePlayer.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct KuroRhythmGamePlayer_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGamePlayer_IsPlaying;

// Function KuroRhythmGame.KuroRhythmGameShipController.Initialize
// 0x0018 (0x0018 - 0x0000)
struct KuroRhythmGameShipController_Initialize final
{
public:
	class AActor*                                 InShipActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       InSpline;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroRhythmGameManager*                 InGameManager;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_Initialize;

// Function KuroRhythmGame.KuroRhythmGameShipController.StartJump
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameShipController_StartJump final
{
public:
	float                                         JumpDurationMs;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_StartJump;

// Function KuroRhythmGame.KuroRhythmGameShipController.StartTrackSwitch
// 0x000C (0x000C - 0x0000)
struct KuroRhythmGameShipController_StartTrackSwitch final
{
public:
	float                                         TargetLateralOffset;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwitchDuration;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupt;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_StartTrackSwitch;

// Function KuroRhythmGame.KuroRhythmGameShipController.GetCurrentHorizontalRotation
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameShipController_GetCurrentHorizontalRotation final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_GetCurrentHorizontalRotation;

// Function KuroRhythmGame.KuroRhythmGameShipController.GetCurrentSplineDistance
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameShipController_GetCurrentSplineDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_GetCurrentSplineDistance;

// Function KuroRhythmGame.KuroRhythmGameShipController.GetMovementSpeed
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameShipController_GetMovementSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_GetMovementSpeed;

// Function KuroRhythmGame.KuroRhythmGameShipController.GetShipForwardVector
// 0x000C (0x000C - 0x0000)
struct KuroRhythmGameShipController_GetShipForwardVector final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_GetShipForwardVector;

// Function KuroRhythmGame.KuroRhythmGameShipController.GetShipPosition
// 0x000C (0x000C - 0x0000)
struct KuroRhythmGameShipController_GetShipPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_GetShipPosition;

// Function KuroRhythmGame.KuroRhythmGameShipController.GetShipRightVector
// 0x000C (0x000C - 0x0000)
struct KuroRhythmGameShipController_GetShipRightVector final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_GetShipRightVector;

// Function KuroRhythmGame.KuroRhythmGameShipController.GetShipRotation
// 0x000C (0x000C - 0x0000)
struct KuroRhythmGameShipController_GetShipRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_GetShipRotation;

// Function KuroRhythmGame.KuroRhythmGameShipController.GetShipUpVector
// 0x000C (0x000C - 0x0000)
struct KuroRhythmGameShipController_GetShipUpVector final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_GetShipUpVector;

// Function KuroRhythmGame.KuroRhythmGameShipController.GetSplineLength
// 0x0004 (0x0004 - 0x0000)
struct KuroRhythmGameShipController_GetSplineLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_GetSplineLength;

// Function KuroRhythmGame.KuroRhythmGameShipController.IsMoving
// 0x0001 (0x0001 - 0x0000)
struct KuroRhythmGameShipController_IsMoving final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_IsMoving;

// Function KuroRhythmGame.KuroRhythmGameShipController.IsTrackSwitching
// 0x0001 (0x0001 - 0x0000)
struct KuroRhythmGameShipController_IsTrackSwitching final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameShipController_IsTrackSwitching;

// Function KuroRhythmGame.KuroRhythmGameSkillEffectManager.CreateSkillEffect
// 0x0020 (0x0020 - 0x0000)
struct KuroRhythmGameSkillEffectManager_CreateSkillEffect final
{
public:
	struct FKuroRhythmSkillEffectParam            SkillEffectParam;                                  // 0x0000(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UKuroRhythmGameSkillEffectBase*         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameSkillEffectManager_CreateSkillEffect;

// Function KuroRhythmGame.KuroRhythmGameSkillEffectManager.Initialize
// 0x0020 (0x0020 - 0x0000)
struct KuroRhythmGameSkillEffectManager_Initialize final
{
public:
	TArray<struct FKuroRhythmSkillEffectParam>    InSkillEffectParams;                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UKuroRhythmGameManager*                 GameManager;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroRhythmGameJudgement*               Judgement;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRhythmGameSkillEffectManager_Initialize;

}

