#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroCrowdAi

#include "Basic.hpp"

#include "KuroAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum KuroCrowdAi.EKuroCrowdAiNotifyType
// NumValues: 0x0003
enum class EKuroCrowdAiNotifyType : uint8
{
	AnimNotify                               = 0,
	AnimNotifyState                          = 1,
	EKuroCrowdAiNotifyType_MAX               = 2,
};

// Enum KuroCrowdAi.EKuroCrowdAiAnimNotifyStateType
// NumValues: 0x0006
enum class EKuroCrowdAiAnimNotifyStateType : uint8
{
	None                                     = 0,
	AnimNotifyStateAddMaterial               = 1,
	AnimNotifyStateHideMesh                  = 2,
	AnimNotifyStateChangeRadius              = 3,
	AnimNotifyStateAudioEvent                = 4,
	EKuroCrowdAiAnimNotifyStateType_MAX      = 5,
};

// Enum KuroCrowdAi.EKuroCrowdAiAnimNotifyType
// NumValues: 0x0004
enum class EKuroCrowdAiAnimNotifyType : uint8
{
	None                                     = 0,
	AnimNotifyEffect                         = 1,
	AnimNotifyAudioEvent                     = 2,
	EKuroCrowdAiAnimNotifyType_MAX           = 3,
};

// Enum KuroCrowdAi.EKuroCrowdAiBoidAnimState
// NumValues: 0x0006
enum class EKuroCrowdAiBoidAnimState : uint8
{
	Idle                                     = 0,
	Walking                                  = 1,
	Born                                     = 2,
	Destroy                                  = 3,
	Perform                                  = 4,
	EKuroCrowdAiBoidAnimState_MAX            = 5,
};

// ScriptStruct KuroCrowdAi.KuroCrowdAiAnimNotifyEventConfig
// 0x0080 (0x0080 - 0x0000)
struct FKuroCrowdAiAnimNotifyEventConfig final
{
public:
	EKuroCrowdAiNotifyType                        Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCrowdAiAnimNotifyType                    AnimNotifyType;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCrowdAiAnimNotifyStateType               AnimNotifyStateType;                               // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TriggerTime;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffectModelBase*                       EffectAsset;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             EffectTransform;                                   // 0x0020(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UKuroMaterialControllerDataAsset*       MaterialDataAsset;                                 // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetRadius;                                      // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            LerpCurve;                                         // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AudioEvent;                                        // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeDuration;                                      // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAudioFadeCurve                               FadeCurve;                                         // 0x0074(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0xB];                                       // 0x0075(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKuroCrowdAiAnimNotifyEventConfig;

// ScriptStruct KuroCrowdAi.KuroCrowdAiAnimSequenceConfig
// 0x0018 (0x0018 - 0x0000)
struct FKuroCrowdAiAnimSequenceConfig final
{
public:
	int32                                         AnimIndex;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKuroCrowdAiAnimNotifyEventConfig> NotifyEventsConfig;                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroCrowdAiAnimSequenceConfig;

// ScriptStruct KuroCrowdAi.ChunkedPointCode
// 0x0018 (0x0018 - 0x0000)
struct FChunkedPointCode final
{
public:
	struct FIntVector                             ChunkCoord;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             LocalCoord;                                        // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChunkedPointCode;

// ScriptStruct KuroCrowdAi.GridItem
// 0x0020 (0x0020 - 0x0000)
struct FGridItem final
{
public:
	int32                                         Key;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   BoundBox;                                          // 0x0004(0x001C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridItem;

}

