#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroRhythmGame

#include "Basic.hpp"

#include "KuroRhythmGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class KuroRhythmGame.KuroRhythmGameSkillEffectBase
// 0x0008 (0x0038 - 0x0030)
class UKuroRhythmGameSkillEffectBase : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmGameSkillEffectBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmGameSkillEffectBase")
	}
	static class UKuroRhythmGameSkillEffectBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmGameSkillEffectBase>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmGameSkillEffectBase;

// Class KuroRhythmGame.KuroRhythmAutoInputHoldSkillEffect
// 0x0000 (0x0038 - 0x0038)
class UKuroRhythmAutoInputHoldSkillEffect final : public UKuroRhythmGameSkillEffectBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmAutoInputHoldSkillEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmAutoInputHoldSkillEffect")
	}
	static class UKuroRhythmAutoInputHoldSkillEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmAutoInputHoldSkillEffect>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmAutoInputHoldSkillEffect;

// Class KuroRhythmGame.KuroRhythmAutoJudgeModifierSkillEffect
// 0x0008 (0x0040 - 0x0038)
class UKuroRhythmAutoJudgeModifierSkillEffect final : public UKuroRhythmGameSkillEffectBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmAutoJudgeModifierSkillEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmAutoJudgeModifierSkillEffect")
	}
	static class UKuroRhythmAutoJudgeModifierSkillEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmAutoJudgeModifierSkillEffect>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmAutoJudgeModifierSkillEffect;

// Class KuroRhythmGame.KuroRhythmDisableRecordUpLoadSkillEffect
// 0x0000 (0x0038 - 0x0038)
class UKuroRhythmDisableRecordUpLoadSkillEffect final : public UKuroRhythmGameSkillEffectBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmDisableRecordUpLoadSkillEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmDisableRecordUpLoadSkillEffect")
	}
	static class UKuroRhythmDisableRecordUpLoadSkillEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmDisableRecordUpLoadSkillEffect>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmDisableRecordUpLoadSkillEffect;

// Class KuroRhythmGame.KuroRhythmFeverDisableAutoJudgeSkillEffect
// 0x0000 (0x0038 - 0x0038)
class UKuroRhythmFeverDisableAutoJudgeSkillEffect final : public UKuroRhythmGameSkillEffectBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmFeverDisableAutoJudgeSkillEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmFeverDisableAutoJudgeSkillEffect")
	}
	static class UKuroRhythmFeverDisableAutoJudgeSkillEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmFeverDisableAutoJudgeSkillEffect>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmFeverDisableAutoJudgeSkillEffect;

// Class KuroRhythmGame.KuroRhythmFeverDurationExtendSkillEffect
// 0x0008 (0x0040 - 0x0038)
class UKuroRhythmFeverDurationExtendSkillEffect final : public UKuroRhythmGameSkillEffectBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmFeverDurationExtendSkillEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmFeverDurationExtendSkillEffect")
	}
	static class UKuroRhythmFeverDurationExtendSkillEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmFeverDurationExtendSkillEffect>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmFeverDurationExtendSkillEffect;

// Class KuroRhythmGame.KuroRhythmFeverJudgeScoreModifierSkillEffect
// 0x0008 (0x0040 - 0x0038)
class UKuroRhythmFeverJudgeScoreModifierSkillEffect final : public UKuroRhythmGameSkillEffectBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmFeverJudgeScoreModifierSkillEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmFeverJudgeScoreModifierSkillEffect")
	}
	static class UKuroRhythmFeverJudgeScoreModifierSkillEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmFeverJudgeScoreModifierSkillEffect>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmFeverJudgeScoreModifierSkillEffect;

// Class KuroRhythmGame.KuroRhythmGameEffectManager
// 0x0028 (0x0058 - 0x0030)
class UKuroRhythmGameEffectManager final : public UObject
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         EffectSystem;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cleanup();
	void Initialize(class USplineComponent* InSplineComponent, class UNiagaraSystem* InEffectSystem);
	void OnHoldNoteCompleted(int32 NoteIndex);
	void OnHoldNoteInterrupted(int32 NoteIndex);
	void OnNoteHit(int32 NoteIndex, EKuroRhythmGameNoteType NoteType);
	void OnNoteMiss(int32 NoteIndex);
	void SetNiagaraBPM(float BPM);
	void SetNiagaraCurrentTrackIndex(int32 CurrentTrackIndex);
	void Tick(float DeltaTime, float CurrentSplineLength, float CurrentAbsoluteTime, float CurrentTrackSpeed);

	class UNiagaraSystem* GetEffectSystem() const;
	class UNiagaraComponent* GetNiagaraComponent() const;
	class USplineComponent* GetSplineComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmGameEffectManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmGameEffectManager")
	}
	static class UKuroRhythmGameEffectManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmGameEffectManager>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmGameEffectManager;

// Class KuroRhythmGame.KuroRhythmGameJudgement
// 0x01C0 (0x01F0 - 0x0030)
class UKuroRhythmGameJudgement final : public UObject
{
public:
	uint8                                         Pad_30[0x38];                                      // 0x0030(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bGoLeft)>  OnTunnelFlickSwitch;                               // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLineHitTrigger;                                  // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 ScoreGained, int32 CurrentBeat)> OnHoldScoreUpdate;          // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 RemainCount)> OnAutoJudgeCountChange;                        // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnHoldNoteTimeout;                                 // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnHoldNoteInputReleased;                           // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x128];                                     // 0x00C8(0x0128)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Initialize(const struct FKuroRhythmGameConfig& InGameConfig);
	struct FKuroRhythmGameHitResult JudgeHit(float TimingError);

	int32 GetHoldingNoteIndex() const;
	int32 GetRemainUpgradeRatingCount() const;
	int32 GetScoreBad() const;
	int32 GetScoreGood() const;
	int32 GetScoreGreat() const;
	int32 GetScoreMiss() const;
	int32 GetScorePerfect() const;
	bool IsDisableRecordUpLoad() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmGameJudgement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmGameJudgement")
	}
	static class UKuroRhythmGameJudgement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmGameJudgement>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmGameJudgement;

// Class KuroRhythmGame.KuroRhythmGameManager
// 0x0350 (0x0388 - 0x0038)
class UKuroRhythmGameManager final : public UWorldSubsystem
{
public:
	TMulticastInlineDelegate<void(int32 NoteIndex, EKuroRhythmGameNoteType NoteType, EKuroRhythmGameRating Result, const struct FVectorDouble& WorldPosition, const struct FQuat& Rotation)> OnNoteResult; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnAllNotesFinished;                                // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(bool bFeverActive)> OnFeverStateChanged;                           // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(int32 NewLevel, int32 OldLevel)> OnHiddenScoreLevelChanged;        // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(int32 NewFeverScore, int32 OldFeverScore)> OnFeverScoreChanged;    // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(float BeatDurationMs)> OnJumpEvent;                                // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(int32 NewTrackIndex, int32 OldTrackIndex)> OnTrackSwitched;        // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(int32 ScoreGained, int32 CurrentBeat)> OnHoldScoreUpdated;         // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(EKuroRhythmChartEventType EventType)> OnGameEvent;                 // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class AActor*                                 ShipActor;                                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USplineComponent*                       Spline;                                            // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKuroRhythmGameJudgement*               JudgementSystem;                                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKuroRhythmGameShipController*          ShipController;                                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKuroRhythmGameEffectManager*           EffectManager;                                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKuroRhythmGameSkillEffectManager*      SkillEffectManager;                                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FKuroRhythmGameConfig                  GameConfig;                                        // 0x00F8(0x0110)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FKuroRhythmSkillEffectParam>    SkillEffectParams;                                 // 0x0208(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FKuroRhythmGameStatistics              Statistics;                                        // 0x0218(0x002C)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKuroRhythmGameNote>            ChartNotes;                                        // 0x0248(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FKuroRhythmChartEvent>          ChartEvents;                                       // 0x0258(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	EKuroRhythmGamePhase                          CurrentPhase;                                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInitialized;                                      // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_26A[0x2];                                      // 0x026A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GameStartTime;                                     // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PausedTime;                                        // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GameplayDuration;                                  // 0x0274(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NoteEventTimeOffset;                               // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GameplayTimeOffset;                                // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentFeverScore;                                 // 0x0280(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FKuroRhythmGameHiddenScore             CurrentHiddenScore;                                // 0x0284(0x0078)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bFeverActive;                                      // 0x02FC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIgnoreFeverAutoJudge;                             // 0x02FD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2FE[0x2];                                      // 0x02FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FeverScoreGlobalMultiple;                          // 0x0300(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FeverConsumptionTime;                              // 0x0304(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_308[0x4];                                      // 0x0308(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bLineKeyPressed;                                   // 0x030C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30D[0x7];                                      // 0x030D(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentTrackIndex;                                 // 0x0314(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_318[0xC];                                      // 0x0318(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	EKuroRhythmChartEventType                     CurrentRoadState;                                  // 0x0324(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentBPM;                                        // 0x0328(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EKuroRhythmGameInputType, struct FCachedInputState> CachedInputEvents;                      // 0x0330(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cleanup();
	struct FKuroRhythmGameConfig GetGameConfig();
	void HandleHoldNoteInputReleased();
	void HandleHoldNoteTimeout();
	void HandleHoldScoreUpdated(int32 ScoreGained, int32 CurrentBeat);
	bool InitializeGame(const struct FKuroRhythmGameConfig& InConfig, TArray<struct FKuroRhythmSkillEffectParam>* InSkillEffectParams, class AActor* InShipActor, class USplineComponent* InSpline);
	void OnNoteHit(int32 NoteIndex, const struct FKuroRhythmGameHitResult& HitResult);
	void OnNoteMissed(int32 NoteIndex);
	void OnPlayerInputDown(EKuroRhythmGameInputType InputType);
	void OnPlayerInputUp(EKuroRhythmGameInputType InputType);
	bool ParseChartDataFromJson(const class FString& JsonString, struct FKuroRhythmChartData* OutChartData);
	void PauseGame();
	void RestartGame();
	void ResumeGame();
	void SendChartDataToNiagara(const struct FKuroRhythmChartData& InChartData);
	void SetShipMovementSpeed(float InSpeed);
	void StartGame();
	void StopGame(bool bSuccess);
	bool SwitchTrack(bool bGoLeft);
	void SwitchTrackInfinity(bool bGoLeft);
	void Tick(float DeltaTime);

	EKuroRhythmGamePhase GetCurrentPhase() const;
	int32 GetCurrentTrackIndex() const;
	class UKuroRhythmGameEffectManager* GetEffectManager() const;
	int32 GetFeverScore() const;
	float GetGameplayDuration() const;
	float GetGameplayTime() const;
	struct FKuroRhythmGameHiddenScore GetHiddenScore() const;
	class UKuroRhythmGameShipController* GetShipController() const;
	struct FKuroRhythmGameStatistics GetStatistics() const;
	bool IsFeverActive() const;
	bool IsGameInitialized() const;
	bool IsGameRunning() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmGameManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmGameManager")
	}
	static class UKuroRhythmGameManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmGameManager>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmGameManager;

// Class KuroRhythmGame.KuroRhythmGamePlayer
// 0x0118 (0x03C8 - 0x02B0)
class AKuroRhythmGamePlayer final : public AActor
{
public:
	struct FKuroRhythmGameConfig                  GameConfig;                                        // 0x02B0(0x0110)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsPlaying;                                        // 0x03C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentPlayTime;                                   // 0x03C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Initialize(const struct FKuroRhythmGameConfig& InConfig);
	void Pause();
	void Play();
	void Resume();
	void Stop();

	float GetCurrentPlayTime() const;
	float GetTotalDuration() const;
	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmGamePlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmGamePlayer")
	}
	static class AKuroRhythmGamePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroRhythmGamePlayer>();
	}
};
DUMPER7_ASSERTS_AKuroRhythmGamePlayer;

// Class KuroRhythmGame.KuroRhythmGameShipController
// 0x0060 (0x0090 - 0x0030)
class UKuroRhythmGameShipController final : public UObject
{
public:
	class AActor*                                 ShipActor;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USplineComponent*                       Spline;                                            // 0x0038(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKuroRhythmGameManager*                 GameManager;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MovementSpeed;                                     // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TargetMovementSpeed;                               // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpeedAcceleration;                                 // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentSplineDistance;                             // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsMoving;                                         // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastGameplayTime;                                  // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMovingTowardsEnd;                                 // 0x0060(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SplineLength;                                      // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSwitchingTrack;                                 // 0x0068(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TrackSwitchTargetOffset;                           // 0x006C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TrackSwitchDuration;                               // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TrackSwitchElapsedTime;                            // 0x0074(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TrackSwitchStartOffset;                            // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentLateralOffset;                              // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Initialize(class AActor* InShipActor, class USplineComponent* InSpline, class UKuroRhythmGameManager* InGameManager);
	void PauseMovement();
	void ResetToStart();
	void ResumeMovement();
	void StartJump(float JumpDurationMs);
	void StartMovement();
	void StartTrackSwitch(float TargetLateralOffset, float SwitchDuration, bool bInterrupt);
	void StopMovement();

	float GetCurrentHorizontalRotation() const;
	float GetCurrentSplineDistance() const;
	float GetMovementSpeed() const;
	struct FVector GetShipForwardVector() const;
	struct FVector GetShipPosition() const;
	struct FVector GetShipRightVector() const;
	struct FRotator GetShipRotation() const;
	struct FVector GetShipUpVector() const;
	float GetSplineLength() const;
	bool IsMoving() const;
	bool IsTrackSwitching() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmGameShipController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmGameShipController")
	}
	static class UKuroRhythmGameShipController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmGameShipController>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmGameShipController;

// Class KuroRhythmGame.KuroRhythmGameSkillEffectManager
// 0x0060 (0x0090 - 0x0030)
class UKuroRhythmGameSkillEffectManager final : public UObject
{
public:
	TMap<EKuroRhythmSkillEffectType, class UKuroRhythmGameSkillEffectBase*> EffectMap;               // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FKuroRhythmSkillContext                SkillContext;                                      // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void Clear();
	class UKuroRhythmGameSkillEffectBase* CreateSkillEffect(struct FKuroRhythmSkillEffectParam* SkillEffectParam);
	void Initialize(TArray<struct FKuroRhythmSkillEffectParam>* InSkillEffectParams, class UKuroRhythmGameManager* GameManager, class UKuroRhythmGameJudgement* Judgement);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmGameSkillEffectManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmGameSkillEffectManager")
	}
	static class UKuroRhythmGameSkillEffectManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmGameSkillEffectManager>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmGameSkillEffectManager;

// Class KuroRhythmGame.KuroRhythmJudgeScoreAdjustSkillEffect
// 0x0018 (0x0050 - 0x0038)
class UKuroRhythmJudgeScoreAdjustSkillEffect final : public UKuroRhythmGameSkillEffectBase
{
public:
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmJudgeScoreAdjustSkillEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmJudgeScoreAdjustSkillEffect")
	}
	static class UKuroRhythmJudgeScoreAdjustSkillEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmJudgeScoreAdjustSkillEffect>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmJudgeScoreAdjustSkillEffect;

// Class KuroRhythmGame.KuroRhythmJudgeTimeModifierSkillEffect
// 0x0050 (0x0088 - 0x0038)
class UKuroRhythmJudgeTimeModifierSkillEffect final : public UKuroRhythmGameSkillEffectBase
{
public:
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmJudgeTimeModifierSkillEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmJudgeTimeModifierSkillEffect")
	}
	static class UKuroRhythmJudgeTimeModifierSkillEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmJudgeTimeModifierSkillEffect>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmJudgeTimeModifierSkillEffect;

// Class KuroRhythmGame.KuroRhythmJudgeUpgradeLimitedSkillEffect
// 0x0018 (0x0050 - 0x0038)
class UKuroRhythmJudgeUpgradeLimitedSkillEffect final : public UKuroRhythmGameSkillEffectBase
{
public:
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroRhythmJudgeUpgradeLimitedSkillEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroRhythmJudgeUpgradeLimitedSkillEffect")
	}
	static class UKuroRhythmJudgeUpgradeLimitedSkillEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroRhythmJudgeUpgradeLimitedSkillEffect>();
	}
};
DUMPER7_ASSERTS_UKuroRhythmJudgeUpgradeLimitedSkillEffect;

}

