#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroGameplayUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "KuroGameplayUI_structs.hpp"


namespace SDK::Params
{

// Function KuroGameplayUI.DamageUiManager.CreateInstance
// 0x0010 (0x0010 - 0x0000)
struct DamageUiManager_CreateInstance final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDamageUiManager*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DamageUiManager_CreateInstance;

// Function KuroGameplayUI.DamageUiManager.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct DamageUiManager_GetInstance final
{
public:
	class UDamageUiManager*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DamageUiManager_GetInstance;

// Function KuroGameplayUI.DamageUiManager.AddCritNiagara
// 0x0008 (0x0008 - 0x0000)
struct DamageUiManager_AddCritNiagara final
{
public:
	class UNiagaraSystem*                         CritNiagara;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DamageUiManager_AddCritNiagara;

// Function KuroGameplayUI.DamageUiManager.AddDamageInfo
// 0x0038 (0x0038 - 0x0000)
struct DamageUiManager_AddDamageInfo final
{
public:
	struct FDamageInfo                            DamageInfo;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DamageUiManager_AddDamageInfo;

// Function KuroGameplayUI.DamageUiManager.AddDamageViewData
// 0x0034 (0x0034 - 0x0000)
struct DamageUiManager_AddDamageViewData final
{
public:
	struct FDamageViewData                        InDamageViewData;                                  // 0x0000(0x0034)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DamageUiManager_AddDamageViewData;

// Function KuroGameplayUI.DamageUiManager.InitAllRes
// 0x0020 (0x0020 - 0x0000)
struct DamageUiManager_InitAllRes final
{
public:
	class USceneComponent*                        Parent;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AUIBaseActor*                           DynamicBatchActor;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AUIBaseActor*                           DamageActor;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PreloadCount;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMobilePlatform;                                   // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DamageUiManager_InitAllRes;

// Function KuroGameplayUI.DamageUiManager.InitDamageConfig
// 0x0090 (0x0090 - 0x0000)
struct DamageUiManager_InitDamageConfig final
{
public:
	struct FDamageConfig                          InDamageConfig;                                    // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DamageUiManager_InitDamageConfig;

// Function KuroGameplayUI.DamageUiManager.Update
// 0x0028 (0x0028 - 0x0000)
struct DamageUiManager_Update final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CameraLocation;                                    // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      Player;                                            // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DamageUiManager_Update;

// Function KuroGameplayUI.KSC_HeadStateManager.CreateInstance
// 0x0010 (0x0010 - 0x0000)
struct KSC_HeadStateManager_CreateInstance final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKSC_HeadStateManager*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_HeadStateManager_CreateInstance;

// Function KuroGameplayUI.KSC_HeadStateManager.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct KSC_HeadStateManager_GetInstance final
{
public:
	class UKSC_HeadStateManager*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_HeadStateManager_GetInstance;

// Function KuroGameplayUI.KSC_HeadStateManager.InitAllRes
// 0x0020 (0x0020 - 0x0000)
struct KSC_HeadStateManager_InitAllRes final
{
public:
	class USceneComponent*                        Parent;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AUIBaseActor*                           DynamicBatchActor;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AUIBaseActor*                           HeadStateActor;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            ScaleCurve;                                        // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_HeadStateManager_InitAllRes;

// Function KuroGameplayUI.KSC_HeadStateManager.Update
// 0x0020 (0x0020 - 0x0000)
struct KSC_HeadStateManager_Update final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CameraLocation;                                    // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_HeadStateManager_Update;

}

