#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroCloudGame

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct KuroCloudGame.DeviceResolution
// 0x0008 (0x0008 - 0x0000)
struct FDeviceResolution final
{
public:
	int32                                         Height;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDeviceResolution;

// ScriptStruct KuroCloudGame.ScreenResolution
// 0x0008 (0x0008 - 0x0000)
struct FScreenResolution final
{
public:
	int32                                         Height;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FScreenResolution;

// ScriptStruct KuroCloudGame.LoginInfo
// 0x0048 (0x0048 - 0x0000)
struct FLoginInfo final
{
public:
	class FString                                 DeviceId;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoginCode;                                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Token;                                             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Uid;                                               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserName;                                          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLoginInfo;

// ScriptStruct KuroCloudGame.LoginPreLaunchStruct
// 0x0090 (0x0090 - 0x0000)
struct FLoginPreLaunchStruct final
{
public:
	class FString                                 Device;                                            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Platform;                                          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Dpi;                                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Fps;                                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TraceId;                                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDeviceResolution                      DeviceResolution;                                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FScreenResolution                      ScreenResolution;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLoginInfo                             LoginInfo;                                         // 0x0048(0x0048)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLoginPreLaunchStruct;

// ScriptStruct KuroCloudGame.VirtualKeyBoardStruct
// 0x0010 (0x0010 - 0x0000)
struct FVirtualKeyBoardStruct final
{
public:
	class FString                                 Context;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVirtualKeyBoardStruct;

// ScriptStruct KuroCloudGame.ClipBoardCopyStruct
// 0x0010 (0x0010 - 0x0000)
struct FClipBoardCopyStruct final
{
public:
	class FString                                 CopyText;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FClipBoardCopyStruct;

}

