#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroPointCloud

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "KuroPointCloud_structs.hpp"


namespace SDK::Params
{

// Function KuroPointCloud.KuroPointCloudActor.MarkPointsInBox
// 0x001C (0x001C - 0x0000)
struct KuroPointCloudActor_MarkPointsInBox final
{
public:
	struct FBox                                   BoxWS;                                             // 0x0000(0x001C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudActor_MarkPointsInBox;

// Function KuroPointCloud.KuroPointCloudCache.GetMetaDataFloat
// 0x0010 (0x0010 - 0x0000)
struct KuroPointCloudCache_GetMetaDataFloat final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudCache_GetMetaDataFloat;

// Function KuroPointCloud.KuroPointCloudCache.GetMetaDataInt
// 0x0010 (0x0010 - 0x0000)
struct KuroPointCloudCache_GetMetaDataInt final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudCache_GetMetaDataInt;

// Function KuroPointCloud.KuroPointCloudCache.HasMetaDataFloat
// 0x0010 (0x0010 - 0x0000)
struct KuroPointCloudCache_HasMetaDataFloat final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPointCloudCache_HasMetaDataFloat;

// Function KuroPointCloud.KuroPointCloudCache.HasMetaDataInt
// 0x0010 (0x0010 - 0x0000)
struct KuroPointCloudCache_HasMetaDataInt final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPointCloudCache_HasMetaDataInt;

// Function KuroPointCloud.KuroPointCloudCache.SetMetaDataFloat
// 0x0010 (0x0010 - 0x0000)
struct KuroPointCloudCache_SetMetaDataFloat final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudCache_SetMetaDataFloat;

// Function KuroPointCloud.KuroPointCloudCache.SetMetaDataInt
// 0x0010 (0x0010 - 0x0000)
struct KuroPointCloudCache_SetMetaDataInt final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudCache_SetMetaDataInt;

// Function KuroPointCloud.KuroPointCloudCache.UpdateFromData
// 0x0038 (0x0038 - 0x0000)
struct KuroPointCloudCache_UpdateFromData final
{
public:
	TArray<struct FVector>                        Positions;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FQuat>                          Rotations;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Scales;                                            // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPointCloudCache_UpdateFromData;

// Function KuroPointCloud.KuroPointCloudCache.UpdateFromDataEx
// 0x0088 (0x0088 - 0x0000)
struct KuroPointCloudCache_UpdateFromDataEx final
{
public:
	TArray<struct FVector>                        Positions;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FQuat>                          Rotations;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Scales;                                            // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 Ages;                                              // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 Indices;                                           // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FKuroPointCloudCacheCustomFloat> CustomFloats;                                     // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 CurveStartTimes;                                   // 0x0060(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FKuroPointCloudCacheCustomFloat> CurveCustomFloats;                                // 0x0070(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPointCloudCache_UpdateFromDataEx;

// Function KuroPointCloud.KuroPointCloudCache.CheckConsistency
// 0x0002 (0x0002 - 0x0000)
struct KuroPointCloudCache_CheckConsistency final
{
public:
	bool                                          Verbosity;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudCache_CheckConsistency;

// Function KuroPointCloud.KuroPointCloudFunctionLibrary.SetNiagaraKuroPointCloudCache
// 0x0020 (0x0020 - 0x0000)
struct KuroPointCloudFunctionLibrary_SetNiagaraKuroPointCloudCache final
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroPointCloudCache*                   KuroPointCloudCache;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPointCloudFunctionLibrary_SetNiagaraKuroPointCloudCache;

// Function KuroPointCloud.KuroPointCloudInstance.BuildFrom2DPoints
// 0x0050 (0x0050 - 0x0000)
struct KuroPointCloudInstance_BuildFrom2DPoints final
{
public:
	TArray<struct FIntPoint>                      InPoints;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             InPlaneToWorld;                                    // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         MaxHeight;                                         // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPointCloudInstance_BuildFrom2DPoints;

// Function KuroPointCloud.KuroPointCloudInstance.BuildFromPointCloudData
// 0x0030 (0x0030 - 0x0000)
struct KuroPointCloudInstance_BuildFromPointCloudData final
{
public:
	TArray<struct FVector>                        Positions;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FQuat>                          Rotations;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Scales;                                            // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudInstance_BuildFromPointCloudData;

// Function KuroPointCloud.KuroPointCloudInstance.GetBound
// 0x001C (0x001C - 0x0000)
struct KuroPointCloudInstance_GetBound final
{
public:
	struct FBox                                   ReturnValue;                                       // 0x0000(0x001C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudInstance_GetBound;

// Function KuroPointCloud.KuroPointCloudInstance.GetPointCloudCache
// 0x0008 (0x0008 - 0x0000)
struct KuroPointCloudInstance_GetPointCloudCache final
{
public:
	class UKuroPointCloudCache*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudInstance_GetPointCloudCache;

// Function KuroPointCloud.KuroPointCloudInstance.GetQueryPointsNum
// 0x0028 (0x0028 - 0x0000)
struct KuroPointCloudInstance_GetQueryPointsNum final
{
public:
	struct FKuroPointCloudInstanceQueryResult     QueryResult;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPointCloudInstance_GetQueryPointsNum;

// Function KuroPointCloud.KuroPointCloudInstance.GetQueryPointTransform
// 0x0050 (0x0050 - 0x0000)
struct KuroPointCloudInstance_GetQueryPointTransform final
{
public:
	struct FKuroPointCloudInstanceQueryResult     QueryResult;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutPosition;                                       // 0x0024(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  OutRotation;                                       // 0x0030(0x0010)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                OutScale;                                          // 0x0040(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x004C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPointCloudInstance_GetQueryPointTransform;

// Function KuroPointCloud.KuroPointCloudInstance.SphereQuery
// 0x0030 (0x0030 - 0x0000)
struct KuroPointCloudInstance_SphereQuery final
{
public:
	struct FVector                                SphereCenter;                                      // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SphereRadius;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKuroPointCloudInstanceQueryResult     ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudInstance_SphereQuery;

// Function KuroPointCloud.KuroPointCloudStreamingConfig.SetInstanceData
// 0x0020 (0x0020 - 0x0000)
struct KuroPointCloudStreamingConfig_SetInstanceData final
{
public:
	int32                                         CellX;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CellY;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CollectionName;                                    // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroPointCloudInstance*                PointCloudInstance;                                // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudStreamingConfig_SetInstanceData;

// Function KuroPointCloud.KuroPointCloudWorldActor.DeleteAllActorsInGroup
// 0x0020 (0x0020 - 0x0000)
struct KuroPointCloudWorldActor_DeleteAllActorsInGroup final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetGroupName;                                   // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetSubGroupName;                                // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudWorldActor_DeleteAllActorsInGroup;

// Function KuroPointCloud.KuroPointCloudWorldComponent.GetInstance
// 0x0010 (0x0010 - 0x0000)
struct KuroPointCloudWorldComponent_GetInstance final
{
public:
	bool                                          bCreateIfNull;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroPointCloudInstance*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudWorldComponent_GetInstance;

// Function KuroPointCloud.KuroPointCloudWorldComponent.SetInstance
// 0x0008 (0x0008 - 0x0000)
struct KuroPointCloudWorldComponent_SetInstance final
{
public:
	class UKuroPointCloudInstance*                Instance;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudWorldComponent_SetInstance;

// Function KuroPointCloud.KuroPointCloudWorldComponent.GetNumDynamicPoints
// 0x0004 (0x0004 - 0x0000)
struct KuroPointCloudWorldComponent_GetNumDynamicPoints final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPointCloudWorldComponent_GetNumDynamicPoints;

// Function KuroPointCloud.KuroPointCloudWorldComponent.SampleDynamicPoint
// 0x0050 (0x0050 - 0x0000)
struct KuroPointCloudWorldComponent_SampleDynamicPoint final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OutTransform;                                      // 0x0010(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPointCloudWorldComponent_SampleDynamicPoint;

// Function KuroPointCloud.KuroPointCloudWorldSystem.SetStreamingConfig
// 0x0010 (0x0010 - 0x0000)
struct KuroPointCloudWorldSystem_SetStreamingConfig final
{
public:
	class UKuroPointCloudStreamingConfig*         Config;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StreamingDistance;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPointCloudWorldSystem_SetStreamingConfig;

// Function KuroPointCloud.KuroVirtualPointCloud2DQTree.BuildFromPointData
// 0x0050 (0x0050 - 0x0000)
struct KuroVirtualPointCloud2DQTree_BuildFromPointData final
{
public:
	TArray<struct FIntPoint>                      InPoints;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             InPlaneToWorld;                                    // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         MaxHeight;                                         // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroVirtualPointCloud2DQTree_BuildFromPointData;

// Function KuroPointCloud.KuroVirtualPointCloud2DQTree.GetRotation
// 0x0010 (0x0010 - 0x0000)
struct KuroVirtualPointCloud2DQTree_GetRotation final
{
public:
	struct FQuat                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVirtualPointCloud2DQTree_GetRotation;

// Function KuroPointCloud.KuroVirtualPointCloud2DQTree.GetWorldBound
// 0x001C (0x001C - 0x0000)
struct KuroVirtualPointCloud2DQTree_GetWorldBound final
{
public:
	struct FBox                                   ReturnValue;                                       // 0x0000(0x001C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVirtualPointCloud2DQTree_GetWorldBound;

// Function KuroPointCloud.KuroVirtualPointCloud2DQTree.SphereQuery
// 0x0020 (0x0020 - 0x0000)
struct KuroVirtualPointCloud2DQTree_SphereQuery final
{
public:
	struct FVector                                SphereCenter;                                      // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SphereRadius;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FIntPoint>                      OutResult;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVirtualPointCloud2DQTree_SphereQuery;

// Function KuroPointCloud.KuroVirtualPointCloud2DQTree.TransformPointToWorld
// 0x0014 (0x0014 - 0x0000)
struct KuroVirtualPointCloud2DQTree_TransformPointToWorld final
{
public:
	struct FIntPoint                              Point;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVirtualPointCloud2DQTree_TransformPointToWorld;

}

