#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroInteractionEffect

#include "Basic.hpp"

#include "KuroInteractionEffect_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KuroInteractionEffect.KuroEnviInteractionComponent.GetEnviInteractionData
// 0x00D8 (0x00D8 - 0x0000)
struct KuroEnviInteractionComponent_GetEnviInteractionData final
{
public:
	struct FKuroEnviInteractionData               ReturnValue;                                       // 0x0000(0x00D8)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEnviInteractionComponent_GetEnviInteractionData;

// Function KuroInteractionEffect.KuroEnviInteractionComponent.GetRainWalkOcclusionParam
// 0x0004 (0x0004 - 0x0000)
struct KuroEnviInteractionComponent_GetRainWalkOcclusionParam final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEnviInteractionComponent_GetRainWalkOcclusionParam;

// Function KuroInteractionEffect.KuroEnviInteractionComponent.SetDecalCompShiftColor
// 0x0008 (0x0008 - 0x0000)
struct KuroEnviInteractionComponent_SetDecalCompShiftColor final
{
public:
	class UDecalComponent*                        DecalComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEnviInteractionComponent_SetDecalCompShiftColor;

// Function KuroInteractionEffect.KuroEnviInteractionComponent.SetNiagaraCompShiftColor
// 0x0008 (0x0008 - 0x0000)
struct KuroEnviInteractionComponent_SetNiagaraCompShiftColor final
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEnviInteractionComponent_SetNiagaraCompShiftColor;

// Function KuroInteractionEffect.KuroEnviInteractionComponent.UpdateRainOcclusion
// 0x0020 (0x0020 - 0x0000)
struct KuroEnviInteractionComponent_UpdateRainOcclusion final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTraceBaseElement*                      Element;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Frame;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Index_0;                                           // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroEnviInteractionComponent_UpdateRainOcclusion;

// Function KuroInteractionEffect.KuroInteractionEffectSystem.GetKuroInteractionEffectSystem
// 0x0010 (0x0010 - 0x0000)
struct KuroInteractionEffectSystem_GetKuroInteractionEffectSystem final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroInteractionEffectSystem*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroInteractionEffectSystem_GetKuroInteractionEffectSystem;

// Function KuroInteractionEffect.KuroInteractionEffectSystem.RegisterNDIKuroRenderingEIComp
// 0x0010 (0x0010 - 0x0000)
struct KuroInteractionEffectSystem_RegisterNDIKuroRenderingEIComp final
{
public:
	class UNiagaraComponent*                      InNiagaraComp;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroEnviInteractionComponent*          SourceEIComp;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroInteractionEffectSystem_RegisterNDIKuroRenderingEIComp;

// Function KuroInteractionEffect.KuroInteractionEffectSystem.RegisterSPModelCharacterEIComp
// 0x0010 (0x0010 - 0x0000)
struct KuroInteractionEffectSystem_RegisterSPModelCharacterEIComp final
{
public:
	class UNiagaraComponent*                      InNiagaraComp;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroEnviInteractionComponent*          SourceEIComp;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroInteractionEffectSystem_RegisterSPModelCharacterEIComp;

// Function KuroInteractionEffect.KuroInteractionEffectSystem.SearchInteractionFoliage
// 0x0018 (0x0018 - 0x0000)
struct KuroInteractionEffectSystem_SearchInteractionFoliage final
{
public:
	class FString                                 FoliageTypeName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroInteractionEffectSystem_SearchInteractionFoliage;

// Function KuroInteractionEffect.KuroInteractionEffectSystem.SearchInteractionFoliageArray
// 0x0020 (0x0020 - 0x0000)
struct KuroInteractionEffectSystem_SearchInteractionFoliageArray final
{
public:
	TArray<class FString>                         FoliageTypeNames;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroInteractionEffectSystem_SearchInteractionFoliageArray;

// Function KuroInteractionEffect.KuroInteractionEffectSystem.SearchInteractionPlacementTriggerActor
// 0x0028 (0x0028 - 0x0000)
struct KuroInteractionEffectSystem_SearchInteractionPlacementTriggerActor final
{
public:
	class UStaticMesh*                            PlacementMesh;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroInteractionEffectSystem_SearchInteractionPlacementTriggerActor;

}

