#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroData

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class KuroData.KuroHitResult
// 0x0218 (0x0248 - 0x0030)
class UKuroHitResult final : public UObject
{
public:
	uint8                                         Pad_30[0xA8];                                      // 0x0030(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBlockingHit;                                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartPenetrating;                                 // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class AActor>>          Actors;                                            // 0x00E0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class UPrimitiveComponent>> Components;                                    // 0x00F0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class UPhysicalMaterial>> PhysMaterials;                                   // 0x0100(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class FString>                         BoneNameArray;                                     // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ElementIndexArray;                                 // 0x0120(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FaceIndexArray;                                    // 0x0130(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 ItemArray;                                         // 0x0140(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 DistanceArray;                                     // 0x0150(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 PenetrationDepthArray;                             // 0x0160(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 TimeArray;                                         // 0x0170(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ImpactNormalX_Array;                               // 0x0180(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ImpactNormalY_Array;                               // 0x0190(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ImpactNormalZ_Array;                               // 0x01A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ImpactPointX_Array;                                // 0x01B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ImpactPointY_Array;                                // 0x01C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ImpactPointZ_Array;                                // 0x01D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 LocationX_Array;                                   // 0x01E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 LocationY_Array;                                   // 0x01F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 LocationZ_Array;                                   // 0x0200(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 NormalX_Array;                                     // 0x0210(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 NormalY_Array;                                     // 0x0220(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 NormalZ_Array;                                     // 0x0230(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_240[0x8];                                      // 0x0240(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Clear();

	int32 GetHitCount() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroHitResult")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroHitResult")
	}
	static class UKuroHitResult* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroHitResult>();
	}
};
DUMPER7_ASSERTS_UKuroHitResult;

// Class KuroData.KuroTraceLibrary
// 0x0000 (0x0030 - 0x0030)
class UKuroTraceLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AsyncBoxTrace(class UTraceBoxElement* Element, const class FString& ProfileKey, const TDelegate<void(bool Result, class UTraceBaseElement* Element, double Frame, double Index)>& Delegate, const double Frame, const double Index_0);
	static void AsyncCapsuleTrace(class UTraceCapsuleElement* Element, const class FString& ProfileKey, const TDelegate<void(bool Result, class UTraceBaseElement* Element, double Frame, double Index)>& Delegate, const double Frame, const double Index_0);
	static void AsyncLineTrace(class UTraceLineElement* Element, const class FString& ProfileKey, const TDelegate<void(bool Result, class UTraceBaseElement* Element, double Frame, double Index)>& Delegate, const double Frame, const double Index_0);
	static void AsyncSphereTrace(class UTraceSphereElement* Element, const class FString& ProfileKey, const TDelegate<void(bool Result, class UTraceBaseElement* Element, double Frame, double Index)>& Delegate, const double Frame, const double Index_0);
	static bool BoxTrace(class UTraceBoxElement* Element, const class FString& ProfileKey);
	static bool CapsuleTrace(class UTraceCapsuleElement* Element, const class FString& ProfileKey);
	static bool LineTrace(class UTraceLineElement* Element, const class FString& ProfileKey);
	static bool ShapeTrace(class UShapeComponent* InShapeComp, class UTraceBaseElement* Element, const class FName& TraceTagName, const class FString& ProfileKey);
	static bool SphereTrace(class UTraceSphereElement* Element, const class FString& ProfileKey);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroTraceLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroTraceLibrary")
	}
	static class UKuroTraceLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroTraceLibrary>();
	}
};
DUMPER7_ASSERTS_UKuroTraceLibrary;

// Class KuroData.TraceBaseElement
// 0x00B8 (0x00E8 - 0x0030)
class UTraceBaseElement : public UObject
{
public:
	class UObject*                                WorldContextObject;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x28];                                      // 0x0038(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UKuroHitResult*                         HitResult;                                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StartX;                                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StartY;                                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StartZ;                                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        EndX;                                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        EndY;                                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        EndZ;                                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceColor_R;                                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceColor_G;                                      // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceColor_B;                                      // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceColor_A;                                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHitColor_R;                                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHitColor_G;                                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHitColor_B;                                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHitColor_A;                                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DrawTime;                                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTraceComplex;                                     // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreSelf;                                       // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSingle;                                         // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBoth;                                           // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTraceCapsuleAsSphere;                           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsProfile;                                        // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ProfileName;                                       // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddObjectTypeQuery(EObjectTypeQuery ObjectType);
	void ClearCacheData(bool bClearWorld);
	void Dispose();
	void SetDrawDebugTrace(EDrawDebugTrace Type);
	void SetEndLocation(double X, double Y, double Z);
	void SetObjectTypesQuery(TArray<EObjectTypeQuery>* ObjectTypes);
	void SetStartLocation(double X, double Y, double Z);
	void SetTraceColor(float R, float G, float B, float A);
	void SetTraceHitColor(float R, float G, float B, float A);
	void SetTraceTypeQuery(ETraceTypeQuery Type);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TraceBaseElement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TraceBaseElement")
	}
	static class UTraceBaseElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTraceBaseElement>();
	}
};
DUMPER7_ASSERTS_UTraceBaseElement;

// Class KuroData.TraceLineElement
// 0x0000 (0x00E8 - 0x00E8)
class UTraceLineElement final : public UTraceBaseElement
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TraceLineElement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TraceLineElement")
	}
	static class UTraceLineElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTraceLineElement>();
	}
};
DUMPER7_ASSERTS_UTraceLineElement;

// Class KuroData.TraceBoxElement
// 0x0018 (0x0100 - 0x00E8)
class UTraceBoxElement final : public UTraceBaseElement
{
public:
	float                                         HalfSizeX;                                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfSizeY;                                         // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfSizeZ;                                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OrientationPitch;                                  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OrientationYaw;                                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OrientationRoll;                                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetBoxHalfSize(float X, float Y, float Z);
	void SetBoxOrientation(float Pitch, float Yaw, float Roll);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TraceBoxElement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TraceBoxElement")
	}
	static class UTraceBoxElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTraceBoxElement>();
	}
};
DUMPER7_ASSERTS_UTraceBoxElement;

// Class KuroData.TraceCapsuleElement
// 0x0018 (0x0100 - 0x00E8)
class UTraceCapsuleElement final : public UTraceBaseElement
{
public:
	float                                         Radius;                                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfHeight;                                        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OrientationPitch;                                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OrientationYaw;                                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OrientationRoll;                                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCapsuleOrientation(float Pitch, float Yaw, float Roll);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TraceCapsuleElement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TraceCapsuleElement")
	}
	static class UTraceCapsuleElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTraceCapsuleElement>();
	}
};
DUMPER7_ASSERTS_UTraceCapsuleElement;

// Class KuroData.TraceSphereElement
// 0x0008 (0x00F0 - 0x00E8)
class UTraceSphereElement final : public UTraceBaseElement
{
public:
	float                                         Radius;                                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TraceSphereElement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TraceSphereElement")
	}
	static class UTraceSphereElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTraceSphereElement>();
	}
};
DUMPER7_ASSERTS_UTraceSphereElement;

}

