#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroGamepadFeedbackSequenceRuntime

#include "Basic.hpp"

#include "KuroMath_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class KuroGamepadFeedbackSequenceRuntime.KuroMovieSceneGamepadForceFeedbackSection
// 0x0050 (0x0148 - 0x00F8)
class UKuroMovieSceneGamepadForceFeedbackSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_F8[0x28];                                      // 0x00F8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroForceFeedbackEffect*               GamepadForceFeedbackEffect;                        // 0x0120(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeInTime;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEasingType                                   FadeInEasingType;                                  // 0x012C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeOutTime;                                       // 0x0130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEasingType                                   FadeOutEasingType;                                 // 0x0134(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale;                                             // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13C[0xC];                                      // 0x013C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroMovieSceneGamepadForceFeedbackSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroMovieSceneGamepadForceFeedbackSection")
	}
	static class UKuroMovieSceneGamepadForceFeedbackSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroMovieSceneGamepadForceFeedbackSection>();
	}
};
DUMPER7_ASSERTS_UKuroMovieSceneGamepadForceFeedbackSection;

// Class KuroGamepadFeedbackSequenceRuntime.KuroMovieSceneGamepadForceFeedbackTrack
// 0x0020 (0x00B8 - 0x0098)
class UKuroMovieSceneGamepadForceFeedbackTrack final : public UMovieSceneTrack
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsAMasterTrack;                                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroMovieSceneGamepadForceFeedbackTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroMovieSceneGamepadForceFeedbackTrack")
	}
	static class UKuroMovieSceneGamepadForceFeedbackTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroMovieSceneGamepadForceFeedbackTrack>();
	}
};
DUMPER7_ASSERTS_UKuroMovieSceneGamepadForceFeedbackTrack;

}

