#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroLevelStateMachine

#include "Basic.hpp"


namespace SDK::Params
{

// Function KuroLevelStateMachine.KuroLevelStateMachineComponent.HasState
// 0x0010 (0x0010 - 0x0000)
struct KuroLevelStateMachineComponent_HasState final
{
public:
	class FName                                   StateName;                                         // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroLevelStateMachineComponent_HasState;

// Function KuroLevelStateMachine.KuroLevelStateMachineComponent.SetState
// 0x0010 (0x0010 - 0x0000)
struct KuroLevelStateMachineComponent_SetState final
{
public:
	class FName                                   StateName;                                         // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroLevelStateMachineComponent_SetState;

}

