#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpacityMicroMap

#include "Basic.hpp"

#include "OpacityMicroMap_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class OpacityMicroMap.OpacityMicroMapData
// 0x0068 (0x0098 - 0x0030)
class UOpacityMicroMapData final : public UObject
{
public:
	TArray<uint8>                                 ArrayData;                                         // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 DescArrayData;                                     // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOpacityMicroMapUsageCount>     DescArrayHistogram;                                // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 IndexBuffer;                                       // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          Is16BitIndexBuffer;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOpacityMicroMapUsageCount>     IndexHistogram;                                    // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint32                                        MaxSubdivisionLevel;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOpacityMicromapFlags                         Flags_0;                                           // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsTwoState;                                        // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        VersionHash;                                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpacityMicroMapData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpacityMicroMapData")
	}
	static class UOpacityMicroMapData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpacityMicroMapData>();
	}
};
DUMPER7_ASSERTS_UOpacityMicroMapData;

// Class OpacityMicroMap.OpacityMicroMapCollection
// 0x0050 (0x0080 - 0x0030)
class UOpacityMicroMapCollection final : public UObject
{
public:
	TMap<uint64, class UOpacityMicroMapData*>     Collection;                                        // 0x0030(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpacityMicroMapCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpacityMicroMapCollection")
	}
	static class UOpacityMicroMapCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpacityMicroMapCollection>();
	}
};
DUMPER7_ASSERTS_UOpacityMicroMapCollection;

// Class OpacityMicroMap.OpacityMicroMapAsset
// 0x0008 (0x0038 - 0x0030)
class UOpacityMicroMapAsset final : public UAssetUserData
{
public:
	class UOpacityMicroMapCollection*             Collection;                                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpacityMicroMapAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpacityMicroMapAsset")
	}
	static class UOpacityMicroMapAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpacityMicroMapAsset>();
	}
};
DUMPER7_ASSERTS_UOpacityMicroMapAsset;

// Class OpacityMicroMap.OMMBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class UOMMBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void RecreateStaticRaytracedMeshes(const class UObject* WorldContextObject, bool ForceDisableOpacityMicromapsInput);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OMMBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OMMBlueprintLibrary")
	}
	static class UOMMBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOMMBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UOMMBlueprintLibrary;

// Class OpacityMicroMap.OpacityMicromapPluginSettings
// 0x0020 (0x0068 - 0x0048)
class UOpacityMicromapPluginSettings final : public UDeveloperSettings
{
public:
	bool                                          bEnableOpacityMicromaps;                           // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOMMSDKBaker;                                   // 0x0049(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBuildOMMsOnUIChanges;                             // 0x004A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBuildOMMsOnLevelSaved;                            // 0x004B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOpacityMaskTextureDesc>        OpacityMaskTextureParams;                          // 0x0050(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	int32                                         OmmCookMaxLod;                                     // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOpacityMicromapFormat                        OmmCookFormat;                                     // 0x0064(0x0002)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpacityMicromapPluginSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpacityMicromapPluginSettings")
	}
	static class UOpacityMicromapPluginSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpacityMicromapPluginSettings>();
	}
};
DUMPER7_ASSERTS_UOpacityMicromapPluginSettings;

}

