#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PD_CharacterControllerData

#include "Basic.hpp"

#include "KuroCurve_structs.hpp"


namespace SDK::Params
{

// Function PD_CharacterControllerData.PD_CharacterControllerData_C.InitCache
// 0x0068 (0x0068 - 0x0000)
struct PD_CharacterControllerData_C_InitCache final
{
public:
	TArray<struct FKuroCurveLinearColor>          ColorEnd;                                          // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKuroCurveLinearColor>          ColorLoop;                                         // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKuroCurveLinearColor>          ColorStart;                                        // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKuroCurveFloat>                FloatEnd;                                          // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKuroCurveFloat>                FloatLoop;                                         // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKuroCurveFloat>                FloatStart;                                        // 0x0050(0x0010)(Edit, BlueprintVisible)
	class UKuroCharacterMaterialControllerCache*  CallFunc_SpawnObject_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PD_CharacterControllerData_C_InitCache;

}

