#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SE_ControllerInterface

#include "Basic.hpp"


namespace SDK::Params
{

// Function SE_ControllerInterface.SE_ControllerInterface_C.Start
// 0x0004 (0x0004 - 0x0000)
struct SE_ControllerInterface_C_Start final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SE_ControllerInterface_C_Start;

// Function SE_ControllerInterface.SE_ControllerInterface_C.Loop
// 0x0004 (0x0004 - 0x0000)
struct SE_ControllerInterface_C_Loop final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SE_ControllerInterface_C_Loop;

// Function SE_ControllerInterface.SE_ControllerInterface_C.End
// 0x0004 (0x0004 - 0x0000)
struct SE_ControllerInterface_C_End final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SE_ControllerInterface_C_End;

// Function SE_ControllerInterface.SE_ControllerInterface_C.ApplyAlpha
// 0x0004 (0x0004 - 0x0000)
struct SE_ControllerInterface_C_ApplyAlpha final
{
public:
	float                                         alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SE_ControllerInterface_C_ApplyAlpha;

// Function SE_ControllerInterface.SE_ControllerInterface_C.ApplyVisibility
// 0x0001 (0x0001 - 0x0000)
struct SE_ControllerInterface_C_ApplyVisibility final
{
public:
	bool                                          visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SE_ControllerInterface_C_ApplyVisibility;

// Function SE_ControllerInterface.SE_ControllerInterface_C.ApplyEnvironmentFactor
// 0x0004 (0x0004 - 0x0000)
struct SE_ControllerInterface_C_ApplyEnvironmentFactor final
{
public:
	float                                         EnvironmentFactor;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SE_ControllerInterface_C_ApplyEnvironmentFactor;

}

