#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SFollowShooterEnablePriorityInfo

#include "Basic.hpp"

#include "BPEEnableFollowShooter_structs.hpp"


namespace SDK
{

// UserDefinedStruct SFollowShooterEnablePriorityInfo.SFollowShooterEnablePriorityInfo
// 0x0010 (0x0010 - 0x0000)
struct FSFollowShooterEnablePriorityInfo final
{
public:
	EBPEEnableFollowShooter                       EnableType_2_3A2B31824D963C33231C3A849E4D683C;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EnterSkillId_12_C2324A3443BC922209193C90A99464C2;  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ExitSkillId_13_89C97A8748707F53DC42359D165C9744;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnterSkillReentrant_17_E4A5DDD34D54DEA6A118E29C890D02DF; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FSFollowShooterEnablePriorityInfo;

}

