#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SNiagaraParam

#include "Basic.hpp"

#include "KuroCurve_structs.hpp"


namespace SDK
{

// UserDefinedStruct SNiagaraParam.SNiagaraParam
// 0x0108 (0x0108 - 0x0000)
struct FSNiagaraParam final
{
public:
	int32                                         ID_14_C390AD394BEACC3EB69D1DB31A8D685A;            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FKuroCurveFloat>     FloatParameters_15_E66693664565A6042A4B9B87C21EC253; // 0x0008(0x0050)(Edit, BlueprintVisible)
	TMap<class FName, struct FKuroCurveLinearColor> ColorParameters_16_D8A1F94842911439E863AA8E9063FF2D; // 0x0058(0x0050)(Edit, BlueprintVisible)
	TMap<class FName, struct FKuroCurveVector>    VectorParameters_17_1AE4CDDD44406B3B50443FA52006DD7A; // 0x00A8(0x0050)(Edit, BlueprintVisible)
	float                                         StartTime_21_F4AB0D9E43BCA88D5395AE89091A941C;     // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LoopTime_23_94F32E3248906A5DEE2E03A49A2BBA38;      // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndTime_25_7BAED4764247F9E1195EE19C13C8ACB5;       // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ManualLifeTime_29_9907853F47E6ECE8315189B3CDBCBA3C; // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSNiagaraParam;

}

