#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SReBulletDataChildren

#include "Basic.hpp"

#include "EBulletChildrenType_structs.hpp"


namespace SDK
{

// UserDefinedStruct SReBulletDataChildren.SReBulletDataChildren
// 0x0018 (0x0018 - 0x0000)
struct FSReBulletDataChildren final
{
public:
	int64                                         召唤子弹ID_4_2B4C2C064049651D03D9BFA5A7B8ACE1;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         召唤子弹延迟_7_E28516FA498DCF1B4C6860865A2467C6;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         召唤子弹数量_9_B498C6914F30E0787D758BA413B8633F;   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         召唤子弹间隔_12_30777CBB45B8422A5CE591B45D3FCF78;  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBulletChildrenType                           召唤触发_15_62AE08EE4B095C2155C26DA81380E2AD;      // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          失败是否停止_17_CF1A58E845796CA346205A9C4F8334C2;  // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FSReBulletDataChildren;

}

