#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SUiCameraAnimationBlendSettings

#include "Basic.hpp"

#include "EUiCameraAnimationAttributeType_structs.hpp"


namespace SDK
{

// UserDefinedStruct SUiCameraAnimationBlendSettings.SUiCameraAnimationBlendSettings
// 0x00C0 (0x00C0 - 0x0000)
struct FSUiCameraAnimationBlendSettings final
{
public:
	float                                         Time_22_7053BAF248A59E94C38F00A306B63101;          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ULevelSequence>          LevelSequence_25_5D99E095429BB53DF159D793FD0BD747; // 0x0008(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         PlayRate_31_7AC61349415520400D3379A2FF509860;      // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReverse_28_9221334F4855EC4C284F77AB4A7B8A50;      // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCurveFloat>             CommonCurve_19_44F9D203469BE7A60E24ADB686ADA8C7;   // 0x0040(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMap<EUiCameraAnimationAttributeType, TSoftObjectPtr<class UCurveFloat>> CurveMap_18_E91232C14DEC2DBC6A8D0095520D6B42; // 0x0070(0x0050)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FSUiCameraAnimationBlendSettings;

}

