#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsBpFxEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsBpFxEffect.TsBpFxEffect_C
// 0x0020 (0x02D0 - 0x02B0)
class ATsBpFxEffect_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATsBpFxEffect_C*                        RecorderShadow;                                    // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRecorderActor;                                   // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RecordTime;                                        // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TsBpFxEffect(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnRecordTick(float DeltaSeconds);
	void AddAutoFloatTrack(class FName propertyName);
	void OnRecordStart();
	void AddAutoObjectTrack(class FName propertyName);
	void AddAutoVectorTrack(class FName propertyName);
	void OnRecordStop();
	void TryRecord();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TsBpFxEffect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TsBpFxEffect_C")
	}
	static class ATsBpFxEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATsBpFxEffect_C>();
	}
};
DUMPER7_ASSERTS_ATsBpFxEffect_C;

}

