#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsHideActorBlueprintFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function TsHideActorBlueprintFunctionLibrary.TsHideActorBlueprintFunctionLibrary_C.HideMesh
// 0x0008 (0x0008 - 0x0000)
struct TsHideActorBlueprintFunctionLibrary_C_HideMesh final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHideActorBlueprintFunctionLibrary_C_HideMesh;

// Function TsHideActorBlueprintFunctionLibrary.TsHideActorBlueprintFunctionLibrary_C.HideEffect
// 0x0008 (0x0008 - 0x0000)
struct TsHideActorBlueprintFunctionLibrary_C_HideEffect final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHideActorBlueprintFunctionLibrary_C_HideEffect;

// Function TsHideActorBlueprintFunctionLibrary.TsHideActorBlueprintFunctionLibrary_C.ShowMesh
// 0x0008 (0x0008 - 0x0000)
struct TsHideActorBlueprintFunctionLibrary_C_ShowMesh final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHideActorBlueprintFunctionLibrary_C_ShowMesh;

// Function TsHideActorBlueprintFunctionLibrary.TsHideActorBlueprintFunctionLibrary_C.ShowEffect
// 0x0008 (0x0008 - 0x0000)
struct TsHideActorBlueprintFunctionLibrary_C_ShowEffect final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHideActorBlueprintFunctionLibrary_C_ShowEffect;

// Function TsHideActorBlueprintFunctionLibrary.TsHideActorBlueprintFunctionLibrary_C.HideNpcMesh
// 0x0008 (0x0008 - 0x0000)
struct TsHideActorBlueprintFunctionLibrary_C_HideNpcMesh final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHideActorBlueprintFunctionLibrary_C_HideNpcMesh;

// Function TsHideActorBlueprintFunctionLibrary.TsHideActorBlueprintFunctionLibrary_C.HideNpcEffect
// 0x0008 (0x0008 - 0x0000)
struct TsHideActorBlueprintFunctionLibrary_C_HideNpcEffect final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHideActorBlueprintFunctionLibrary_C_HideNpcEffect;

// Function TsHideActorBlueprintFunctionLibrary.TsHideActorBlueprintFunctionLibrary_C.ShowNpcEffect
// 0x0008 (0x0008 - 0x0000)
struct TsHideActorBlueprintFunctionLibrary_C_ShowNpcEffect final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHideActorBlueprintFunctionLibrary_C_ShowNpcEffect;

// Function TsHideActorBlueprintFunctionLibrary.TsHideActorBlueprintFunctionLibrary_C.ShowNpcMesh
// 0x0008 (0x0008 - 0x0000)
struct TsHideActorBlueprintFunctionLibrary_C_ShowNpcMesh final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHideActorBlueprintFunctionLibrary_C_ShowNpcMesh;

// Function TsHideActorBlueprintFunctionLibrary.TsHideActorBlueprintFunctionLibrary_C.SetHideParameter
// 0x0018 (0x0018 - 0x0000)
struct TsHideActorBlueprintFunctionLibrary_C_SetHideParameter final
{
public:
	float                                         distance;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   boneName;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHideActorBlueprintFunctionLibrary_C_SetHideParameter;

// Function TsHideActorBlueprintFunctionLibrary.TsHideActorBlueprintFunctionLibrary_C.ResetHideParameter
// 0x0008 (0x0008 - 0x0000)
struct TsHideActorBlueprintFunctionLibrary_C_ResetHideParameter final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHideActorBlueprintFunctionLibrary_C_ResetHideParameter;

}

