#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsHotFixActionHandle

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.OnPressAction
// 0x0020 (0x0020 - 0x0000)
struct TsHotFixActionHandle_C_OnPressAction final
{
public:
	struct FKey                                   key;                                               // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_OnPressAction;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.OnReleaseAction
// 0x0020 (0x0020 - 0x0000)
struct TsHotFixActionHandle_C_OnReleaseAction final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_OnReleaseAction;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.AddPressBinding
// 0x0028 (0x0028 - 0x0000)
struct TsHotFixActionHandle_C_AddPressBinding final
{
public:
	class FString                                 actionName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class ABasePlayerController*                  controller;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_AddPressBinding;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.AddReleaseBinding
// 0x0028 (0x0028 - 0x0000)
struct TsHotFixActionHandle_C_AddReleaseBinding final
{
public:
	class FString                                 actionName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class ABasePlayerController*                  controller;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_AddReleaseBinding;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.AddTouchPressBinding
// 0x0008 (0x0008 - 0x0000)
struct TsHotFixActionHandle_C_AddTouchPressBinding final
{
public:
	class ABasePlayerController*                  controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_AddTouchPressBinding;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.AddTouchReleaseBinding
// 0x0008 (0x0008 - 0x0000)
struct TsHotFixActionHandle_C_AddTouchReleaseBinding final
{
public:
	class ABasePlayerController*                  controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_AddTouchReleaseBinding;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.OnTouchPressAction
// 0x0010 (0x0010 - 0x0000)
struct TsHotFixActionHandle_C_OnTouchPressAction final
{
public:
	ETouchIndex                                   touchIndex;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                position;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_OnTouchPressAction;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.OnTouchReleaseAction
// 0x0010 (0x0010 - 0x0000)
struct TsHotFixActionHandle_C_OnTouchReleaseAction final
{
public:
	ETouchIndex                                   touchIndex;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                position;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_OnTouchReleaseAction;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.ClearActionBinding
// 0x0008 (0x0008 - 0x0000)
struct TsHotFixActionHandle_C_ClearActionBinding final
{
public:
	class ABasePlayerController*                  controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_ClearActionBinding;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.OnTouchMoveAction
// 0x0010 (0x0010 - 0x0000)
struct TsHotFixActionHandle_C_OnTouchMoveAction final
{
public:
	ETouchIndex                                   touchindex;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                position;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_OnTouchMoveAction;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.AddTouchMoveBinding
// 0x0008 (0x0008 - 0x0000)
struct TsHotFixActionHandle_C_AddTouchMoveBinding final
{
public:
	class ABasePlayerController*                  controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_AddTouchMoveBinding;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.AddAxisBinding
// 0x0028 (0x0028 - 0x0000)
struct TsHotFixActionHandle_C_AddAxisBinding final
{
public:
	class FString                                 axisName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class ABasePlayerController*                  controller;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_AddAxisBinding;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.OnAxisInput
// 0x0004 (0x0004 - 0x0000)
struct TsHotFixActionHandle_C_OnAxisInput final
{
public:
	float                                         value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_OnAxisInput;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.ClearAxisBinding
// 0x0008 (0x0008 - 0x0000)
struct TsHotFixActionHandle_C_ClearAxisBinding final
{
public:
	class ABasePlayerController*                  controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_ClearAxisBinding;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.AddAnyKeyPress
// 0x0040 (0x0040 - 0x0000)
struct TsHotFixActionHandle_C_AddAnyKeyPress final
{
public:
	class ABasePlayerController*                  controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            chord;                                             // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FName                                   AnyKeyPressAction;                                 // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_AddAnyKeyPress;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.ClearKeyBinding
// 0x0008 (0x0008 - 0x0000)
struct TsHotFixActionHandle_C_ClearKeyBinding final
{
public:
	class ABasePlayerController*                  controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_ClearKeyBinding;

// Function TsHotFixActionHandle.TsHotFixActionHandle_C.OnAnyKeyPressAction
// 0x0020 (0x0020 - 0x0000)
struct TsHotFixActionHandle_C_OnAnyKeyPressAction final
{
public:
	struct FKey                                   key;                                               // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsHotFixActionHandle_C_OnAnyKeyPressAction;

}

