#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsUiNavigationBehaviorListener

#include "Basic.hpp"


namespace SDK::Params
{

// Function TsUiNavigationBehaviorListener.TsUiNavigationBehaviorListener_C.ExecuteUbergraph_TsUiNavigationBehaviorListener
// 0x0018 (0x0018 - 0x0000)
struct TsUiNavigationBehaviorListener_C_ExecuteUbergraph_TsUiNavigationBehaviorListener final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULGUIPointerEventData*                  K2Node_Event_eventData_1;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGUIPointerEventData*                  K2Node_Event_eventData;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsUiNavigationBehaviorListener_C_ExecuteUbergraph_TsUiNavigationBehaviorListener;

// Function TsUiNavigationBehaviorListener.TsUiNavigationBehaviorListener_C.OnNotifyNavigationSelectBP
// 0x0008 (0x0008 - 0x0000)
struct TsUiNavigationBehaviorListener_C_OnNotifyNavigationSelectBP final
{
public:
	class ULGUIPointerEventData*                  eventData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsUiNavigationBehaviorListener_C_OnNotifyNavigationSelectBP;

// Function TsUiNavigationBehaviorListener.TsUiNavigationBehaviorListener_C.OnNotifyNavigationEnterBP
// 0x0008 (0x0008 - 0x0000)
struct TsUiNavigationBehaviorListener_C_OnNotifyNavigationEnterBP final
{
public:
	class ULGUIPointerEventData*                  eventData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsUiNavigationBehaviorListener_C_OnNotifyNavigationEnterBP;

// Function TsUiNavigationBehaviorListener.TsUiNavigationBehaviorListener_C.OnCheckCanSetNavigationBP
// 0x0001 (0x0001 - 0x0000)
struct TsUiNavigationBehaviorListener_C_OnCheckCanSetNavigationBP final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsUiNavigationBehaviorListener_C_OnCheckCanSetNavigationBP;

// Function TsUiNavigationBehaviorListener.TsUiNavigationBehaviorListener_C.OnCheckLoopScrollChangeNavigationBP
// 0x0001 (0x0001 - 0x0000)
struct TsUiNavigationBehaviorListener_C_OnCheckLoopScrollChangeNavigationBP final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsUiNavigationBehaviorListener_C_OnCheckLoopScrollChangeNavigationBP;

}

