#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WwiseFileHandler

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "WwiseFileHandler_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class WwiseFileHandler.WwiseExternalSourceStatics
// 0x0000 (0x0030 - 0x0030)
class UWwiseExternalSourceStatics final : public UBlueprintFunctionLibrary
{
public:
	static void InitExternalSourceConfigs();
	static void SetExternalSourceMediaById(const class FString& ExternalSourceName, const int32 MediaId);
	static void SetExternalSourceMediaByName(const class FString& ExternalSourceName, const class FString& MediaName);
	static void SetExternalSourceMediaWithIds(const struct FAkUniqueID& ExternalSourceCookie, const int32 MediaId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwiseExternalSourceStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwiseExternalSourceStatics")
	}
	static class UWwiseExternalSourceStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseExternalSourceStatics>();
	}
};
DUMPER7_ASSERTS_UWwiseExternalSourceStatics;

// Class WwiseFileHandler.WwiseFileHandlerSettings
// 0x0018 (0x0048 - 0x0030)
class UWwiseFileHandlerSettings final : public UObject
{
public:
	bool                                          bUseSharedOpQueue;                                 // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIOInSharedOpQueue;                                // 0x0031(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	EKuroWwiseTaskPriority                        FileCacheOpenQueuePriority;                        // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroWwiseTaskPriority                        FileCacheDeleteQueuePriority;                      // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroWwiseTaskPriority                        FileHandlerOpQueuePriority;                        // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroWwiseTaskPriority                        IOHookBatchOpQueuePriority;                        // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseMediaExtDecrement;                             // 0x0044(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSoundBankDeleteCheck;                             // 0x0045(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwiseFileHandlerSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwiseFileHandlerSettings")
	}
	static class UWwiseFileHandlerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseFileHandlerSettings>();
	}
};
DUMPER7_ASSERTS_UWwiseFileHandlerSettings;

}

