#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_R2T1PlayerFemaleMd10011_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_R2T1PlayerFemaleMd10011_PC.ABP_R2T1PlayerFemaleMd10011_PC_C.ExecuteUbergraph_ABP_R2T1PlayerFemaleMd10011_PC
// 0x0008 (0x0008 - 0x0000)
struct ABP_R2T1PlayerFemaleMd10011_PC_C_ExecuteUbergraph_ABP_R2T1PlayerFemaleMd10011_PC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_R2T1PlayerFemaleMd10011_PC_C_ExecuteUbergraph_ABP_R2T1PlayerFemaleMd10011_PC;

// Function ABP_R2T1PlayerFemaleMd10011_PC.ABP_R2T1PlayerFemaleMd10011_PC_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_R2T1PlayerFemaleMd10011_PC_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_R2T1PlayerFemaleMd10011_PC_C_BlueprintUpdateAnimation;

// Function ABP_R2T1PlayerFemaleMd10011_PC.ABP_R2T1PlayerFemaleMd10011_PC_C.UpdatePhysicsClothSimulateEnable
// 0x0008 (0x0008 - 0x0000)
struct ABP_R2T1PlayerFemaleMd10011_PC_C_UpdatePhysicsClothSimulateEnable final
{
public:
	float                                         DeltaTIme;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdatePhysicsClothSimulateEnable_DstSimulateEnable; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ABP_R2T1PlayerFemaleMd10011_PC_C_UpdatePhysicsClothSimulateEnable;

// Function ABP_R2T1PlayerFemaleMd10011_PC.ABP_R2T1PlayerFemaleMd10011_PC_C.BindGameplayVariable
// 0x0020 (0x0020 - 0x0000)
struct ABP_R2T1PlayerFemaleMd10011_PC_C_BindGameplayVariable final
{
public:
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ABP_R2T1PlayerFemaleMd10011_PC_C_BindGameplayVariable;

// Function ABP_R2T1PlayerFemaleMd10011_PC.ABP_R2T1PlayerFemaleMd10011_PC_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_R2T1PlayerFemaleMd10011_PC_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_R2T1PlayerFemaleMd10011_PC_C_AnimGraph;

// Function ABP_R2T1PlayerFemaleMd10011_PC.ABP_R2T1PlayerFemaleMd10011_PC_C.PhyCloth
// 0x0020 (0x0020 - 0x0000)
struct ABP_R2T1PlayerFemaleMd10011_PC_C_PhyCloth final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PhyCloth_0;                                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_R2T1PlayerFemaleMd10011_PC_C_PhyCloth;

}

