#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_EMotorcycleTrailMd10011

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_EMotorcycleTrailMd10011.ABP_EMotorcycleTrailMd10011_C
// 0x0460 (0x0B90 - 0x0730)
class UABP_EMotorcycleTrailMd10011_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0730(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0738(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0770(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0790(0x0020)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup;                  // 0x07B0(0x02A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0A50(0x0138)()

public:
	void ExecuteUbergraph_ABP_EMotorcycleTrailMd10011(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_EMotorcycleTrailMd10011_C">();
	}
	static class UABP_EMotorcycleTrailMd10011_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_EMotorcycleTrailMd10011_C>();
	}
};
static_assert(alignof(UABP_EMotorcycleTrailMd10011_C) == 0x000010, "Wrong alignment on UABP_EMotorcycleTrailMd10011_C");
static_assert(sizeof(UABP_EMotorcycleTrailMd10011_C) == 0x000B90, "Wrong size on UABP_EMotorcycleTrailMd10011_C");
static_assert(offsetof(UABP_EMotorcycleTrailMd10011_C, UberGraphFrame) == 0x000730, "Member 'UABP_EMotorcycleTrailMd10011_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_EMotorcycleTrailMd10011_C, AnimGraphNode_Root) == 0x000738, "Member 'UABP_EMotorcycleTrailMd10011_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_EMotorcycleTrailMd10011_C, AnimGraphNode_LocalToComponentSpace) == 0x000770, "Member 'UABP_EMotorcycleTrailMd10011_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_EMotorcycleTrailMd10011_C, AnimGraphNode_ComponentToLocalSpace) == 0x000790, "Member 'UABP_EMotorcycleTrailMd10011_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_EMotorcycleTrailMd10011_C, AnimGraphNode_KawaiiPhysicsGroup) == 0x0007B0, "Member 'UABP_EMotorcycleTrailMd10011_C::AnimGraphNode_KawaiiPhysicsGroup' has a wrong offset!");
static_assert(offsetof(UABP_EMotorcycleTrailMd10011_C, AnimGraphNode_LinkedInputPose) == 0x000A50, "Member 'UABP_EMotorcycleTrailMd10011_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

