#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BaseRole

#include "Basic.hpp"

#include "KuroAnim_structs.hpp"
#include "KuroAnim_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BaseRole.ABP_BaseRole_C
// 0x228F0 (0x23480 - 0x0B90)
class UABP_BaseRole_C final : public UKuroAnimInstanceRole
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x0B98(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_538;                // 0x0BD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_537;                // 0x0BF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_536;                // 0x0C20(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_26;                    // 0x0C48(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0x0D20(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0x0D50(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_289;                     // 0x0D80(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0x0DB8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_288;                     // 0x0DE8(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_287;                     // 0x0E20(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_57;                     // 0x0E58(0x0148)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0x0FA0(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_27;                  // 0x1150(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_26;                  // 0x1288(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0x13C0(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_25;                  // 0x1570(0x0138)()
	uint8                                         Pad_16A8[0x8];                                     // 0x16A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0x16B0(0x01B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x1860(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x1898(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x18B8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_24;                  // 0x18D8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1A10(0x0128)()
	struct FAnimNode_SightLock                    AnimGraphNode_SightLock;                           // 0x1B38(0x01D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0x1D08(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0x1D38(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x1D68(0x00B0)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_16;                    // 0x1E18(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0x1E68(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_535;                // 0x1E98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_534;                // 0x1EC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_533;                // 0x1EE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_532;                // 0x1F10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_531;                // 0x1F38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_530;                // 0x1F60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_529;                // 0x1F88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_528;                // 0x1FB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_527;                // 0x1FD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_526;                // 0x2000(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_525;                // 0x2028(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_524;                // 0x2050(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_523;                // 0x2078(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_522;                // 0x20A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_521;                // 0x20C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_520;                // 0x20F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_519;                // 0x2118(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_518;                // 0x2140(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0x2168(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0x2198(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_15;                    // 0x21C8(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_286;                     // 0x2218(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0x2250(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_14;                    // 0x2280(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0x22D0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_285;                     // 0x2300(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0x2338(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x2368(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_13;                    // 0x2398(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_284;                     // 0x23E8(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x2420(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x2450(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_12;                    // 0x2480(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_283;                     // 0x24D0(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0x2508(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_11;                    // 0x2538(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x2588(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_282;                     // 0x25B8(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0x25F0(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_10;                    // 0x2620(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0x2670(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_281;                     // 0x26A0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_56;                     // 0x26D8(0x0148)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0x2820(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0x2850(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0x2A00(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0x2BB0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0x2D60(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_23;                  // 0x2F10(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_22;                  // 0x3048(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_21;                  // 0x3180(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_20;                  // 0x32B8(0x0138)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0x33F0(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0x3420(0x01B0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_9;                       // 0x35D0(0x00C8)()
	uint8                                         Pad_3698[0x8];                                     // 0x3698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0x36A0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0x3850(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x3A00(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_19;                  // 0x3BB0(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x3CE8(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x3E20(0x0138)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x3F58(0x0038)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot_1;                      // 0x3F90(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x4040(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x40F0(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x4150(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x41B0(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x4210(0x0060)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x4270(0x0138)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x43A8(0x0038)()
	struct FAnimNode_SimpleDCC                    AnimGraphNode_SimpleDCC;                           // 0x43E0(0x0180)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x4560(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x4688(0x0128)()
	struct FAnimNode_FeedbackRotate               AnimGraphNode_FeedbackRotate;                      // 0x47B0(0x0320)()
	struct FAnimNode_KuroHumanIK                  AnimGraphNode_KuroHumanIK;                         // 0x4AD0(0x0250)()
	struct FAnimNode_KuroCacheBones               AnimGraphNode_KuroCacheBones;                      // 0x4D20(0x0150)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x4E70(0x0020)()
	struct FAnimNode_MorphTargetModifier          AnimGraphNode_MorphTargetModifier;                 // 0x4E90(0x0060)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x4EF0(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x4F28(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x5060(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x5210(0x0138)()
	uint8                                         Pad_5348[0x8];                                     // 0x5348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x5350(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x5500(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x5638(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x5770(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x58A8(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x59E0(0x0138)()
	uint8                                         Pad_5B18[0x8];                                     // 0x5B18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x5B20(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x5CD0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x5E80(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x6030(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x61E0(0x01B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0x6390(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0x63C0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x63F0(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_8;                       // 0x6420(0x00C8)()
	uint8                                         Pad_64E8[0x8];                                     // 0x64E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x64F0(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_517;                // 0x66A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_516;                // 0x66C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_515;                // 0x66F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_514;                // 0x6718(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_513;                // 0x6740(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_512;                // 0x6768(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_511;                // 0x6790(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_510;                // 0x67B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_509;                // 0x67E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_508;                // 0x6808(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_507;                // 0x6830(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_506;                // 0x6858(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_505;                // 0x6880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_504;                // 0x68A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_503;                // 0x68D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_502;                // 0x68F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_501;                // 0x6920(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_500;                // 0x6948(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_499;                // 0x6970(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_498;                // 0x6998(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_497;                // 0x69C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_496;                // 0x69E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_495;                // 0x6A10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_494;                // 0x6A38(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x6A60(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_9;                     // 0x6A90(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x6AE0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x6B10(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x6B40(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_280;                     // 0x6B70(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x6BA8(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_8;                     // 0x6BD8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x6C28(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x6C58(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x6C88(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_279;                     // 0x6CB8(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x6CF0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x6D20(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_7;                     // 0x6D50(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x6DA0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x6DD0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_278;                     // 0x6E00(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x6E38(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x6E68(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_6;                     // 0x6E98(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x6EE8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x6F18(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_277;                     // 0x6F48(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x6F80(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x6FB0(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_5;                     // 0x6FE0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x7030(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x7060(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_276;                     // 0x7090(0x0038)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_4;                     // 0x70C8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x7118(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x7148(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x7178(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x71A8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_275;                     // 0x71D8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_55;                     // 0x7210(0x0148)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x7358(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_25;                    // 0x7408(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_193;                  // 0x74E0(0x0090)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x7570(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x75A8(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x76E0(0x0138)()
	uint8                                         Pad_7818[0x8];                                     // 0x7818(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x7820(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x79D0(0x01B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x7B80(0x0060)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_493;                // 0x7BE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_492;                // 0x7C08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_491;                // 0x7C30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_490;                // 0x7C58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_489;                // 0x7C80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_488;                // 0x7CA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_487;                // 0x7CD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_486;                // 0x7CF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_485;                // 0x7D20(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x7D48(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_274;                     // 0x7D78(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_484;                // 0x7DB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x7DD8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_273;                     // 0x7E08(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x7E40(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x7E70(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x7EA0(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_8;                   // 0x7ED0(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_272;                     // 0x7F90(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_54;                     // 0x7FC8(0x0148)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_192;                  // 0x8110(0x0090)()
	struct FAnimNode_CombineCurves                AnimGraphNode_CombineCurves;                       // 0x81A0(0x0060)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x8200(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x83B0(0x0138)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x84E8(0x0070)()
	uint8                                         Pad_8558[0x8];                                     // 0x8558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RBF                          AnimGraphNode_RBF;                                 // 0x8560(0x0150)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x86B0(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x86E8(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x8820(0x0138)()
	uint8                                         Pad_8958[0x8];                                     // 0x8958(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x8960(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x8B10(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x8CC0(0x0138)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x8DF8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x8E28(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x8E58(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x8F90(0x01B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x9140(0x0030)()
	struct FAnimNode_AdditiveBoneBlend            AnimGraphNode_AdditiveBoneBlend;                   // 0x9170(0x01B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x9328(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_191;                  // 0x9360(0x0090)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x93F0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_483;                // 0x9428(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_482;                // 0x9450(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_481;                // 0x9478(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_480;                // 0x94A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_479;                // 0x94C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_478;                // 0x94F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_477;                // 0x9518(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_476;                // 0x9540(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_475;                // 0x9568(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_474;                // 0x9590(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_473;                // 0x95B8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_190;                  // 0x95E0(0x0090)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_36;                 // 0x9670(0x00F8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_24;                    // 0x9768(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_271;                     // 0x9840(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x9878(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_270;                     // 0x98A8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_472;                // 0x98E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_471;                // 0x9908(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_470;                // 0x9930(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_469;                // 0x9958(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_189;                  // 0x9980(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_269;                     // 0x9A10(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_188;                  // 0x9A48(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_268;                     // 0x9AD8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_187;                  // 0x9B10(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_267;                     // 0x9BA0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_186;                  // 0x9BD8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_266;                     // 0x9C68(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_53;                     // 0x9CA0(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_265;                     // 0x9DE8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_468;                // 0x9E20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_467;                // 0x9E48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_466;                // 0x9E70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_465;                // 0x9E98(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x9EC0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_185;                  // 0x9EF0(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_23;                    // 0x9F80(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_264;                     // 0xA058(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0xA090(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_184;                  // 0xA0C0(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_22;                    // 0xA150(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_263;                     // 0xA228(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0xA260(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0xA290(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_183;                  // 0xA2C0(0x0090)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_7;                       // 0xA350(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_21;                    // 0xA418(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_262;                     // 0xA4F0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_52;                     // 0xA528(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_261;                     // 0xA670(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_464;                // 0xA6A8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_182;                  // 0xA6D0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_260;                     // 0xA760(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_51;                     // 0xA798(0x0148)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0xA8E0(0x0060)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_35;                 // 0xA940(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_259;                     // 0xAA38(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_50;                     // 0xAA70(0x0148)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0xABB8(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0xACF0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0xAEA0(0x01B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0xB050(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_463;                // 0xB088(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_462;                // 0xB0B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_461;                // 0xB0D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_460;                // 0xB100(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_459;                // 0xB128(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_458;                // 0xB150(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_457;                // 0xB178(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_456;                // 0xB1A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_455;                // 0xB1C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_454;                // 0xB1F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_453;                // 0xB218(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_452;                // 0xB240(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_451;                // 0xB268(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_450;                // 0xB290(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_449;                // 0xB2B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_448;                // 0xB2E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_447;                // 0xB308(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_446;                // 0xB330(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_445;                // 0xB358(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_444;                // 0xB380(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_443;                // 0xB3A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_442;                // 0xB3D0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_258;                     // 0xB3F8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_181;                  // 0xB430(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_257;                     // 0xB4C0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_180;                  // 0xB4F8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_256;                     // 0xB588(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_49;                     // 0xB5C0(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_255;                     // 0xB708(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_254;                     // 0xB740(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_441;                // 0xB778(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_440;                // 0xB7A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_439;                // 0xB7C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_438;                // 0xB7F0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_253;                     // 0xB818(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_179;                  // 0xB850(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_252;                     // 0xB8E0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_178;                  // 0xB918(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_251;                     // 0xB9A8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_177;                  // 0xB9E0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_250;                     // 0xBA70(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_176;                  // 0xBAA8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_249;                     // 0xBB38(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_48;                     // 0xBB70(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_248;                     // 0xBCB8(0x0038)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_34;                 // 0xBCF0(0x00F8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_20;                    // 0xBDE8(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_175;                  // 0xBEC0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_247;                     // 0xBF50(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_437;                // 0xBF88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_436;                // 0xBFB0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_246;                     // 0xBFD8(0x0038)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_6;                       // 0xC010(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_174;                  // 0xC0D8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_173;                  // 0xC168(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_245;                     // 0xC1F8(0x0038)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_5;                       // 0xC230(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_172;                  // 0xC2F8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_171;                  // 0xC388(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_244;                     // 0xC418(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_47;                     // 0xC450(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_243;                     // 0xC598(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_46;                     // 0xC5D0(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_242;                     // 0xC718(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_435;                // 0xC750(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_170;                  // 0xC778(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_241;                     // 0xC808(0x0038)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0xC840(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0xC968(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xC988(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_19;                    // 0xC9A8(0x00D8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_434;                // 0xCA80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_433;                // 0xCAA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_432;                // 0xCAD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_431;                // 0xCAF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_430;                // 0xCB20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_429;                // 0xCB48(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_169;                  // 0xCB70(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_168;                  // 0xCC00(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_167;                  // 0xCC90(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_166;                  // 0xCD20(0x0090)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_3;                     // 0xCDB0(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_240;                     // 0xCE00(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_239;                     // 0xCE38(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_165;                  // 0xCE70(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_164;                  // 0xCF00(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_163;                  // 0xCF90(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_162;                  // 0xD020(0x0090)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_2;                     // 0xD0B0(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_238;                     // 0xD100(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_45;                     // 0xD138(0x0148)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_161;                  // 0xD280(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_237;                     // 0xD310(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_44;                     // 0xD348(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_236;                     // 0xD490(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_428;                // 0xD4C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_427;                // 0xD4F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_426;                // 0xD518(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_235;                     // 0xD540(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_160;                  // 0xD578(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_234;                     // 0xD608(0x0038)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_33;                 // 0xD640(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_233;                     // 0xD738(0x0038)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_32;                 // 0xD770(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_232;                     // 0xD868(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_43;                     // 0xD8A0(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_231;                     // 0xD9E8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_425;                // 0xDA20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_424;                // 0xDA48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_423;                // 0xDA70(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_159;                  // 0xDA98(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_230;                     // 0xDB28(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_422;                // 0xDB60(0x0028)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_3;               // 0xDB88(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_229;                     // 0xDC88(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_158;                  // 0xDCC0(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_18;                    // 0xDD50(0x00D8)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_2;               // 0xDE28(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_228;                     // 0xDF28(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_42;                     // 0xDF60(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_227;                     // 0xE0A8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_421;                // 0xE0E0(0x0028)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_1;               // 0xE108(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_226;                     // 0xE208(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_157;                  // 0xE240(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_17;                    // 0xE2D0(0x00D8)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator;                 // 0xE3A8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_225;                     // 0xE4A8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_41;                     // 0xE4E0(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_224;                     // 0xE628(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_40;                     // 0xE660(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_223;                     // 0xE7A8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_420;                // 0xE7E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_419;                // 0xE808(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_418;                // 0xE830(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_417;                // 0xE858(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_416;                // 0xE880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_415;                // 0xE8A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_414;                // 0xE8D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_413;                // 0xE8F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_412;                // 0xE920(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_411;                // 0xE948(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_410;                // 0xE970(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_156;                  // 0xE998(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_16;                    // 0xEA28(0x00D8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_31;                 // 0xEB00(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_222;                     // 0xEBF8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_409;                // 0xEC30(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_155;                  // 0xEC58(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_221;                     // 0xECE8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_408;                // 0xED20(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_30;                 // 0xED48(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_220;                     // 0xEE40(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_219;                     // 0xEE78(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_154;                  // 0xEEB0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_218;                     // 0xEF40(0x0038)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_29;                 // 0xEF78(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_217;                     // 0xF070(0x0038)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_28;                 // 0xF0A8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_216;                     // 0xF1A0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_39;                     // 0xF1D8(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_215;                     // 0xF320(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0xF358(0x0060)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_153;                  // 0xF3B8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_214;                     // 0xF448(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_407;                // 0xF480(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_406;                // 0xF4A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_405;                // 0xF4D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_404;                // 0xF4F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_403;                // 0xF520(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_402;                // 0xF548(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_401;                // 0xF570(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_400;                // 0xF598(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_399;                // 0xF5C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_398;                // 0xF5E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_397;                // 0xF610(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_396;                // 0xF638(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_395;                // 0xF660(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_394;                // 0xF688(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_393;                // 0xF6B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_392;                // 0xF6D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_391;                // 0xF700(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_390;                // 0xF728(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_389;                // 0xF750(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_388;                // 0xF778(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_387;                // 0xF7A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_386;                // 0xF7C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_385;                // 0xF7F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_384;                // 0xF818(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_383;                // 0xF840(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_382;                // 0xF868(0x0028)()
