#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Performance_PlayerMale_PC

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "KuroAnim_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Performance_PlayerMale_PC.ABP_Performance_PlayerMale_PC_C
// 0x1500 (0x1C30 - 0x0730)
class UABP_Performance_PlayerMale_PC_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0730(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0738(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0770(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0790(0x0020)()
	struct FAnimNode_MountBuffer                  AnimGraphNode_MountBuffer;                         // 0x07B0(0x01E0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_5;                // 0x0990(0x02A0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_4;                // 0x0C30(0x02A0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_3;                // 0x0ED0(0x02A0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_2;                // 0x1170(0x02A0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_1;                // 0x1410(0x02A0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup;                  // 0x16B0(0x02A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1950(0x0138)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1A88(0x0038)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x1AC0(0x00C0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1B80(0x00A8)()

public:
	void ExecuteUbergraph_ABP_Performance_PlayerMale_PC(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void PhyCloth(const struct FPoseLink& InPose, struct FPoseLink* PhyCloth_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Performance_PlayerMale_PC_C">();
	}
	static class UABP_Performance_PlayerMale_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Performance_PlayerMale_PC_C>();
	}
};
static_assert(alignof(UABP_Performance_PlayerMale_PC_C) == 0x000010, "Wrong alignment on UABP_Performance_PlayerMale_PC_C");
static_assert(sizeof(UABP_Performance_PlayerMale_PC_C) == 0x001C30, "Wrong size on UABP_Performance_PlayerMale_PC_C");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, UberGraphFrame) == 0x000730, "Member 'UABP_Performance_PlayerMale_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_Root_1) == 0x000738, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_LocalToComponentSpace) == 0x000770, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_ComponentToLocalSpace) == 0x000790, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_MountBuffer) == 0x0007B0, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_MountBuffer' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_KawaiiPhysicsGroup_5) == 0x000990, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_KawaiiPhysicsGroup_5' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_KawaiiPhysicsGroup_4) == 0x000C30, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_KawaiiPhysicsGroup_4' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_KawaiiPhysicsGroup_3) == 0x000ED0, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_KawaiiPhysicsGroup_3' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_KawaiiPhysicsGroup_2) == 0x001170, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_KawaiiPhysicsGroup_2' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_KawaiiPhysicsGroup_1) == 0x001410, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_KawaiiPhysicsGroup_1' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_KawaiiPhysicsGroup) == 0x0016B0, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_KawaiiPhysicsGroup' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_LinkedInputPose) == 0x001950, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_Root) == 0x001A88, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_LinkedAnimLayer) == 0x001AC0, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Performance_PlayerMale_PC_C, AnimGraphNode_LinkedAnimGraph) == 0x001B80, "Member 'UABP_Performance_PlayerMale_PC_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");

}

