#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_LevelPrefabDaiyu

#include "Basic.hpp"

#include "KuroAnim_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_LevelPrefabDaiyu.ABP_LevelPrefabDaiyu_C
// 0x0780 (0x0FA0 - 0x0820)
class UABP_LevelPrefabDaiyu_C final : public UKuroAnimInstance
{
public:
	uint8                                         Pad_818[0x8];                                      // 0x0818(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0820(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0828(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0860(0x0060)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x08C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x08E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0910(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0938(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0988(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x09B0(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0A88(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0AC0(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0B98(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0BD0(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0CA8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0CE0(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0DB8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0DF0(0x0198)()
	class FString                                 State;                                             // 0x0F88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         PlayRate;                                          // 0x0F98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_LevelPrefabDaiyu(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LevelPrefabDaiyu_AnimGraphNode_TransitionResult_832F124B46C8009E74F026B6FAD140F0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LevelPrefabDaiyu_AnimGraphNode_TransitionResult_99E1DEEE4C2AD6699AF315B499EA11F8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LevelPrefabDaiyu_AnimGraphNode_TransitionResult_E4AA41CD46142E3F7C526C961E2827E4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LevelPrefabDaiyu_AnimGraphNode_TransitionResult_43BF012E42F76C96BA1F58A3BBF963C0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LevelPrefabDaiyu_AnimGraphNode_TransitionResult_0C09A7CC478518A81FF643A82589842B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LevelPrefabDaiyu_AnimGraphNode_TransitionResult_27735FDA4D4138537AC82A984F1FAD3D();
	void SetState(const class FString& NewParam);
	void SetPlayRate(float playRate);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_LevelPrefabDaiyu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_LevelPrefabDaiyu_C")
	}
	static class UABP_LevelPrefabDaiyu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_LevelPrefabDaiyu_C>();
	}
};
DUMPER7_ASSERTS_UABP_LevelPrefabDaiyu_C;

}

