#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_R2T1PlayerFemaleMd10011_PC

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "KuroAnim_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_R2T1PlayerFemaleMd10011_PC.ABP_R2T1PlayerFemaleMd10011_PC_C
// 0x1E40 (0x2570 - 0x0730)
class UABP_R2T1PlayerFemaleMd10011_PC_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0730(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0738(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0770(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x08A8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x08C8(0x0020)()
	uint8                                         Pad_8E8[0x8];                                      // 0x08E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_MountBuffer                  AnimGraphNode_MountBuffer;                         // 0x08F0(0x01E0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_8;                // 0x0AD0(0x02A0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_7;                // 0x0D70(0x02A0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_6;                // 0x1010(0x02A0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_5;                // 0x12B0(0x02A0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_4;                // 0x1550(0x02A0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_3;                // 0x17F0(0x02A0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_2;                // 0x1A90(0x02A0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_1;                // 0x1D30(0x02A0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup;                  // 0x1FD0(0x02A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2270(0x0038)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_2;                   // 0x22A8(0x00A8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x2350(0x00C0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x2410(0x00A8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x24B8(0x00A8)()
	bool                                          PhysicsClothSimulateEnable;                        // 0x2560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2561[0x3];                                     // 0x2561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PhysicsClothSimulateScale;                         // 0x2564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGameplayABPEnable;                                // 0x2568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_R2T1PlayerFemaleMd10011_PC(int32 EntryPoint);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void UpdatePhysicsClothSimulateEnable(float DeltaTIme);
	void BindGameplayVariable();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void PhyCloth(const struct FPoseLink& InPose, struct FPoseLink* PhyCloth_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_R2T1PlayerFemaleMd10011_PC_C">();
	}
	static class UABP_R2T1PlayerFemaleMd10011_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_R2T1PlayerFemaleMd10011_PC_C>();
	}
};
static_assert(alignof(UABP_R2T1PlayerFemaleMd10011_PC_C) == 0x000010, "Wrong alignment on UABP_R2T1PlayerFemaleMd10011_PC_C");
static_assert(sizeof(UABP_R2T1PlayerFemaleMd10011_PC_C) == 0x002570, "Wrong size on UABP_R2T1PlayerFemaleMd10011_PC_C");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, UberGraphFrame) == 0x000730, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_Root_1) == 0x000738, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_LinkedInputPose) == 0x000770, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_LocalToComponentSpace) == 0x0008A8, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_ComponentToLocalSpace) == 0x0008C8, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_MountBuffer) == 0x0008F0, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_MountBuffer' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_8) == 0x000AD0, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_8' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_7) == 0x000D70, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_7' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_6) == 0x001010, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_6' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_5) == 0x0012B0, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_5' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_4) == 0x001550, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_4' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_3) == 0x0017F0, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_3' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_2) == 0x001A90, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_2' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_1) == 0x001D30, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_1' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup) == 0x001FD0, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_Root) == 0x002270, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_LinkedAnimGraph_2) == 0x0022A8, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_LinkedAnimGraph_2' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_LinkedAnimLayer) == 0x002350, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_LinkedAnimGraph_1) == 0x002410, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, AnimGraphNode_LinkedAnimGraph) == 0x0024B8, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, PhysicsClothSimulateEnable) == 0x002560, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::PhysicsClothSimulateEnable' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, PhysicsClothSimulateScale) == 0x002564, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::PhysicsClothSimulateScale' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerFemaleMd10011_PC_C, bGameplayABPEnable) == 0x002568, "Member 'UABP_R2T1PlayerFemaleMd10011_PC_C::bGameplayABPEnable' has a wrong offset!");

}

