#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SeqCustom

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_SeqCustom.ABP_SeqCustom_C.ExecuteUbergraph_ABP_SeqCustom
// 0x0080 (0x0080 - 0x0000)
struct ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISeqAnimDataInterface> K2Node_DynamicCast_AsSeq_Anim_Data_Interface;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FTransform>          CallFunc_GetAnimDataTransform_FloatCurveData;      // 0x0028(0x0050)()
	bool                                          CallFunc_GetAnimDataTransform_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom) == 0x000008, "Wrong alignment on ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom");
static_assert(sizeof(ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom) == 0x000080, "Wrong size on ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom");
static_assert(offsetof(ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom, EntryPoint) == 0x000000, "Member 'ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom, K2Node_DynamicCast_AsSeq_Anim_Data_Interface) == 0x000010, "Member 'ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom::K2Node_DynamicCast_AsSeq_Anim_Data_Interface' has a wrong offset!");
static_assert(offsetof(ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom, CallFunc_GetAnimDataTransform_FloatCurveData) == 0x000028, "Member 'ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom::CallFunc_GetAnimDataTransform_FloatCurveData' has a wrong offset!");
static_assert(offsetof(ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom, CallFunc_GetAnimDataTransform_ReturnValue) == 0x000078, "Member 'ABP_SeqCustom_C_ExecuteUbergraph_ABP_SeqCustom::CallFunc_GetAnimDataTransform_ReturnValue' has a wrong offset!");

// Function ABP_SeqCustom.ABP_SeqCustom_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_SeqCustom_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_SeqCustom_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_SeqCustom_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_SeqCustom_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_SeqCustom_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_SeqCustom_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_SeqCustom_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_SeqCustom.ABP_SeqCustom_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_SeqCustom_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_SeqCustom_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_SeqCustom_C_AnimGraph");
static_assert(sizeof(ABP_SeqCustom_C_AnimGraph) == 0x000020, "Wrong size on ABP_SeqCustom_C_AnimGraph");
static_assert(offsetof(ABP_SeqCustom_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_SeqCustom_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_SeqCustom_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABP_SeqCustom_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

