#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BaseRoleNPC

#include "Basic.hpp"

#include "KuroAnim_structs.hpp"
#include "KuroAnim_classes.hpp"
#include "ECharViewDirectionState_structs.hpp"
#include "Engine_structs.hpp"
#include "ECharParentMoveState_structs.hpp"
#include "ECharState_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EMovementDirection_structs.hpp"
#include "ESwim_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BaseRoleNPC.ABP_BaseRoleNPC_C
// 0xC360 (0xCCA0 - 0x0940)
class UABP_BaseRoleNPC_C final : public UKuroAnimInstanceChar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0940(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x0948(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x0980(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x0AB8(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x0BF0(0x0138)()
	struct FAnimNode_AdditiveBoneBlend            AnimGraphNode_AdditiveBoneBlend_3;                 // 0x0D28(0x01B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x0EE0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x0F18(0x00D8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0FF0(0x0038)()
	uint8                                         Pad_1028[0x8];                                     // 0x1028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x1030(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x11E0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x1390(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1540(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1678(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x17B0(0x0138)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_119;                // 0x18E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_118;                // 0x1910(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x1938(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_75;                      // 0x1968(0x0038)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x19A0(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x1A60(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x1A90(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x1AC0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_74;                      // 0x1AF0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_20;                     // 0x1B28(0x0198)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x1CC0(0x0070)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x1D30(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1EE0(0x0138)()
	uint8                                         Pad_2018[0x8];                                     // 0x2018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2020(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_117;                // 0x21D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_116;                // 0x21F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_115;                // 0x2220(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_114;                // 0x2248(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_113;                // 0x2270(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_112;                // 0x2298(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_111;                // 0x22C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_110;                // 0x22E8(0x0028)()
	struct FAnimNode_AdditiveBoneBlend            AnimGraphNode_AdditiveBoneBlend_2;                 // 0x2310(0x01B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x24C8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x24F8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x2528(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73;                      // 0x2558(0x0038)()
	struct FAnimNode_AdditiveBoneBlend            AnimGraphNode_AdditiveBoneBlend_1;                 // 0x2590(0x01B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x2748(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x2778(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x27A8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_72;                      // 0x27D8(0x0038)()
	struct FAnimNode_AdditiveBoneBlend            AnimGraphNode_AdditiveBoneBlend;                   // 0x2810(0x01B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x29C8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x29F8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x2A28(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_71;                      // 0x2A58(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_109;                // 0x2A90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x2AB8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_70;                      // 0x2AE8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_19;                     // 0x2B20(0x0198)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x2CB8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_108;                // 0x2CF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_107;                // 0x2D18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_106;                // 0x2D40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_105;                // 0x2D68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_104;                // 0x2D90(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x2DB8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_69;                      // 0x2E90(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_103;                // 0x2EC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_102;                // 0x2EF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_101;                // 0x2F18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_100;                // 0x2F40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_99;                 // 0x2F68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98;                 // 0x2F90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97;                 // 0x2FB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96;                 // 0x2FE0(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x3008(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68;                      // 0x3110(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x3148(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_67;                      // 0x3220(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_18;                     // 0x3258(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66;                      // 0x33F0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_95;                 // 0x3428(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94;                 // 0x3450(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x3478(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_65;                      // 0x3580(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x35B8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64;                      // 0x3690(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_17;                     // 0x36C8(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_63;                      // 0x3860(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x3898(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_62;                      // 0x3970(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93;                 // 0x39A8(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_16;                     // 0x39D0(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_61;                      // 0x3B68(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_15;                     // 0x3BA0(0x0198)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x3D38(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x3D70(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_60;                      // 0x3E48(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_14;                     // 0x3E80(0x0198)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x4018(0x0060)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x4078(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x40B0(0x0060)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x4110(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x4130(0x0020)()
	struct FAnimNode_SightLock                    AnimGraphNode_SightLock;                           // 0x4150(0x01E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x4338(0x00B0)()
	uint8                                         Pad_43E8[0x8];                                     // 0x43E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KuroHumanIK                  AnimGraphNode_KuroHumanIK;                         // 0x43F0(0x02F0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x46E0(0x0138)()
	struct FAnimNode_CombineCurves                AnimGraphNode_CombineCurves_2;                     // 0x4818(0x0060)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x4878(0x01B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x4A30(0x00D8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x4B08(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x4B68(0x0060)()
	struct FAnimNode_CombineCurves                AnimGraphNode_CombineCurves_1;                     // 0x4BC8(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x4C28(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x4C88(0x0020)()
	uint8                                         Pad_4CA8[0x8];                                     // 0x4CA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RBF                          AnimGraphNode_RBF;                                 // 0x4CB0(0x0150)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x4E00(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x4E20(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x4ED0(0x00D8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x4FA8(0x0108)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x50B0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x5178(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x5250(0x00D8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x5328(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_59;                      // 0x5430(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_13;                     // 0x5468(0x0198)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92;                 // 0x5600(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91;                 // 0x5628(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_90;                 // 0x5650(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89;                 // 0x5678(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88;                 // 0x56A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87;                 // 0x56C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86;                 // 0x56F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85;                 // 0x5718(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84;                 // 0x5740(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_83;                 // 0x5768(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_82;                 // 0x5790(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81;                 // 0x57B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80;                 // 0x57E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79;                 // 0x5808(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78;                 // 0x5830(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0x5858(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0x5880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0x58A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0x58D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0x58F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0x5920(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0x5948(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0x5970(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0x5998(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0x59C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0x59E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x5A10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x5A38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x5A60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x5A88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x5AB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x5AD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x5B00(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x5B28(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_58;                      // 0x5C00(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x5C38(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_57;                      // 0x5D10(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x5D48(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x5D70(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_56;                      // 0x5E48(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x5E80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x5EA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x5ED0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x5EF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x5F20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x5F48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x5F70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x5F98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x5FC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x5FE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x6010(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x6038(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x6060(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x6088(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x60B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x60D8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_55;                      // 0x6100(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_54;                      // 0x6138(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x6170(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x6198(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53;                      // 0x6270(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x62A8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_52;                      // 0x6380(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x63B8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_51;                      // 0x6490(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x64C8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_50;                      // 0x65A0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x65D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x6600(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x6628(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_49;                      // 0x6700(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x6738(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48;                      // 0x6810(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_12;                     // 0x6848(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47;                      // 0x69E0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x6A18(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0x6A40(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x6A78(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x6AA0(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0x6B78(0x0038)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x6BB0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0x6C28(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_11;                     // 0x6C60(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0x6DF8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x6E30(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x6F08(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x6FE0(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x70B8(0x00D8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x7190(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x7268(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_3;                     // 0x7298(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0x72E8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x7320(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x73F8(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x74D0(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x75A8(0x00D8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x7680(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x7758(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_2;                     // 0x7788(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0x77D8(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x7810(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0x7840(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x7878(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0x78A8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_10;                     // 0x78E0(0x0198)()
	uint8                                         Pad_7A78[0x8];                                     // 0x7A78(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x7A80(0x01B0)()
	struct FAnimNode_CombineCurves                AnimGraphNode_CombineCurves;                       // 0x7C30(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x7C90(0x0060)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x7CF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x7D18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x7D40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x7D68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x7D90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x7DB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x7DE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x7E08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x7E30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x7E58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x7E80(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x7EA8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0x7F80(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x7FB8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0x8090(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x80C8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0x81A0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0x81D8(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x8370(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x83A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x83D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x83F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x8420(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x8448(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x8470(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x8498(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x8570(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0x85A8(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0x85E0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x8618(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x86F0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x8728(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x8800(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x8838(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x8910(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x8948(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x8A20(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0x8A58(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0x8BF0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x8C28(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x8D00(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x8D38(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x8ED0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x8F08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x8F30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x8F58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x8F80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x8FA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x8FD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x8FF8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x9020(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x90F8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x9130(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0x9208(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x9240(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x9318(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x9350(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x94E8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x9520(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x95F8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x9630(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0x9708(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x9740(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x9778(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x9910(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x9948(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x9970(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x9998(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x99C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x99E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x9A10(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x9A38(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x9B10(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x9B48(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x9B80(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x9BB8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x9C90(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x9CC8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x9DA0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x9DD8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x9EB0(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x9EE8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x9F20(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0xA0B8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0xA0F0(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0xA288(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0xA2C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0xA2E8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0xA310(0x0038)()
	uint8                                         Pad_A348[0x8];                                     // 0xA348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ExtraFollowAnims             AnimGraphNode_ExtraFollowAnims;                    // 0xA350(0x0D60)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0xB0B0(0x0038)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xB0E8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0xB108(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xB230(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0xB250(0x00D8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0xB328(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0xB350(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0xB378(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0xB3A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0xB3C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0xB3F0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0xB418(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0xB4F0(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0xB5C8(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0xB6A0(0x00D8)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_1;                     // 0xB778(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0xB7C8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0xB800(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0xB8D8(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0xB9B0(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0xBA88(0x00D8)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend;                       // 0xBB60(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0xBBB0(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0xBBE8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0xBC20(0x0198)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0xBDB8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0xBE90(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0xBEC8(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0xC060(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0xC098(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0xC0C8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0xC100(0x0198)()
	uint8                                         Pad_C298[0x8];                                     // 0xC298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0xC2A0(0x01B0)()
	struct FAnimNode_CurveFix                     AnimGraphNode_CurveFix;                            // 0xC450(0x0030)()
	struct FAnimNode_KuroCacheBones               AnimGraphNode_KuroCacheBones;                      // 0xC480(0x0148)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0xC5C8(0x00C0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0xC688(0x00C0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0xC748(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0xC808(0x00B0)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0xC8B8(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0xC968(0x00C0)()
	class ATsBaseCharacter_C*                     角色蓝图;                                          // 0xCA28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTimeX;                                        // 0xCA30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                速度向量;                                          // 0xCA34(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                加速度;                                            // 0xCA40(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                移动输入向量;                                      // 0xCA4C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          是否正在移动;                                      // 0xCA58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          是否有移动输入;                                    // 0xCA59(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA5A[0x2];                                     // 0xCA5A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         速度;                                              // 0xCA5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               瞄准旋转;                                          // 0xCA60(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          是否将要移动;                                      // 0xCA6C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          正在旋转;                                          // 0xCA6D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA6E[0x2];                                     // 0xCA6E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         旋转速度;                                          // 0xCA70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         旋转混合;                                          // 0xCA74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVeloctiyBlend                         速度混合;                                          // 0xCA78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                相对加速度;                                        // 0xCA88(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLeanAmount                            倾斜量;                                            // 0xCA94(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         地上倾斜量平滑速度;                                // 0xCA9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementDirection                            移动方向;                                          // 0xCAA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAA1[0x3];                                     // 0xCAA1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         站立播放速率;                                      // 0xCAA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         走跑混合;                                          // 0xCAA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAAC[0x4];                                     // 0xCAAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            站立走步幅混合曲线;                                // 0xCAB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            站立跑步幅混合曲线;                                // 0xCAB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         步幅混合;                                          // 0xCAC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         动画行走速度;                                      // 0xCAC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         动画跑步速度;                                      // 0xCAC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         动画疾跑速度;                                      // 0xCACC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            RelativeSpeedBlendCurve;                           // 0xCAD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                整体偏移;                                          // 0xCAD8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAE4[0x4];                                     // 0xCAE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 角色Mesh;                                          // 0xCAE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                整体偏移_实际使用_;                                // 0xCAF0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                上一帧模型位置;                                    // 0xCAFC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAutonomousProxy;                                 // 0xCB08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB09[0x3];                                     // 0xCB09(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         瞄准面向;                                          // 0xCB0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         瞄准仰角;                                          // 0xCB10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         当前坡度;                                          // 0xCB14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         视线修正Alpha;                                     // 0xCB18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                看向位置;                                          // 0xCB1C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CachePercent_LR;                                   // 0xCB28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CachePercent_FB;                                   // 0xCB2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                角色向前向量;                                      // 0xCB30(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                外部方向输入;                                      // 0xCB3C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          是否需要原地转身;                                  // 0xCB48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          右转;                                              // 0xCB49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          状态_跑停;                                         // 0xCB4A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          状态_跑停_RunStop;                                 // 0xCB4B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          状态_跑停_SprintStop;                              // 0xCB4C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          状态_跑停_WalkStop;                                // 0xCB4D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          状态_地面_Sprint;                                  // 0xCB4E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          状态_地面_Walk;                                    // 0xCB4F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          状态_地面_Run;                                     // 0xCB50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          状态_牵手_牵手中;                                  // 0xCB51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          状态_牵手_被牵手中;                                // 0xCB52(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          状态_牵手_范围内;                                  // 0xCB53(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          状态_牵手_接受邀请中;                              // 0xCB54(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ECharState                                    CharMoveState;                                     // 0xCB55(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB56[0x2];                                     // 0xCB56(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ExpresionAlpha;                                    // 0xCB58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomEpresionEndTime;                             // 0xCB5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         眨眼动画时长;                                      // 0xCB60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         此轮眨眼动画总时长;                                // 0xCB64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               角色旋转;                                          // 0xCB68(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         原地旋转偏差角;                                    // 0xCB74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          移动时是否有阻挡;                                  // 0xCB78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB79[0x3];                                     // 0xCB79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeSeconds;                                       // 0xCB7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
