#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SeqCustom

#include "Basic.hpp"

#include "KuroAnim_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_SeqCustom.ABP_SeqCustom_C
// 0x06B0 (0x0DE0 - 0x0730)
class UABP_SeqCustom_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0730(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0738(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x0770(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x07D0(0x0060)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0830(0x0138)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0968(0x0060)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x09C8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x09E8(0x0020)()
	struct FAnimNode_KuroModifyBones              AnimGraphNode_KuroModifyBones;                     // 0x0A08(0x0190)()
	struct FAnimNode_CurveSource                  AnimGraphNode_CurveSource;                         // 0x0B98(0x0040)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0BD8(0x0060)()
	struct FAnimNode_CurveFix                     AnimGraphNode_CurveFix;                            // 0x0C38(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0C68(0x0060)()
	struct FAnimNode_CombineCurves                AnimGraphNode_CombineCurves_1;                     // 0x0CC8(0x0060)()
	struct FAnimNode_CombineCurves                AnimGraphNode_CombineCurves;                       // 0x0D28(0x0060)()
	TMap<class FName, struct FTransform>          Vector_Curve_Data;                                 // 0x0D88(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ABP_SeqCustom(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_SeqCustom_C">();
	}
	static class UABP_SeqCustom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_SeqCustom_C>();
	}
};
static_assert(alignof(UABP_SeqCustom_C) == 0x000010, "Wrong alignment on UABP_SeqCustom_C");
static_assert(sizeof(UABP_SeqCustom_C) == 0x000DE0, "Wrong size on UABP_SeqCustom_C");
static_assert(offsetof(UABP_SeqCustom_C, UberGraphFrame) == 0x000730, "Member 'UABP_SeqCustom_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_Root) == 0x000738, "Member 'UABP_SeqCustom_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_Slot_4) == 0x000770, "Member 'UABP_SeqCustom_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_Slot_3) == 0x0007D0, "Member 'UABP_SeqCustom_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_LinkedInputPose) == 0x000830, "Member 'UABP_SeqCustom_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_Slot_2) == 0x000968, "Member 'UABP_SeqCustom_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_LocalToComponentSpace) == 0x0009C8, "Member 'UABP_SeqCustom_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_ComponentToLocalSpace) == 0x0009E8, "Member 'UABP_SeqCustom_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_KuroModifyBones) == 0x000A08, "Member 'UABP_SeqCustom_C::AnimGraphNode_KuroModifyBones' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_CurveSource) == 0x000B98, "Member 'UABP_SeqCustom_C::AnimGraphNode_CurveSource' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_Slot_1) == 0x000BD8, "Member 'UABP_SeqCustom_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_CurveFix) == 0x000C38, "Member 'UABP_SeqCustom_C::AnimGraphNode_CurveFix' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_Slot) == 0x000C68, "Member 'UABP_SeqCustom_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_CombineCurves_1) == 0x000CC8, "Member 'UABP_SeqCustom_C::AnimGraphNode_CombineCurves_1' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, AnimGraphNode_CombineCurves) == 0x000D28, "Member 'UABP_SeqCustom_C::AnimGraphNode_CombineCurves' has a wrong offset!");
static_assert(offsetof(UABP_SeqCustom_C, Vector_Curve_Data) == 0x000D88, "Member 'UABP_SeqCustom_C::Vector_Curve_Data' has a wrong offset!");

}

