#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AkAudio

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "UMG_classes.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "WwiseResourceLoader_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class AkAudio.AkSpotReflector
// 0x0038 (0x02E8 - 0x02B0)
class AAkSpotReflector final : public AActor
{
public:
	class UAkAuxBus*                              EarlyReflectionAuxBus;                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EarlyReflectionAuxBusName;                         // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAcousticTexture*                     AcousticTexture;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceScalingFactor;                             // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SameRoomOnly;                                      // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableRoomOverride;                                // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RoomOverride;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkSpotReflector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkSpotReflector")
	}
	static class AAkSpotReflector* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkSpotReflector>();
	}
};
DUMPER7_ASSERTS_AAkSpotReflector;

// Class AkAudio.AkPortalComponent
// 0x00C0 (0x02E0 - 0x0220)
class UAkPortalComponent final : public USceneComponent
{
public:
	bool                                          bDynamic;                                          // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkAcousticPortalState                        InitialState;                                      // 0x0219(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObstructionRefreshInterval;                        // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             ObstructionCollisionChannel;                       // 0x0220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_221[0xBF];                                     // 0x0221(0x00BF)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClosePortal();
	void OpenPortal();

	EAkAcousticPortalState GetCurrentState() const;
	class UPrimitiveComponent* GetPrimitiveParent() const;
	bool PortalPlacementValid() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkPortalComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkPortalComponent")
	}
	static class UAkPortalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPortalComponent>();
	}
};
DUMPER7_ASSERTS_UAkPortalComponent;

// Class AkAudio.AkAudioType
// 0x0028 (0x0058 - 0x0030)
class UAkAudioType : public UObject
{
public:
	bool                                          bAutoLoad;                                         // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        UserData;                                          // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LoadData();
	void UnloadData(bool bAsync);

	int32 GetWwiseShortID() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioType")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioType")
	}
	static class UAkAudioType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioType>();
	}
};
DUMPER7_ASSERTS_UAkAudioType;

// Class AkAudio.AkGroupValue
// 0x0028 (0x0080 - 0x0058)
class UAkGroupValue : public UAkAudioType
{
public:
	struct FWwiseGroupValueCookedData             GroupValueCookedData;                              // 0x0058(0x0018)(Edit, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        GroupShortID;                                      // 0x0070(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkGroupValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkGroupValue")
	}
	static class UAkGroupValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkGroupValue>();
	}
};
DUMPER7_ASSERTS_UAkGroupValue;

// Class AkAudio.AkStateValue
// 0x0000 (0x0080 - 0x0080)
class UAkStateValue final : public UAkGroupValue
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkStateValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkStateValue")
	}
	static class UAkStateValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkStateValue>();
	}
};
DUMPER7_ASSERTS_UAkStateValue;

// Class AkAudio.AkAcousticPortal
// 0x0010 (0x02F8 - 0x02E8)
class AAkAcousticPortal final : public AVolume
{
public:
	class UAkPortalComponent*                     Portal;                                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkAcousticPortalState                        InitialState;                                      // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRequiresStateMigration;                           // 0x02F1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClosePortal();
	void OpenPortal();

	EAkAcousticPortalState GetCurrentState() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAcousticPortal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAcousticPortal")
	}
	static class AAkAcousticPortal* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkAcousticPortal>();
	}
};
DUMPER7_ASSERTS_AAkAcousticPortal;

// Class AkAudio.AkAcousticTexture
// 0x0010 (0x0068 - 0x0058)
class UAkAcousticTexture final : public UAkAudioType
{
public:
	struct FWwiseAcousticTextureCookedData        AcousticTextureCookedData;                         // 0x0058(0x0010)(Edit, Transient, EditConst, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAcousticTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAcousticTexture")
	}
	static class UAkAcousticTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAcousticTexture>();
	}
};
DUMPER7_ASSERTS_UAkAcousticTexture;

// Class AkAudio.AkAcousticTextureSetComponent
// 0x0010 (0x0230 - 0x0220)
class UAkAcousticTextureSetComponent : public USceneComponent
{
public:
	uint8                                         Pad_218[0x18];                                     // 0x0218(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAcousticTextureSetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAcousticTextureSetComponent")
	}
	static class UAkAcousticTextureSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAcousticTextureSetComponent>();
	}
};
DUMPER7_ASSERTS_UAkAcousticTextureSetComponent;

// Class AkAudio.AkAmbientSound
// 0x0040 (0x02F0 - 0x02B0)
class AAkAmbientSound final : public AActor
{
public:
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x02B0(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkComponent*                           AkComponent;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopWhenOwnerIsDestroyed;                          // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoPost;                                          // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C2[0x2E];                                     // 0x02C2(0x002E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartAmbientSound();
	void StopAmbientSound();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAmbientSound")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAmbientSound")
	}
	static class AAkAmbientSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkAmbientSound>();
	}
};
DUMPER7_ASSERTS_AAkAmbientSound;

// Class AkAudio.AkAndroidInitializationSettings
// 0x00F8 (0x0128 - 0x0030)
class UAkAndroidInitializationSettings final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkCommonInitializationSettingsWithSampleRate CommonSettings;                             // 0x0038(0x0078)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkCommunicationSettingsWithSystemInitialization CommunicationSettings;                   // 0x00B0(0x0020)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkAndroidAdvancedInitializationSettings AdvancedSettings;                                // 0x00D0(0x0058)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	void MigrateMultiCoreRendering(bool NewValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAndroidInitializationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAndroidInitializationSettings")
	}
	static class UAkAndroidInitializationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAndroidInitializationSettings>();
	}
};
DUMPER7_ASSERTS_UAkAndroidInitializationSettings;

// Class AkAudio.AkPlatformInfo
// 0x0048 (0x0078 - 0x0030)
class UAkPlatformInfo : public UObject
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkPlatformInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkPlatformInfo")
	}
	static class UAkPlatformInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPlatformInfo>();
	}
};
DUMPER7_ASSERTS_UAkPlatformInfo;

// Class AkAudio.AkAndroidPlatformInfo
// 0x0000 (0x0078 - 0x0078)
class UAkAndroidPlatformInfo final : public UAkPlatformInfo
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAndroidPlatformInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAndroidPlatformInfo")
	}
	static class UAkAndroidPlatformInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAndroidPlatformInfo>();
	}
};
DUMPER7_ASSERTS_UAkAndroidPlatformInfo;

// Class AkAudio.AkAudioBank
// 0x0008 (0x0060 - 0x0058)
class UAkAudioBank final : public UAkAudioType
{
public:
	bool                                          AutoLoad;                                          // 0x0058(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioBank")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioBank")
	}
	static class UAkAudioBank* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioBank>();
	}
};
DUMPER7_ASSERTS_UAkAudioBank;

// Class AkAudio.AkAudioEvent
// 0x0080 (0x00D8 - 0x0058)
class UAkAudioEvent final : public UAkAudioType
{
public:
	float                                         MaxAttenuationRadius;                              // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInfinite;                                        // 0x005C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumDuration;                                   // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumDuration;                                   // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseLocalizedEventCookedData         EventCookedData;                                   // 0x0068(0x0060)(Edit, Transient, EditConst, NativeAccessSpecifierPublic)
	class UAkAudioBank*                           RequiredBank;                                      // 0x00C8(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 D_PostAtLocation(const struct FVectorDouble& Location, const struct FRotator& Orientation, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Callback, const int32 CallbackMask, const class UObject* WorldContextObject);
	int32 ExecuteAction(const EAkActionOnEventType ActionType, const class AActor* Actor, const int32 PlayingID, const int32 TransitionDuration, const EAkCurveInterpolation FadeCurve);
	int32 PostAtLocation(const struct FVector& Location, const struct FRotator& Orientation, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Callback, const int32 CallbackMask, const class UObject* WorldContextObject);
	int32 PostOnActor(const class AActor* Actor, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask, const bool bStopWhenAttachedObjectDestroyed);
	int32 PostOnActorAndWait(const class AActor* Actor, const bool bStopWhenAttachedObjectDestroyed, const struct FLatentActionInfo& LatentActionInfo);
	int32 PostOnComponent(class UAkComponent* Component, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask, const bool bStopWhenAttachedObjectDestroyed);
	int32 PostOnComponentAndWait(class UAkComponent* Component, const bool bStopWhenAttachedObjectDestroyed, const struct FLatentActionInfo& LatentActionInfo);
	int32 PostOnGameObject(class UAkGameObject* GameObject, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask);
	int32 PostOnGameObjectAndWait(class UAkGameObject* GameObject, const struct FLatentActionInfo& LatentActionInfo);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioEvent")
	}
	static class UAkAudioEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioEvent>();
	}
};
DUMPER7_ASSERTS_UAkAudioEvent;

// Class AkAudio.AkGameObject
// 0x0020 (0x0240 - 0x0220)
#pragma pack(push, 0x1)
class alignas(0x10) UAkGameObject : public USceneComponent
{
public:
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventName;                                         // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 PostAkEvent(class UAkAudioEvent* AkEvent, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const class FString& InEventName);
	void PostAkEventAsync(const class UObject* WorldContextObject, class UAkAudioEvent* AkEvent, int32* PlayingID, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const struct FLatentActionInfo& LatentInfo);
	int32 PostAssociatedAkEvent(int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback);
	void PostAssociatedAkEventAsync(const class UObject* WorldContextObject, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const struct FLatentActionInfo& LatentInfo, int32* PlayingID);
	void Stop();

	void GetRTPCValue(class UAkRtpc* RTPCValue, ERTPCValueType InputValueType, float* Value, ERTPCValueType* OutputValueType, const class FString& RTPC, int32 PlayingID) const;
	void SetRTPCValue(class UAkRtpc* RTPCValue, float Value, int32 InterpolationTimeMs, const class FString& RTPC) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkGameObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkGameObject")
	}
	static class UAkGameObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkGameObject>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UAkGameObject;

// Class AkAudio.AkComponent
// 0x0160 (0x03A0 - 0x0240)
class UAkComponent : public UAkGameObject
{
public:
	bool                                          StopWhenOwnerDestroyed;                            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AttenuationScalingFactor;                          // 0x023C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseReverbVolumes;                                 // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableOcclusion;                                  // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_242[0x15E];                                    // 0x0242(0x015E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PostTrigger(class UAkTrigger* TriggerValue, const class FString& Trigger);
	void SetAttenuationScalingFactor(float Value);
	void SetListeners(const TArray<class UAkComponent*>& Listeners);
	void SetLocationOffsets(const TArray<struct FVector>& Offsets);
	void SetOutputBusVolume(float BusVolume);
	void SetStopWhenOwnerDestroyed(bool bStopWhenOwnerDestroyed);
	void SetSwitch(class UAkSwitchValue* SwitchValue, const class FString& SwitchGroup, const class FString& SwitchState);
	void UseReverbVolumes(bool inUseReverbVolumes);

	float GetAttenuationRadius() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkComponent")
	}
	static class UAkComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkComponent>();
	}
};
DUMPER7_ASSERTS_UAkComponent;

// Class AkAudio.AkAudioInputComponent
// 0x0030 (0x03D0 - 0x03A0)
class UAkAudioInputComponent : public UAkComponent
{
public:
	uint8                                         Pad_3A0[0x30];                                     // 0x03A0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 PostAssociatedAudioInputEvent();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioInputComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioInputComponent")
	}
	static class UAkAudioInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioInputComponent>();
	}
};
DUMPER7_ASSERTS_UAkAudioInputComponent;

// Class AkAudio.AkAuxBus
// 0x0070 (0x00C8 - 0x0058)
class UAkAuxBus final : public UAkAudioType
{
public:
	struct FWwiseLocalizedAuxBusCookedData        AuxBusCookedData;                                  // 0x0058(0x0060)(Edit, Transient, NativeAccessSpecifierPublic)
	class UAkAudioBank*                           RequiredBank;                                      // 0x00B8(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAuxBus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAuxBus")
	}
	static class UAkAuxBus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAuxBus>();
	}
};
DUMPER7_ASSERTS_UAkAuxBus;

// Class AkAudio.AkCheckBox
// 0x0A88 (0x0C10 - 0x0188)
class UAkCheckBox final : public UContentWidget
{
public:
	uint8                                         Pad_188[0x3A0];                                    // 0x0188(0x03A0)(Fixing Size After Last Property [ Dumper-7 ])
	ECheckBoxState                                CheckedState;                                      // 0x0528(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             CheckedStateDelegate;                              // 0x0530(0x0028)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	struct FCheckBoxStyle                         WidgetStyle;                                       // 0x0558(0x05E0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0B38(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFocusable;                                       // 0x0B39(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B3A[0x6];                                      // 0x0B3A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkBoolPropertyToControl               ThePropertyToControl;                              // 0x0B40(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FAkWwiseItemToControl                  ItemToControl;                                     // 0x0B50(0x0040)(Edit, Config, EditConst, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsChecked)> AkOnCheckStateChanged;                           // 0x0B90(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGuid& ItemDroppedID)> OnItemDropped;                 // 0x0BA0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& PropertyDropped)> OnPropertyDropped;          // 0x0BB0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC0[0x50];                                     // 0x0BC0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAkBoolProperty(const class FString& ItemProperty);
	void SetAkItemId(const struct FGuid& ItemId);
	void SetCheckedState(ECheckBoxState InCheckedState);
	void SetIsChecked(bool InIsChecked);

	const struct FGuid GetAkItemId() const;
	const class FString GetAkProperty() const;
	ECheckBoxState GetCheckedState() const;
	bool IsChecked() const;
	bool IsPressed() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkCheckBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkCheckBox")
	}
	static class UAkCheckBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkCheckBox>();
	}
};
DUMPER7_ASSERTS_UAkCheckBox;

// Class AkAudio.AkAssetData
// 0x0028 (0x0058 - 0x0030)
class UAkAssetData final : public UObject
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAssetData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAssetData")
	}
	static class UAkAssetData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAssetData>();
	}
};
DUMPER7_ASSERTS_UAkAssetData;

// Class AkAudio.AkAssetPlatformData
// 0x0008 (0x0038 - 0x0030)
class UAkAssetPlatformData final : public UObject
{
public:
	class UAkAssetData*                           CurrentAssetData;                                  // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAssetPlatformData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAssetPlatformData")
	}
	static class UAkAssetPlatformData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAssetPlatformData>();
	}
};
DUMPER7_ASSERTS_UAkAssetPlatformData;

// Class AkAudio.AkMediaAssetData
// 0x0010 (0x0040 - 0x0030)
class UAkMediaAssetData final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMediaAssetData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMediaAssetData")
	}
	static class UAkMediaAssetData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMediaAssetData>();
	}
};
DUMPER7_ASSERTS_UAkMediaAssetData;

// Class AkAudio.AkMediaAsset
// 0x0050 (0x0080 - 0x0030)
class UAkMediaAsset : public UObject
{
public:
	TMap<class FString, class UAkMediaAssetData*> MediaAssetDataPerPlatform;                         // 0x0030(0x0050)(Edit, Transient, EditConst, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMediaAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMediaAsset")
	}
	static class UAkMediaAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMediaAsset>();
	}
};
DUMPER7_ASSERTS_UAkMediaAsset;

// Class AkAudio.AkLocalizedMediaAsset
// 0x0000 (0x0080 - 0x0080)
class UAkLocalizedMediaAsset final : public UAkMediaAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkLocalizedMediaAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkLocalizedMediaAsset")
	}
	static class UAkLocalizedMediaAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkLocalizedMediaAsset>();
	}
};
DUMPER7_ASSERTS_UAkLocalizedMediaAsset;

// Class AkAudio.AkExternalMediaAsset
// 0x0000 (0x0080 - 0x0080)
class UAkExternalMediaAsset final : public UAkMediaAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkExternalMediaAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkExternalMediaAsset")
	}
	static class UAkExternalMediaAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkExternalMediaAsset>();
	}
};
DUMPER7_ASSERTS_UAkExternalMediaAsset;

// Class AkAudio.AkFolder
// 0x0000 (0x0058 - 0x0058)
class UAkFolder final : public UAkAudioType
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkFolder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkFolder")
	}
	static class UAkFolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkFolder>();
	}
};
DUMPER7_ASSERTS_UAkFolder;

// Class AkAudio.DrawPortalComponent
// 0x0000 (0x0530 - 0x0530)
class UDrawPortalComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DrawPortalComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DrawPortalComponent")
	}
	static class UDrawPortalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawPortalComponent>();
	}
};
DUMPER7_ASSERTS_UDrawPortalComponent;

// Class AkAudio.DrawRoomComponent
// 0x0000 (0x0530 - 0x0530)
class UDrawRoomComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DrawRoomComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DrawRoomComponent")
	}
	static class UDrawRoomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawRoomComponent>();
	}
};
DUMPER7_ASSERTS_UDrawRoomComponent;

// Class AkAudio.AkEffectShareSet
// 0x0068 (0x00C0 - 0x0058)
class UAkEffectShareSet final : public UAkAudioType
{
public:
	struct FWwiseLocalizedShareSetCookedData      ShareSetCookedData;                                // 0x0058(0x0060)(Edit, Transient, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkEffectShareSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkEffectShareSet")
	}
	static class UAkEffectShareSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkEffectShareSet>();
	}
};
DUMPER7_ASSERTS_UAkEffectShareSet;

// Class AkAudio.AkGameplayStatics
// 0x0000 (0x0030 - 0x0030)
class UAkGameplayStatics final : public UBlueprintFunctionLibrary
{
public:
	static void AddOutput(const struct FAkOutputSettings& in_Settings, struct FAkOutputDeviceID* out_DeviceID, TArray<class UAkComponent*>& in_ListenerIDs);
	static void AddOutputCaptureMarker(const class FString& MarkerText);
	static void CancelEventCallback(const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback);
	static void ClearBanks();
	static void ClearSoundBanksAndMedia();
	static int32 D_PostEventAtLocation(class UAkAudioEvent* AkEvent, const struct FVectorDouble& Location, const struct FRotator& Orientation, const class FString& EventName, class UObject* WorldContextObject);
	static void D_SetMultiplePositions(class UAkComponent* GameObjectAkComponent, const TArray<struct FTransformDouble>& Positions, EAkMultiPositionType MultiPositionType);
	static void ExecuteActionOnEvent(class UAkAudioEvent* AkEvent, EAkActionOnEventType ActionType, class AActor* Actor, int32 TransitionDuration, EAkCurveInterpolation FadeCurve, int32 PlayingID);
	static void ExecuteActionOnPlayingID(EAkActionOnEventType ActionType, int32 PlayingID, int32 TransitionDuration, EAkCurveInterpolation FadeCurve);
	static class UObject* GetAkAudioTypeUserData(const class UAkAudioType* Instance, const class UClass* Type);
	static class UAkComponent* GetAkComponent(class USceneComponent* AttachToComponent, bool* ComponentCreated, class FName AttachPointName, const struct FVector& Location, EAttachLocation LocationType);
	static TArray<class FString> GetAvailableAudioCultures();
	static class FString GetCurrentAudioCulture();
	static void GetRTPCValue(class UAkRtpc* RTPCValue, int32 PlayingID, ERTPCValueType InputValueType, float* Value, ERTPCValueType* OutputValueType, class AActor* Actor, class FName RTPC);
	static int32 GetSourcePlayPosition(int32 PlayingID);
	static void GetSpeakerAngles(TArray<float>* SpeakerAngles, float* HeightAngle, const class FString& DeviceShareSet);
	static bool IsAudioEventActive(const class UAkAudioEvent* AudioEvent);
	static bool IsEditor();
	static bool IsGame(class UObject* WorldContextObject);
	static void LoadBankByName(const class FString& BankName);
	static void LoadInitBank();
	static int32 PostAndWaitForEndOfEvent(class UAkAudioEvent* AkEvent, class AActor* Actor, bool bStopWhenAttachedToDestroyed, const struct FLatentActionInfo& LatentInfo);
	static void PostAndWaitForEndOfEventAsync(class UAkAudioEvent* AkEvent, class AActor* Actor, int32* PlayingID, bool bStopWhenAttachedToDestroyed, const struct FLatentActionInfo& LatentInfo);
	static int32 PostEvent(class UAkAudioEvent* AkEvent, class AActor* Actor, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, bool bStopWhenAttachedToDestroyed, const class FString& EventName);
	static int32 PostEventAtLocation(class UAkAudioEvent* AkEvent, const struct FVector& Location, const struct FRotator& Orientation, const class FString& EventName, class UObject* WorldContextObject);
	static void PostEventAtLocationByName(const class FString& EventName, const struct FVector& Location, const struct FRotator& Orientation, class UObject* WorldContextObject);
	static int32 PostEventByDummyGameObj(class UAkAudioEvent* in_pAkEvent, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback);
	static void PostEventByName(const class FString& EventName, class AActor* Actor, bool bStopWhenAttachedToDestroyed);
	static void PostTrigger(class UAkTrigger* TriggerValue, class AActor* Actor, class FName Trigger);
	static void ReloadAudioAssetData();
	static void RemoveOutput(const struct FAkOutputDeviceID& in_OutputDeviceId);
	static void RenderAudio();
	static void ReplaceMainOutput(const struct FAkOutputSettings& MainOutputSettings);
	static void ResetRTPCValue(class UAkRtpc* RTPCValue, int32 InterpolationTimeMs, class AActor* Actor, class FName RTPC);
	static bool SetActorMixerEffect(const struct FAkUniqueID& InAudioNodeID, const int32 InEffectIndex, const class UAkEffectShareSet* InEffectShareSet);
	static bool SetAuxBusEffect(const class UAkAuxBus* InAuxBus, const int32 InEffectIndex, const class UAkEffectShareSet* InEffectShareSet);
	static void SetBusConfig(const class FString& BusName, EAkChannelConfiguration ChannelConfiguration);
	static bool SetBusEffectByID(const struct FAkUniqueID& InBusID, const int32 InEffectIndex, const class UAkEffectShareSet* InEffectShareSet);
	static bool SetBusEffectByName(const class FString& InBusName, const int32 InEffectIndex, const class UAkEffectShareSet* InEffectShareSet);
	static void SetCurrentAudioCulture(const class FString& AudioCulture, const struct FLatentActionInfo& LatentInfo, class UObject* WorldContextObject);
	static void SetCurrentAudioCultureAsync(const class FString& AudioCulture, const TDelegate<void(bool Succeeded)>& Completed);
	static void SetDistanceProbe(class AActor* Listener, class AActor* DistanceProbe);
	static void SetGameObjectToPortalObstruction(class UAkComponent* GameObjectAkComponent, class UAkPortalComponent* PortalComponent, float ObstructionValue);
	static void SetMultiplePositions(class UAkComponent* GameObjectAkComponent, const TArray<struct FTransform>& Positions, EAkMultiPositionType MultiPositionType);
	static void SetOutputBusVolume(float BusVolume, class AActor* Actor);
	static bool SetOutputDeviceEffect(const struct FAkOutputDeviceID& InDeviceID, const int32 InEffectIndex, const class UAkEffectShareSet* InEffectShareSet);
	static void SetPanningRule(EPanningRule PanRule);
	static void SetPortalObstructionAndOcclusion(class UAkPortalComponent* PortalComponent, float ObstructionValue, float OcclusionValue);
	static void SetPortalToPortalObstruction(class UAkPortalComponent* PortalComponent0, class UAkPortalComponent* PortalComponent1, float ObstructionValue);
	static void SetReflectionsOrder(int32 Order, bool RefreshPaths);
	static void SetRTPCValue(class UAkRtpc* RTPCValue, float Value, int32 InterpolationTimeMs, class AActor* Actor, class FName RTPC);
	static void SetSpeakerAngles(const TArray<float>& SpeakerAngles, float HeightAngle, const class FString& DeviceShareSet);
	static void SetState(class UAkStateValue* StateValue, class FName StateGroup, class FName State);
	static void SetSwitch(class UAkSwitchValue* SwitchValue, class AActor* Actor, class FName SwitchGroup, class FName SwitchState);
	static class UAkComponent* SpawnAkComponentAtLocation(class UObject* WorldContextObject, class UAkAudioEvent* AkEvent, const struct FVector& Location, const struct FRotator& Orientation, bool AutoPost, const class FString& EventName, bool AutoDestroy);
	static void StartAllAmbientSounds(class UObject* WorldContextObject);
	static void StartOutputCapture(const class FString& Filename);
	static void StartProfilerCapture(const class FString& Filename);
	static void StopActor(class AActor* Actor);
	static void StopAll();
	static void StopAllAmbientSounds(class UObject* WorldContextObject);
	static void StopOutputCapture();
	static void StopProfilerCapture();
	static void Suspend(bool bValue);
	static void UnloadBankByName(const class FString& BankName);
	static void UnloadInitBank();
	static void UseEarlyReflections(class AActor* Actor, class UAkAuxBus* AuxBus, int32 Order, float BusSendGain, float MaxPathLength, bool SpotReflectors, const class FString& AuxBusName);
	static void UseReverbVolumes(bool inUseReverbVolumes, class AActor* Actor);
	static void WakeupFromSuspend();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkGameplayStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkGameplayStatics")
	}
	static class UAkGameplayStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkGameplayStatics>();
	}
};
DUMPER7_ASSERTS_UAkGameplayStatics;

// Class AkAudio.AkCallbackInfo
// 0x0008 (0x0038 - 0x0030)
class UAkCallbackInfo : public UObject
{
public:
	class UAkComponent*                           AkComponent;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkCallbackInfo")
	}
	static class UAkCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkCallbackInfo;

// Class AkAudio.AkEventCallbackInfo
// 0x0008 (0x0040 - 0x0038)
class UAkEventCallbackInfo : public UAkCallbackInfo
{
public:
	int32                                         PlayingID;                                         // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EventID;                                           // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkEventCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkEventCallbackInfo")
	}
	static class UAkEventCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkEventCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkEventCallbackInfo;

// Class AkAudio.AkMIDIEventCallbackInfo
// 0x0010 (0x0050 - 0x0040)
class UAkMIDIEventCallbackInfo final : public UAkEventCallbackInfo
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetCc(struct FAkMidiCc* AsCc);
	uint8 GetChannel();
	bool GetChannelAftertouch(struct FAkMidiChannelAftertouch* AsChannelAftertouch);
	bool GetGeneric(struct FAkMidiGeneric* AsGeneric);
	bool GetNoteAftertouch(struct FAkMidiNoteAftertouch* AsNoteAftertouch);
	bool GetNoteOff(struct FAkMidiNoteOnOff* AsNoteOff);
	bool GetNoteOn(struct FAkMidiNoteOnOff* AsNoteOn);
	bool GetPitchBend(struct FAkMidiPitchBend* AsPitchBend);
	bool GetProgramChange(struct FAkMidiProgramChange* AsProgramChange);
	EAkMidiEventType GetType();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMIDIEventCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMIDIEventCallbackInfo")
	}
	static class UAkMIDIEventCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMIDIEventCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkMIDIEventCallbackInfo;

// Class AkAudio.AkMarkerCallbackInfo
// 0x0018 (0x0058 - 0x0040)
class UAkMarkerCallbackInfo final : public UAkEventCallbackInfo
{
public:
	int32                                         Identifier;                                        // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Position;                                          // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Label;                                             // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMarkerCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMarkerCallbackInfo")
	}
	static class UAkMarkerCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMarkerCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkMarkerCallbackInfo;

// Class AkAudio.AkDurationCallbackInfo
// 0x0018 (0x0058 - 0x0040)
class UAkDurationCallbackInfo final : public UAkEventCallbackInfo
{
public:
	float                                         Duration;                                          // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EstimatedDuration;                                 // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AudioNodeID;                                       // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MediaID;                                           // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStreaming;                                        // 0x0050(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkDurationCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkDurationCallbackInfo")
	}
	static class UAkDurationCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkDurationCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkDurationCallbackInfo;

// Class AkAudio.AkMusicSyncCallbackInfo
// 0x0040 (0x0078 - 0x0038)
class UAkMusicSyncCallbackInfo final : public UAkCallbackInfo
{
public:
	int32                                         PlayingID;                                         // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAkSegmentInfo                         SegmentInfo;                                       // 0x003C(0x0024)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	EAkCallbackType                               MusicSyncType;                                     // 0x0060(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UserCueName;                                       // 0x0068(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMusicSyncCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMusicSyncCallbackInfo")
	}
	static class UAkMusicSyncCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMusicSyncCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkMusicSyncCallbackInfo;

// Class AkAudio.AkGeometryComponent
// 0x0190 (0x03C0 - 0x0230)
class UAkGeometryComponent final : public UAkAcousticTextureSetComponent
{
public:
	EAkMeshType                                   MeshType;                                          // 0x0230(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LOD;                                               // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeldingThreshold;                                  // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UMaterialInterface*, struct FAkGeometrySurfaceOverride> StaticMeshSurfaceOverride;    // 0x0240(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAkGeometrySurfaceOverride             CollisionMeshSurfaceOverride;                      // 0x0290(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableDiffraction;                                // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDiffractionOnBoundaryEdges;                 // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AssociatedRoom;                                    // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0x10];                                     // 0x02B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkGeometryData                        GeometryData;                                      // 0x02C8(0x0050)(NativeAccessSpecifierPrivate)
	TMap<int32, double>                           SurfaceAreas;                                      // 0x0318(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_368[0x58];                                     // 0x0368(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ConvertMesh();
	void RemoveGeometry();
	void SendGeometry();
	void UpdateGeometry();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkGeometryComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkGeometryComponent")
	}
	static class UAkGeometryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkGeometryComponent>();
	}
};
DUMPER7_ASSERTS_UAkGeometryComponent;

// Class AkAudio.AkHololensInitializationSettings
// 0x00F8 (0x0128 - 0x0030)
class UAkHololensInitializationSettings final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkCommonInitializationSettingsWithSampleRate CommonSettings;                             // 0x0038(0x0078)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkCommunicationSettingsWithSystemInitialization CommunicationSettings;                   // 0x00B0(0x0020)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkHololensAdvancedInitializationSettings AdvancedSettings;                               // 0x00D0(0x0054)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MigrateMultiCoreRendering(bool NewValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkHololensInitializationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkHololensInitializationSettings")
	}
	static class UAkHololensInitializationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkHololensInitializationSettings>();
	}
};
DUMPER7_ASSERTS_UAkHololensInitializationSettings;

// Class AkAudio.AkHololensPlatformInfo
// 0x0000 (0x0078 - 0x0078)
class UAkHololensPlatformInfo final : public UAkPlatformInfo
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkHololensPlatformInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkHololensPlatformInfo")
	}
	static class UAkHololensPlatformInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkHololensPlatformInfo>();
	}
};
DUMPER7_ASSERTS_UAkHololensPlatformInfo;

// Class AkAudio.AkInitBank
// 0x0050 (0x00A8 - 0x0058)
class UAkInitBank final : public UAkAudioType
{
public:
	struct FWwiseInitBankCookedData               InitBankCookedData;                                // 0x0058(0x0048)(Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkInitBank")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkInitBank")
	}
	static class UAkInitBank* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkInitBank>();
	}
};
DUMPER7_ASSERTS_UAkInitBank;

// Class AkAudio.AkIOSInitializationSettings
// 0x0100 (0x0130 - 0x0030)
class UAkIOSInitializationSettings final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkCommonInitializationSettingsWithSampleRate CommonSettings;                             // 0x0038(0x0078)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkAudioSession                        AudioSession;                                      // 0x00B0(0x000C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkCommunicationSettingsWithSystemInitialization CommunicationSettings;                   // 0x00C0(0x0020)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings;                 // 0x00E0(0x0050)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkIOSInitializationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkIOSInitializationSettings")
	}
	static class UAkIOSInitializationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkIOSInitializationSettings>();
	}
};
DUMPER7_ASSERTS_UAkIOSInitializationSettings;

// Class AkAudio.AkIOSPlatformInfo
// 0x0000 (0x0078 - 0x0078)
class UAkIOSPlatformInfo final : public UAkPlatformInfo
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkIOSPlatformInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkIOSPlatformInfo")
	}
	static class UAkIOSPlatformInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkIOSPlatformInfo>();
	}
};
DUMPER7_ASSERTS_UAkIOSPlatformInfo;

// Class AkAudio.AkItemBoolPropertiesConv
// 0x0000 (0x0030 - 0x0030)
class UAkItemBoolPropertiesConv final : public UBlueprintFunctionLibrary
{
public:
	static class FString Conv_FAkBoolPropertyToControlToString(const struct FAkBoolPropertyToControl& INAkBoolPropertyToControl);
	static class FText Conv_FAkBoolPropertyToControlToText(const struct FAkBoolPropertyToControl& INAkBoolPropertyToControl);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkItemBoolPropertiesConv")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkItemBoolPropertiesConv")
	}
	static class UAkItemBoolPropertiesConv* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkItemBoolPropertiesConv>();
	}
};
DUMPER7_ASSERTS_UAkItemBoolPropertiesConv;

// Class AkAudio.AkItemBoolProperties
// 0x0040 (0x01B0 - 0x0170)
class UAkItemBoolProperties final : public UWidget
{
public:
	TMulticastInlineDelegate<void(const class FString& PropertySelected)> OnSelectionChanged;        // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& PropertyDragged)> OnPropertyDragged;          // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_190[0x20];                                     // 0x0190(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetSearchText(const class FString& newText);

	class FString GetSearchText() const;
	class FString GetSelectedProperty() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkItemBoolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkItemBoolProperties")
	}
	static class UAkItemBoolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkItemBoolProperties>();
	}
};
DUMPER7_ASSERTS_UAkItemBoolProperties;

