#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotifyEffect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimNotifyEffect.AnimNotifyEffect_C.K2_ValidateAssets
// 0x0001 (0x0001 - 0x0000)
struct AnimNotifyEffect_C_K2_ValidateAssets final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_AnimNotifyEffect_C_K2_ValidateAssets;

// Function AnimNotifyEffect.AnimNotifyEffect_C.K2_Notify
// 0x0018 (0x0018 - 0x0000)
struct AnimNotifyEffect_C_K2_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_AnimNotifyEffect_C_K2_Notify;

// Function AnimNotifyEffect.AnimNotifyEffect_C.K2_PostChangeProperty
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyEffect_C_K2_PostChangeProperty final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_AnimNotifyEffect_C_K2_PostChangeProperty;

// Function AnimNotifyEffect.AnimNotifyEffect_C.TraceDetectClimbStep
// 0x0060 (0x0060 - 0x0000)
struct AnimNotifyEffect_C_TraceDetectClimbStep final
{
public:
	class ATsBaseCharacter_C*                     outer1;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       outTrans1;                                         // 0x0010(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_AnimNotifyEffect_C_TraceDetectClimbStep;

// Function AnimNotifyEffect.AnimNotifyEffect_C.IsDisablePostProcess
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyEffect_C_IsDisablePostProcess final
{
public:
	class USkeletalMeshComponent*                 meshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_AnimNotifyEffect_C_IsDisablePostProcess;

// Function AnimNotifyEffect.AnimNotifyEffect_C.AttachEffectAndSetupTransform
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyEffect_C_AttachEffectAndSetupTransform final
{
public:
	class AActor*                                 outer;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         effectHandle;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AnimNotifyEffect_C_AttachEffectAndSetupTransform;

// Function AnimNotifyEffect.AnimNotifyEffect_C.GetNotifyName
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyEffect_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AnimNotifyEffect_C_GetNotifyName;

}

