#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ABPC_Seq_FunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ABPC_Seq_FunctionLibrary.BP_ABPC_Seq_FunctionLibrary_C.ABPC_Seq_GetPhyValue
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue final
{
public:
	class UAnimInstance*                          AnimIns;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Phy;                                               // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         物理模拟权重;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue_1;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASkeletalMeshActor*                     K2Node_DynamicCast_As_____actor;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetActiveCurveNames_OutNames;             // 0x0050(0x0010)(ReferenceParm)
	TScriptInterface<class IABPC_Seq_Interface_C> K2Node_DynamicCast_AsABPC_Seq_Interface;           // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UABPC_Seq_Body_V2_C*                    CallFunc_GetABPC_Body_V2_ABPC_Body_V2;             // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_1;                                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue) == 0x000008, "Wrong alignment on BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue");
static_assert(sizeof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue) == 0x0000A8, "Wrong size on BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, AnimIns) == 0x000000, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::AnimIns' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, __WorldContext) == 0x000008, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, Value) == 0x000010, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::Value' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, Phy) == 0x000014, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::Phy' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, 物理模拟权重) == 0x000018, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::物理模拟权重' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, ___bool_Variable) == 0x00001C, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::___bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_GetCurveValue_ReturnValue) == 0x000020, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_GetOuterObject_ReturnValue) == 0x000028, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_GetOuterObject_ReturnValue_1) == 0x000030, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_GetOuterObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, K2Node_DynamicCast_As_____actor) == 0x000038, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::K2Node_DynamicCast_As_____actor' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000048, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_GetActiveCurveNames_OutNames) == 0x000050, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_GetActiveCurveNames_OutNames' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, K2Node_DynamicCast_AsABPC_Seq_Interface) == 0x000060, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::K2Node_DynamicCast_AsABPC_Seq_Interface' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_GetABPC_Body_V2_ABPC_Body_V2) == 0x000078, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_GetABPC_Body_V2_ABPC_Body_V2' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, ___bool_Variable_1) == 0x000081, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_MakeLiteralName_ReturnValue) == 0x000084, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_Array_Find_ReturnValue) == 0x000090, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_FClamp_ReturnValue) == 0x000094, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000098, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_Less_FloatFloat_ReturnValue) == 0x000099, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_GetCurveValue_ReturnValue_1) == 0x00009C, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, K2Node_Select_Default) == 0x0000A0, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A4, "Member 'BP_ABPC_Seq_FunctionLibrary_C_ABPC_Seq_GetPhyValue::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

