#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseRole_Seq_V2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BaseRole_Seq_V2.BP_BaseRole_Seq_V2_C
// 0x00F8 (0x0408 - 0x0310)
class ABP_BaseRole_Seq_V2_C : public APawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USeqAudio_Seq_V2_C*                     SeqAudio_Seq_V2;                                   // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Hulu;                                              // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UABPC_Seq_Body_V2_C*                    ABPC_Body_V2;                                      // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMeshComponent0;                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         TalkID;                                            // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	class FName                                   BindingTag;                                        // 0x0344(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HuluFX_Handle;                                     // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CharFX_Group_Handle;                               // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CharFX_Handle;                                     // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPD_CharacterControllerDataGroup_C*     DataGroup;                                         // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	class UPD_CharacterControllerData_C*          Data;                                              // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	class ABP_Fx_Scanning_C*                      BPScanning;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharRenderingComponent_C*              CharRenderingComponent;                            // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TalkID_SP;                                         // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableKeyLightChan;                                // 0x0384(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ToonLightChan0;                                    // 0x0385(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ToonLightChan1;                                    // 0x0386(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ToonLightChan2;                                    // 0x0387(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	TMap<class FName, struct FTransform>          CustomData;                                        // 0x0388(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class USkeletalMesh>           MeshRef;                                           // 0x03D8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BaseRole_Seq_V2(int32 EntryPoint);
	void ReceiveDestroyed();
	void UserConstructionScript();
	void JumpFrame();
	void BeginSwitchPose(class AActor* From, class AActor* To, float SwitchTime, bool ErrorLog);
	void EndSwitchPose(class AActor* To, bool Log);
	void SwitchMeshTransform(bool LevelA);
	void ChangeHuluState(int32 State);
	void CleanHuluState();
	void 添加角色材质控制器组();
	void 卸载角色材质控制器组();
	void 添加角色材质控制器();
	void 卸载角色材质控制器();
	void 添加扫描效果();
	void Begin_Switch_Pose_to_Seq(class AActor* From, class AActor* To, float SwitchTime, bool ErrorLog);
	void BeginSwitchPose_ToBP(class AActor* From, class AActor* To, float SwitchTime, bool ErrorLog);
	void EndSwitchPose_ToSeq(class AActor* To, bool Log);
	void EndSwitchPose_ToBP(class AActor* To, bool Log);
	void LightChanel();
	void GetABPC_Body_V2(class UABPC_Seq_Body_V2_C** ABPC_Body_V2_0);
	bool SetAnimDataVector(const TMap<class FName, struct FVector>& VectorCurveData);
	bool SetAnimDataFloat(const TArray<struct FNamedCurveValue>& FloatCurveData);
	bool GetAnimDataVector(TMap<class FName, struct FVector>* VectorCurveData);
	bool GetAnimDataFloat(TArray<struct FNamedCurveValue>* FloatCurveData);
	TArray<class FName> GetSupportGroupNames();
	bool SetAnimDataTransform(const TMap<class FName, struct FTransform>& FloatCurveData);
	bool IsCustomSupport();
	bool GetAnimDataTransform(TMap<class FName, struct FTransform>* FloatCurveData);
	void GetSeqAudio(class USeqAudio_Seq_V2_C** SeqAudio);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BaseRole_Seq_V2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BaseRole_Seq_V2_C")
	}
	static class ABP_BaseRole_Seq_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseRole_Seq_V2_C>();
	}
};
DUMPER7_ASSERTS_ABP_BaseRole_Seq_V2_C;

}

