#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Clouds

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"
#include "Engine_structs.hpp"
#include "E_Cloud_Presents_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Clouds.BP_Clouds_C
// 0x00B0 (0x0468 - 0x03B8)
class ABP_Clouds_C final : public AKuroCloudsActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   Cloud02;                                           // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Cloud01;                                           // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_Cloud_Presents                              当前云预设_不要改_;                                // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPD_CloudPreset_C*                      CloudData;                                         // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Counting;                                          // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_Cloud_Presents                              默认进入云预设;                                    // 0x03E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPD_CloudPrefab_C>       CloudAsset;                                        // 0x03F0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<int32>                                 SortNumber;                                        // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPD_CloudPrefab_C*                      As_PD_Cloud_Prefab;                                // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CachedAudioEvent2D;                                // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkyOcean;                                        // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          SkyOceanAudio;                                     // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Override_Cloud_Rotation;                           // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Cloud_Speed;                                       // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cloud_Offset;                                      // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReversed_;                                       // 0x045C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45D[0x3];                                      // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReversedZHeightBias;                               // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroFeatureLevel                             FeatureLevel;                                      // 0x0464(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Clouds(int32 EntryPoint);
	void LoadAndSwitch(TSoftObjectPtr<class UObject> Asset, float ChangeSpeed, bool IsInEditor, bool IsAudio);
	void Switch_Clouds(E_Cloud_Presents CloudPresents, float ChangeSpeed, bool IsInEditor, bool bOverrideCloudRotation, float CloudSpeed, float CloudOffset);
	void ChangeCloud();
	void EditorTick(float DeltaSeconds);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnLoaded_63FE5E2B437AFAD504FBCAB26242EB8A(class UObject* Loaded);
	void UserConstructionScript();
	void Zero1天城();
	void Zero2遗落原乡();
	void Zero3无光之森();
	void Zero1登录界面();
	void Zero2无音区沉寂态();
	void Zero3无音区01();
	void SwitchCloudsSub(class UPD_CloudPrefab_C* CloudPresents, float ChangeSpeed);
	void Hidden_Old();
	void Zero4中曲台地();
	void SetCloudParameters(class UPD_CloudPrefab_C* CloudPrefeb, class UChildActorComponent* CloudActorComponent, float ChangeSpeed, int32 TransSortNumber);
	void 原画测试用云();
	void Zero4无音区02();
	void Zero5无音区03();
	void Zero6无音区04();
	void Zero7无音区05();
	void Zero8漩涡云01();
	void Zero9鸣潮天气();
	void Zero10阴天异象();
	void Zero11黄昏异象();
	void Zero12夜晚异象();
	void Zero13乘宵山异象();
	void Zero5怨鸟泽();
	void Zero6乘宵山();
	void Get_GIParams(float CurTime);
	void Zero7黑海岸上层();
	void Zero8黑海岸下层();
	void Zero14黑海岸夜晚();
	void Zero15肉鸽月亮01();
	void Zero16肉鸽月亮02();
	void Zero17肉鸽月亮03();
	void Zero18肉鸽月亮04();
	void Zero19肉鸽月亮05();
	void Zero20黑海岸天气_阴();
	void Zero1_黎娜汐塔();
	void Zero2_帕尔米罗墓地();
	void Zero1_槲生半岛();
	void Zero2_狄萨莱海脊永夜解密前();
	void Zero3_狄萨莱海脊永夜解密后();
	void Zero4_金库上层();
	void 开启云跟随摄像机移动();
	void 关闭云跟随摄像机移动();
	void 显示云移动范围();
	void Zero5_狂欢节();
	void Zero3_槲生半岛解密后();
	void Zero4_云海区();
	void Zero6_黎娜夕塔阴();
	void Zero5_罗墓岛夜晚();
	void Zero6_金库上解密后();
	void Zero7_费洛洛出场();
	void CloudMainParamsUpdate();
	void Zero8_彩虹天气();
	void Zero9_颠倒塔白天();
	void One0_颠倒塔夜晚();
	void One1_颠倒塔流星();
	void Zero7_七丘();
	void Zero8_初见七丘();
	void Zero9_七丘阴天();
	void One0_残破竞技场();
	void One1_尖刺山();
	void One2_观测塔();
	void One3_七丘夜晚();
	void One4_狄斯台地白天();
	void One5_狄斯台地夜晚();
	void One6_狄斯台地日月同辉();
	void One7_狄斯台地烈日天空();
	void One8_狄斯台地受蚀地();
	void One9_狄斯台地月相();
	void One2_黑潮侵蚀();
	void One3_黑潮内表世界();
	void One4_黑潮内里世界();
	void One5_光路幻境();
	void One6_巡游天国();
	void One7_隐海试验场();
	void One8_失亡彼岸();
	void One9_黑潮风暴();
	void Two0_黑潮风暴加强();
	void Two1_烈阳天气();
	void Two1_总督日月同辉();
	void Two0_穗波白天();
	void Two1_穗波夜晚();
	void Two2_穗波枯山水();
	void Two3_穗波阴天();
	void Two2_安全点白天();
	void Two3_安全点夜晚();
	void Zero1_拉海落白天();
	void Zero2_拉海洛夜晚();
	void Zero3_磁暴前置();
	void Zero4_磁暴后置();
	void Zero5_星门Boss();
	void Zero6_坠落炉芯();
	void Zero7_炉芯内部();
	void Zero8_炉芯领主();
	void Zero9_浮光林白天();
	void One0_浮光林夜晚();
	void One1_拉海洛阴天();
	void One2_梵高();
	void Two4_不渲染BP_Cloud控制的云();
	void One3_罗伊白天();
	void One4_罗伊夜晚();
	void One5_罗伊极光();
	void One6_罗伊初见();
	void One7_星海BOSS一阶();
	void One8_星海BOSS三阶();
	void One9_拉海洛初见();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Clouds_C">();
	}
	static class ABP_Clouds_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Clouds_C>();
	}
};
static_assert(alignof(ABP_Clouds_C) == 0x000008, "Wrong alignment on ABP_Clouds_C");
static_assert(sizeof(ABP_Clouds_C) == 0x000468, "Wrong size on ABP_Clouds_C");
static_assert(offsetof(ABP_Clouds_C, UberGraphFrame) == 0x0003B8, "Member 'ABP_Clouds_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, Cloud02) == 0x0003C0, "Member 'ABP_Clouds_C::Cloud02' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, Cloud01) == 0x0003C8, "Member 'ABP_Clouds_C::Cloud01' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, DefaultSceneRoot) == 0x0003D0, "Member 'ABP_Clouds_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, 当前云预设_不要改_) == 0x0003D8, "Member 'ABP_Clouds_C::当前云预设_不要改_' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, CloudData) == 0x0003E0, "Member 'ABP_Clouds_C::CloudData' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, Counting) == 0x0003E8, "Member 'ABP_Clouds_C::Counting' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, 默认进入云预设) == 0x0003E9, "Member 'ABP_Clouds_C::默认进入云预设' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, CloudAsset) == 0x0003F0, "Member 'ABP_Clouds_C::CloudAsset' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, SortNumber) == 0x000420, "Member 'ABP_Clouds_C::SortNumber' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, As_PD_Cloud_Prefab) == 0x000430, "Member 'ABP_Clouds_C::As_PD_Cloud_Prefab' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, CachedAudioEvent2D) == 0x000438, "Member 'ABP_Clouds_C::CachedAudioEvent2D' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, IsSkyOcean) == 0x000440, "Member 'ABP_Clouds_C::IsSkyOcean' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, SkyOceanAudio) == 0x000448, "Member 'ABP_Clouds_C::SkyOceanAudio' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, Override_Cloud_Rotation) == 0x000450, "Member 'ABP_Clouds_C::Override_Cloud_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, Cloud_Speed) == 0x000454, "Member 'ABP_Clouds_C::Cloud_Speed' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, Cloud_Offset) == 0x000458, "Member 'ABP_Clouds_C::Cloud_Offset' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, IsReversed_) == 0x00045C, "Member 'ABP_Clouds_C::IsReversed_' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, ReversedZHeightBias) == 0x000460, "Member 'ABP_Clouds_C::ReversedZHeightBias' has a wrong offset!");
static_assert(offsetof(ABP_Clouds_C, FeatureLevel) == 0x000464, "Member 'ABP_Clouds_C::FeatureLevel' has a wrong offset!");

}

