#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Clouds

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_Cloud_Presents_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Clouds.BP_Clouds_C
// 0x00B0 (0x0478 - 0x03C8)
class ABP_Clouds_C final : public AKuroCloudsActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   Cloud02;                                           // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Cloud01;                                           // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_Cloud_Presents                              当前云预设_不要改_;                                // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPD_CloudPreset_C*                      CloudData;                                         // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Counting;                                          // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_Cloud_Presents                              默认进入云预设;                                    // 0x03F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPD_CloudPrefab_C>       CloudAsset;                                        // 0x0400(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<int32>                                 SortNumber;                                        // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPD_CloudPrefab_C*                      As_PD_Cloud_Prefab;                                // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CachedAudioEvent2D;                                // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkyOcean;                                        // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          SkyOceanAudio;                                     // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Override_Cloud_Rotation;                           // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Cloud_Speed;                                       // 0x0464(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cloud_Offset;                                      // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReversed_;                                       // 0x046C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46D[0x3];                                      // 0x046D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReversedZHeightBias;                               // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroFeatureLevel                             FeatureLevel;                                      // 0x0474(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Clouds(int32 EntryPoint);
	void LoadAndSwitch(TSoftObjectPtr<class UObject> Asset, float ChangeSpeed, bool IsInEditor, bool IsAudio);
	void Switch_Clouds(E_Cloud_Presents CloudPresents, float ChangeSpeed, bool IsInEditor, bool bOverrideCloudRotation, float CloudSpeed, float CloudOffset);
	void ChangeCloud();
	void EditorTick(float DeltaSeconds);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnLoaded_63FE5E2B437AFAD504FBCAB26242EB8A(class UObject* Loaded);
	void UserConstructionScript();
	void Zero1天城();
	void Zero2遗落原乡();
	void Zero3无光之森();
	void Zero1登录界面();
	void Zero2无音区沉寂态();
	void Zero3无音区01();
	void SwitchCloudsSub(class UPD_CloudPrefab_C* CloudPresents, float ChangeSpeed);
	void Hidden_Old();
	void Zero4中曲台地();
	void SetCloudParameters(class UPD_CloudPrefab_C* CloudPrefeb, class UChildActorComponent* CloudActorComponent, float ChangeSpeed, int32 TransSortNumber);
	void 原画测试用云();
	void Zero4无音区02();
	void Zero5无音区03();
	void Zero6无音区04();
	void Zero7无音区05();
	void Zero8漩涡云01();
	void Zero9鸣潮天气();
	void Zero10阴天异象();
	void Zero11黄昏异象();
	void Zero12夜晚异象();
	void Zero13乘宵山异象();
	void Zero5怨鸟泽();
	void Zero6乘宵山();
	void Get_GIParams(float CurTime);
	void Zero7黑海岸上层();
	void Zero8黑海岸下层();
	void Zero14黑海岸夜晚();
	void Zero15肉鸽月亮01();
	void Zero16肉鸽月亮02();
	void Zero17肉鸽月亮03();
	void Zero18肉鸽月亮04();
	void Zero19肉鸽月亮05();
	void Zero20黑海岸天气_阴();
	void Zero1_黎娜汐塔();
	void Zero2_帕尔米罗墓地();
	void Zero1_槲生半岛();
	void Zero2_狄萨莱海脊永夜解密前();
	void Zero3_狄萨莱海脊永夜解密后();
	void Zero4_金库上层();
	void 开启云跟随摄像机移动();
	void 关闭云跟随摄像机移动();
	void 显示云移动范围();
	void Zero5_狂欢节();
	void Zero3_槲生半岛解密后();
	void Zero4_云海区();
	void Zero6_黎娜夕塔阴();
	void Zero5_罗墓岛夜晚();
	void Zero6_金库上解密后();
	void Zero7_费洛洛出场();
	void CloudMainParamsUpdate();
	void Zero8_彩虹天气();
	void Zero9_颠倒塔白天();
	void One0_颠倒塔夜晚();
	void One1_颠倒塔流星();
	void Zero7_七丘();
	void Zero8_初见七丘();
	void Zero9_七丘阴天();
	void One0_残破竞技场();
	void One1_尖刺山();
	void One2_观测塔();
	void One3_七丘夜晚();
	void One4_狄斯台地白天();
	void One5_狄斯台地夜晚();
	void One6_狄斯台地日月同辉();
	void One7_狄斯台地烈日天空();
	void One8_狄斯台地受蚀地();
	void One9_狄斯台地月相();
	void One2_黑潮侵蚀();
	void One3_黑潮内表世界();
	void One4_黑潮内里世界();
	void One5_光路幻境();
	void One6_巡游天国();
	void One7_隐海试验场();
	void One8_失亡彼岸();
	void One9_黑潮风暴();
	void Two0_黑潮风暴加强();
	void Two1_烈阳天气();
	void Two1_总督日月同辉();
	void Two0_穗波白天();
	void Two1_穗波夜晚();
	void Two2_穗波枯山水();
	void Two3_穗波阴天();
	void Two2_安全点白天();
	void Two3_安全点夜晚();
	void Zero1_拉海落白天();
	void Zero2_拉海洛夜晚();
	void Zero3_磁暴前置();
	void Zero4_磁暴后置();
	void Zero5_星门Boss();
	void Zero6_坠落炉芯();
	void Zero7_炉芯内部();
	void Zero8_炉芯领主();
	void Zero9_浮光林白天();
	void One0_浮光林夜晚();
	void One1_拉海洛阴天();
	void One2_梵高();
	void Two4_不渲染BP_Cloud控制的云();
	void One3_罗伊白天();
	void One4_罗伊夜晚();
	void One5_罗伊极光();
	void One6_罗伊初见();
	void One7_星海BOSS一阶();
	void One8_星海BOSS三阶();
	void One9_拉海洛初见();
	void Two0_日灵棺解密前();
	void Two1_日灵棺解密后();
	void Two2_高达Boss一阶();
	void Two3_高达Boss三阶();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Clouds_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Clouds_C")
	}
	static class ABP_Clouds_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Clouds_C>();
	}
};
DUMPER7_ASSERTS_ABP_Clouds_C;

}

