#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CrowdAiBoidActorSystemBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CrowdAiBoidActorSystemBase.BP_CrowdAiBoidActorSystemBase_C.InitGpuNpc
// 0x0020 (0x0020 - 0x0000)
struct BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBakedBoneMeshComponent*                CallFunc_GetBakedBoneMeshComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBakedBoneMeshInstanceGroup*            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitGpuNpc_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc;

}

