#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CrowdAiBoidActorSystemBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CrowdAiBoidActorSystemBase.BP_CrowdAiBoidActorSystemBase_C.InitGpuNpc
// 0x0020 (0x0020 - 0x0000)
struct BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBakedBoneMeshComponent*                CallFunc_GetBakedBoneMeshComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBakedBoneMeshInstanceGroup*            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitGpuNpc_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc) == 0x000008, "Wrong alignment on BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc");
static_assert(sizeof(BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc) == 0x000020, "Wrong size on BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc");
static_assert(offsetof(BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc, ReturnValue) == 0x000000, "Member 'BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc, CallFunc_GetBakedBoneMeshComponent_ReturnValue) == 0x000008, "Member 'BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc::CallFunc_GetBakedBoneMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc, CallFunc_InitGpuNpc_ReturnValue) == 0x000018, "Member 'BP_CrowdAiBoidActorSystemBase_C_InitGpuNpc::CallFunc_InitGpuNpc_ReturnValue' has a wrong offset!");

}

