#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraDrivenAutoFlightData

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CameraDrivenAutoFlightData.BP_CameraDrivenAutoFlightData_C
// 0x0020 (0x0058 - 0x0038)
class UBP_CameraDrivenAutoFlightData_C final : public UPrimaryDataAsset
{
public:
	float                                         自动驾驶开始时间;                                  // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         自动驾驶启动输入;                                  // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         自动驾驶完成角度;                                  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         自动驾驶归正角度Min;                               // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         自动驾驶归正角度Max;                               // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         自动驾驶归正角度模拟输入Min;                       // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         自动驾驶归正角度模拟输入Max;                       // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CameraDrivenAutoFlightData_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CameraDrivenAutoFlightData_C")
	}
	static class UBP_CameraDrivenAutoFlightData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CameraDrivenAutoFlightData_C>();
	}
};
DUMPER7_ASSERTS_UBP_CameraDrivenAutoFlightData_C;

}

