#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CrowdAiConfig

#include "Basic.hpp"

#include "BP_Struct_CrowdAiBoidConfig_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CrowdAiConfig.BP_CrowdAiConfig_C
// 0x0078 (0x00B0 - 0x0038)
class UBP_CrowdAiConfig_C final : public UPrimaryDataAsset
{
public:
	bool                                          启用Navmesh贴地修正;                               // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         分组最大距离;                                      // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBP_Struct_CrowdAiBoidConfig>   Boid种类配置;                                      // 0x0040(0x0010)(Edit, BlueprintVisible)
	bool                                          启用传送;                                          // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         传送最小计数时间;                                  // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         传送最大计数时间;                                  // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         传送目标最大半径;                                  // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         传送目标最小半径;                                  // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         玩家移动半径;                                      // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         玩家待机半径;                                      // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         玩家半径变化时间;                                  // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          启用跟随区域限制;                                  // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         停驻最小目标距离;                                  // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         触发传送最小垂直距离;                              // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         触发传送最小水平距离;                              // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         暂停传送最大水平速度;                              // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         最大尝试寻点次数;                                  // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         跟随扇形区域夹角;                                  // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         跟随扇形区域两边长度;                              // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         跟随扇形区域底边半长;                              // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         跟随扇形区域底边距离;                              // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         停驻计时时间;                                      // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         停驻最大速度;                                      // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         出生最大随机延迟时间;                              // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         销毁最大随机延迟时间;                              // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         组寻路间隔;                                        // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CrowdAiConfig_C">();
	}
	static class UBP_CrowdAiConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CrowdAiConfig_C>();
	}
};
static_assert(alignof(UBP_CrowdAiConfig_C) == 0x000008, "Wrong alignment on UBP_CrowdAiConfig_C");
static_assert(sizeof(UBP_CrowdAiConfig_C) == 0x0000B0, "Wrong size on UBP_CrowdAiConfig_C");
static_assert(offsetof(UBP_CrowdAiConfig_C, 启用Navmesh贴地修正) == 0x000038, "Member 'UBP_CrowdAiConfig_C::启用Navmesh贴地修正' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 分组最大距离) == 0x00003C, "Member 'UBP_CrowdAiConfig_C::分组最大距离' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, Boid种类配置) == 0x000040, "Member 'UBP_CrowdAiConfig_C::Boid种类配置' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 启用传送) == 0x000050, "Member 'UBP_CrowdAiConfig_C::启用传送' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 传送最小计数时间) == 0x000054, "Member 'UBP_CrowdAiConfig_C::传送最小计数时间' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 传送最大计数时间) == 0x000058, "Member 'UBP_CrowdAiConfig_C::传送最大计数时间' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 传送目标最大半径) == 0x00005C, "Member 'UBP_CrowdAiConfig_C::传送目标最大半径' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 传送目标最小半径) == 0x000060, "Member 'UBP_CrowdAiConfig_C::传送目标最小半径' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 玩家移动半径) == 0x000064, "Member 'UBP_CrowdAiConfig_C::玩家移动半径' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 玩家待机半径) == 0x000068, "Member 'UBP_CrowdAiConfig_C::玩家待机半径' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 玩家半径变化时间) == 0x00006C, "Member 'UBP_CrowdAiConfig_C::玩家半径变化时间' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 启用跟随区域限制) == 0x000070, "Member 'UBP_CrowdAiConfig_C::启用跟随区域限制' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 停驻最小目标距离) == 0x000074, "Member 'UBP_CrowdAiConfig_C::停驻最小目标距离' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 触发传送最小垂直距离) == 0x000078, "Member 'UBP_CrowdAiConfig_C::触发传送最小垂直距离' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 触发传送最小水平距离) == 0x00007C, "Member 'UBP_CrowdAiConfig_C::触发传送最小水平距离' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 暂停传送最大水平速度) == 0x000080, "Member 'UBP_CrowdAiConfig_C::暂停传送最大水平速度' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 最大尝试寻点次数) == 0x000084, "Member 'UBP_CrowdAiConfig_C::最大尝试寻点次数' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 跟随扇形区域夹角) == 0x000088, "Member 'UBP_CrowdAiConfig_C::跟随扇形区域夹角' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 跟随扇形区域两边长度) == 0x00008C, "Member 'UBP_CrowdAiConfig_C::跟随扇形区域两边长度' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 跟随扇形区域底边半长) == 0x000090, "Member 'UBP_CrowdAiConfig_C::跟随扇形区域底边半长' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 跟随扇形区域底边距离) == 0x000094, "Member 'UBP_CrowdAiConfig_C::跟随扇形区域底边距离' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 停驻计时时间) == 0x000098, "Member 'UBP_CrowdAiConfig_C::停驻计时时间' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 停驻最大速度) == 0x00009C, "Member 'UBP_CrowdAiConfig_C::停驻最大速度' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 出生最大随机延迟时间) == 0x0000A0, "Member 'UBP_CrowdAiConfig_C::出生最大随机延迟时间' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 销毁最大随机延迟时间) == 0x0000A4, "Member 'UBP_CrowdAiConfig_C::销毁最大随机延迟时间' has a wrong offset!");
static_assert(offsetof(UBP_CrowdAiConfig_C, 组寻路间隔) == 0x0000A8, "Member 'UBP_CrowdAiConfig_C::组寻路间隔' has a wrong offset!");

}

