#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CurveTrailSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CurveTrailSpawner.BP_CurveTrailSpawner_C
// 0x0018 (0x02E0 - 0x02C8)
class ABP_CurveTrailSpawner_C final : public AKuroCurveTrailDecalSpawner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Position;                                          // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_CurveTrailSpawner(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CurveTrailSpawner_C">();
	}
	static class ABP_CurveTrailSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CurveTrailSpawner_C>();
	}
};
static_assert(alignof(ABP_CurveTrailSpawner_C) == 0x000008, "Wrong alignment on ABP_CurveTrailSpawner_C");
static_assert(sizeof(ABP_CurveTrailSpawner_C) == 0x0002E0, "Wrong size on ABP_CurveTrailSpawner_C");
static_assert(offsetof(ABP_CurveTrailSpawner_C, UberGraphFrame) == 0x0002C8, "Member 'ABP_CurveTrailSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CurveTrailSpawner_C, Billboard) == 0x0002D0, "Member 'ABP_CurveTrailSpawner_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_CurveTrailSpawner_C, Position) == 0x0002D8, "Member 'ABP_CurveTrailSpawner_C::Position' has a wrong offset!");

}

