#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CloudFuBenNew

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"
#include "KuroCurve_structs.hpp"
#include "Engine_structs.hpp"
#include "E_Cloud_Presents_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CloudFuBenNew.BP_CloudFuBenNew_C
// 0x0150 (0x0508 - 0x03B8)
class ABP_CloudFuBenNew_C final : public AKuroCloudsActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   Cloud2;                                            // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Cloud1;                                            // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableSequence;                                    // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          CoverOffsetParameters;                             // 0x03D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DA[0x2];                                      // 0x03DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Cloud_Speed;                                       // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cloud_Offset;                                      // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPD_CloudPreset_C*                      CloudData;                                         // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Sky_Ocean;                                      // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPD_CloudPrefab_C>       CloudAsset;                                        // 0x03F8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UPD_CloudPrefab_C*                      As_PD_Cloud_Prefab;                                // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          SkyOceanAudio;                                     // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 SortNumber;                                        // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Counting;                                          // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EKuroFeatureLevel                             FeatureLevel;                                      // 0x0449(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Cloud_Presents                              当前云;                                            // 0x044A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Reversed;                                       // 0x044B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Reversed_ZHeight_Bias;                             // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Cloud_Presents                              待切换云;                                          // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          CoverNoiseParameters;                              // 0x0451(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EnableChange;                                      // 0x0452(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor)
	uint8                                         Pad_453[0x1];                                      // 0x0453(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Time;                                              // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Noise_Speed;                                       // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Noise_Strength;                                    // 0x045C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NoiseTiling;                                       // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroCurveFloat                        ProgressCurve;                                     // 0x0468(0x0090)(Edit, BlueprintVisible)
	float                                         TotalChangeTime;                                   // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurveTime;                                         // 0x04FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanChange;                                         // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          First;                                             // 0x0501(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_CloudFuBenNew(int32 EntryPoint);
	void Change_Cloud_Play();
	void Change_Cloud_Editor();
	void EditorTick(float DeltaSeconds);
	void LoadAndSwitch(TSoftObjectPtr<class UObject> Asset, float ChangeSpeed, bool IsInEditor, bool IsAudio);
	void Switch_Clouds(E_Cloud_Presents CloudPresents, float ChangeSpeed, bool IsInEditor, bool bOverrideCloudRotation);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnLoaded_B83844664BD317A13AA3988948C763B1(class UObject* Loaded);
	void Hide_BPCloudFuBen_Check(E_Cloud_Presents In_Type);
	void Switch_Clouds_Sub(class UPD_CloudPrefab_C* CloudPresents, float ChangeSpeed);
	void Set_Cloud_Parameters(class UPD_CloudPrefab_C* CloudPrefab, class UChildActorComponent* CloudActorComponent, float ChangeSpeed, int32 TransSortNumber);
	void Cloud_Main_Params_Update();
	void 编辑器下切换();
	void Change_Start();
	void Timer(float DeltaTime);
	void HiddenOld();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CloudFuBenNew_C">();
	}
	static class ABP_CloudFuBenNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CloudFuBenNew_C>();
	}
};
static_assert(alignof(ABP_CloudFuBenNew_C) == 0x000008, "Wrong alignment on ABP_CloudFuBenNew_C");
static_assert(sizeof(ABP_CloudFuBenNew_C) == 0x000508, "Wrong size on ABP_CloudFuBenNew_C");
static_assert(offsetof(ABP_CloudFuBenNew_C, UberGraphFrame) == 0x0003B8, "Member 'ABP_CloudFuBenNew_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, Cloud2) == 0x0003C0, "Member 'ABP_CloudFuBenNew_C::Cloud2' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, Cloud1) == 0x0003C8, "Member 'ABP_CloudFuBenNew_C::Cloud1' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, DefaultSceneRoot) == 0x0003D0, "Member 'ABP_CloudFuBenNew_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, EnableSequence) == 0x0003D8, "Member 'ABP_CloudFuBenNew_C::EnableSequence' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, CoverOffsetParameters) == 0x0003D9, "Member 'ABP_CloudFuBenNew_C::CoverOffsetParameters' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, Cloud_Speed) == 0x0003DC, "Member 'ABP_CloudFuBenNew_C::Cloud_Speed' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, Cloud_Offset) == 0x0003E0, "Member 'ABP_CloudFuBenNew_C::Cloud_Offset' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, CloudData) == 0x0003E8, "Member 'ABP_CloudFuBenNew_C::CloudData' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, Is_Sky_Ocean) == 0x0003F0, "Member 'ABP_CloudFuBenNew_C::Is_Sky_Ocean' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, CloudAsset) == 0x0003F8, "Member 'ABP_CloudFuBenNew_C::CloudAsset' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, As_PD_Cloud_Prefab) == 0x000428, "Member 'ABP_CloudFuBenNew_C::As_PD_Cloud_Prefab' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, SkyOceanAudio) == 0x000430, "Member 'ABP_CloudFuBenNew_C::SkyOceanAudio' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, SortNumber) == 0x000438, "Member 'ABP_CloudFuBenNew_C::SortNumber' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, Counting) == 0x000448, "Member 'ABP_CloudFuBenNew_C::Counting' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, FeatureLevel) == 0x000449, "Member 'ABP_CloudFuBenNew_C::FeatureLevel' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, 当前云) == 0x00044A, "Member 'ABP_CloudFuBenNew_C::当前云' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, Is_Reversed) == 0x00044B, "Member 'ABP_CloudFuBenNew_C::Is_Reversed' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, Reversed_ZHeight_Bias) == 0x00044C, "Member 'ABP_CloudFuBenNew_C::Reversed_ZHeight_Bias' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, 待切换云) == 0x000450, "Member 'ABP_CloudFuBenNew_C::待切换云' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, CoverNoiseParameters) == 0x000451, "Member 'ABP_CloudFuBenNew_C::CoverNoiseParameters' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, EnableChange) == 0x000452, "Member 'ABP_CloudFuBenNew_C::EnableChange' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, Time) == 0x000454, "Member 'ABP_CloudFuBenNew_C::Time' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, Noise_Speed) == 0x000458, "Member 'ABP_CloudFuBenNew_C::Noise_Speed' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, Noise_Strength) == 0x00045C, "Member 'ABP_CloudFuBenNew_C::Noise_Strength' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, NoiseTiling) == 0x000460, "Member 'ABP_CloudFuBenNew_C::NoiseTiling' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, ProgressCurve) == 0x000468, "Member 'ABP_CloudFuBenNew_C::ProgressCurve' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, TotalChangeTime) == 0x0004F8, "Member 'ABP_CloudFuBenNew_C::TotalChangeTime' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, CurveTime) == 0x0004FC, "Member 'ABP_CloudFuBenNew_C::CurveTime' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, CanChange) == 0x000500, "Member 'ABP_CloudFuBenNew_C::CanChange' has a wrong offset!");
static_assert(offsetof(ABP_CloudFuBenNew_C, First) == 0x000501, "Member 'ABP_CloudFuBenNew_C::First' has a wrong offset!");

}

