#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CineCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CinematicCamera_structs.hpp"
#include "CinematicCamera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CineCamera.BP_CineCamera_C
// 0x00D0 (0x0D50 - 0x0C80)
class ABP_CineCamera_C final : public ACineCameraActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ResolutionAdaptFactor;                             // 0x0C88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8C[0x4];                                      // 0x0C8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    UiCameraAnimationRow;                              // 0x0C90(0x0018)(Edit, BlueprintVisible, NoDestructor)
	bool                                          IsAutoTransform;                                   // 0x0CA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA9[0x3];                                      // 0x0CA9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OffsetTime;                                        // 0x0CAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxOffsetTime;                                     // 0x0CB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCameraFilmbackSettings                Filmback;                                          // 0x0CB4(0x000C)(Edit, BlueprintVisible, NoDestructor)
	bool                                          Constrain_Aspect_Ratio;                            // 0x0CC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CC1[0x3];                                      // 0x0CC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Current_Focal_Length;                              // 0x0CC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Current_Aperture;                                  // 0x0CC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CCC[0x4];                                      // 0x0CCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraFocusSettings                   Focus_Settings;                                    // 0x0CD0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCameraLensSettings                    Lens_Settings;                                     // 0x0D30(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         FocalRegion;                                       // 0x0D48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CineCamera(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void EndAutoTransform();
	void BeginAutoTransform(float TimeLength);
	void ApplyUiCameraSettings();
	void ResetSeqCineCamSetting();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CineCamera_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CineCamera_C")
	}
	static class ABP_CineCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CineCamera_C>();
	}
};
DUMPER7_ASSERTS_ABP_CineCamera_C;

}

