#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FightCameraConfig

#include "Basic.hpp"

#include "EFightCameraDefault_structs.hpp"
#include "SBaseCurve_structs.hpp"
#include "EFightCameraFocus_structs.hpp"
#include "EFightCameraAdjust_structs.hpp"
#include "EFightCameraAuto_structs.hpp"
#include "EFightCameraInput_structs.hpp"
#include "EFightCameraModify_structs.hpp"
#include "EFightCameraGuide_structs.hpp"
#include "EFightCameraExplore_structs.hpp"
#include "EFightCameraDialogue_structs.hpp"
#include "EFightCameraClimb_structs.hpp"
#include "EFightCameraSidestep_structs.hpp"
#include "EFightCameraHook_structs.hpp"
#include "EFightCameraVehicle_structs.hpp"
#include "SSettlementCamera_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FightCameraConfig.BP_FightCameraConfig_C
// 0x0990 (0x09C8 - 0x0038)
class UBP_FightCameraConfig_C final : public UPrimaryDataAsset
{
public:
	TMap<EFightCameraDefault, float>              基础;                                              // 0x0038(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraDefault, struct FSBaseCurve> 基础曲线配置;                                      // 0x0088(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraAdjust, float>               技能修正;                                          // 0x00D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraAdjust, struct FSBaseCurve>  技能修正曲线配置;                                  // 0x0128(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraAuto, float>                 自动镜头;                                          // 0x0178(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraAuto, struct FSBaseCurve>    自动镜头曲线配置;                                  // 0x01C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraFocus, float>                锁定镜头;                                          // 0x0218(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraFocus, struct FSBaseCurve>   锁定镜头曲线配置;                                  // 0x0268(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraInput, float>                镜头输入;                                          // 0x02B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraInput, struct FSBaseCurve>   镜头输入曲线配置;                                  // 0x0308(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraModify, float>               Modify镜头;                                        // 0x0358(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraModify, struct FSBaseCurve>  Modify镜头曲线配置;                                // 0x03A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraGuide, float>                引导镜头;                                          // 0x03F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraGuide, struct FSBaseCurve>   引导镜头曲线配置;                                  // 0x0448(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraExplore, float>              跑图镜头;                                          // 0x0498(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraExplore, struct FSBaseCurve> 跑图镜头曲线配置;                                  // 0x04E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraDialogue, float>             对话镜头;                                          // 0x0538(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraDialogue, struct FSBaseCurve> 对话镜头曲线配置;                                 // 0x0588(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraClimb, float>                攀爬镜头;                                          // 0x05D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraClimb, struct FSBaseCurve>   攀爬镜头曲线配置;                                  // 0x0628(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraSidestep, float>             移动自动镜头;                                      // 0x0678(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraSidestep, struct FSBaseCurve> 移动自动镜头曲线配置;                             // 0x06C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraHook, float>                 钩锁镜头;                                          // 0x0718(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraHook, struct FSBaseCurve>    钩锁镜头曲线配置;                                  // 0x0768(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraVehicle, float>              载具镜头;                                          // 0x07B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFightCameraVehicle, struct FSBaseCurve> 载具镜头曲线配置;                                  // 0x0808(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSSettlementCamera                     结算镜头;                                          // 0x0858(0x0170)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FightCameraConfig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FightCameraConfig_C")
	}
	static class UBP_FightCameraConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FightCameraConfig_C>();
	}
};
DUMPER7_ASSERTS_UBP_FightCameraConfig_C;

}

