#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FollowShooterConfig

#include "Basic.hpp"

#include "SBornTransform_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SInputAction_structs.hpp"
#include "Engine_classes.hpp"
#include "SFollowShooterEnablePriorityInfo_structs.hpp"
#include "SFollowShooterTagConfig_structs.hpp"
#include "SLockOnFollowShooter_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FollowShooterConfig.BP_FollowShooterConfig_C
// 0x0250 (0x0288 - 0x0038)
class UBP_FollowShooterConfig_C final : public UPrimaryDataAsset
{
public:
	bool                                          AutoEnable;                                        // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NeedUploadData;                                    // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSInputAction>                  NeedInputActions;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   AddTagsWhenEnable;                                 // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   AddTagsToPlayerWhenPossess;                        // 0x0060(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   DisableWhenCurrentRoleHasTags;                     // 0x0070(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FGameplayTagContainer> AddTagsWhenCurrentRoleHasAnyTags;        // 0x0080(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         DelayDisappearMillisecond;                         // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSLockOnFollowShooter                  LockOnConfig;                                      // 0x00D8(0x0128)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         AimType;                                           // 0x0200(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SightResId;                                        // 0x0208(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSBornTransform                        BornTransform;                                     // 0x0218(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FSFollowShooterTagConfig>       AddTagByCheckCurrentRoleTag;                       // 0x0240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SetEntityEnableAfterMaterialController;            // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DisableInputWhenHasTags;                           // 0x0258(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSFollowShooterEnablePriorityInfo> EnablePriority;                                 // 0x0278(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FollowShooterConfig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FollowShooterConfig_C")
	}
	static class UBP_FollowShooterConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FollowShooterConfig_C>();
	}
};
DUMPER7_ASSERTS_UBP_FollowShooterConfig_C;

}

