#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FloatingMovementConfig

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "SFloatingMovementState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FloatingMovementConfig.BP_FloatingMovementConfig_C
// 0x0338 (0x0370 - 0x0038)
class UBP_FloatingMovementConfig_C final : public UPrimaryDataAsset
{
public:
	int32                                         MoveSpeed;                                         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SprintSpeed;                                       // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TurnSpeedDeg;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AirEnergyConsumption;                              // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RiseEnergyConsumption;                             // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DropEnergyConsumption;                             // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DodgeEnergyConsumption;                            // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MoveEnergyConsumption;                             // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FastMoveEnergyConsumption;                         // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SprintEnergyConsumption;                           // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnergyRecoverSpeed;                                // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnergyRecoverCoolDownTime;                         // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AirCriticalHeight;                                 // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CloseToGroundHeight;                               // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RiseSpeed;                                         // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DropSpeed;                                         // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimLerpAlpha;                                     // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpeedAcceleration;                                 // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DirectionLerpAlpha;                                // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ForbidRotationTagList;                             // 0x0088(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSFloatingMovementState                DefaultMode;                                       // 0x00A8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSFloatingMovementState                FloatingMode;                                      // 0x0130(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSFloatingMovementState                RiseMode;                                          // 0x01B8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSFloatingMovementState                DropMode;                                          // 0x0240(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSFloatingMovementState                WalkMode;                                          // 0x02C8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ForbidCloseToGrounTagList;                         // 0x0350(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FloatingMovementConfig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FloatingMovementConfig_C")
	}
	static class UBP_FloatingMovementConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FloatingMovementConfig_C>();
	}
};
DUMPER7_ASSERTS_UBP_FloatingMovementConfig_C;

}

