#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FlyingFeatherConfig

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FlyingFeatherConfig.BP_FlyingFeatherConfig_C
// 0x0040 (0x0078 - 0x0038)
class UBP_FlyingFeatherConfig_C final : public UPrimaryDataAsset
{
public:
	int32                                         BulletDelayTime;                                   // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillId;                                           // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 BulletId;                                          // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 FeatherTarget;                                     // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        MaxSpeed;                                          // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Acceleration;                                      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxChangeStateTime;                                // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ArriveDistance;                                    // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FlyingFeatherConfig_C">();
	}
	static class UBP_FlyingFeatherConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FlyingFeatherConfig_C>();
	}
};
static_assert(alignof(UBP_FlyingFeatherConfig_C) == 0x000008, "Wrong alignment on UBP_FlyingFeatherConfig_C");
static_assert(sizeof(UBP_FlyingFeatherConfig_C) == 0x000078, "Wrong size on UBP_FlyingFeatherConfig_C");
static_assert(offsetof(UBP_FlyingFeatherConfig_C, BulletDelayTime) == 0x000038, "Member 'UBP_FlyingFeatherConfig_C::BulletDelayTime' has a wrong offset!");
static_assert(offsetof(UBP_FlyingFeatherConfig_C, SkillId) == 0x00003C, "Member 'UBP_FlyingFeatherConfig_C::SkillId' has a wrong offset!");
static_assert(offsetof(UBP_FlyingFeatherConfig_C, BulletId) == 0x000040, "Member 'UBP_FlyingFeatherConfig_C::BulletId' has a wrong offset!");
static_assert(offsetof(UBP_FlyingFeatherConfig_C, FeatherTarget) == 0x000050, "Member 'UBP_FlyingFeatherConfig_C::FeatherTarget' has a wrong offset!");
static_assert(offsetof(UBP_FlyingFeatherConfig_C, MaxSpeed) == 0x000060, "Member 'UBP_FlyingFeatherConfig_C::MaxSpeed' has a wrong offset!");
static_assert(offsetof(UBP_FlyingFeatherConfig_C, Acceleration) == 0x000068, "Member 'UBP_FlyingFeatherConfig_C::Acceleration' has a wrong offset!");
static_assert(offsetof(UBP_FlyingFeatherConfig_C, MaxChangeStateTime) == 0x000070, "Member 'UBP_FlyingFeatherConfig_C::MaxChangeStateTime' has a wrong offset!");
static_assert(offsetof(UBP_FlyingFeatherConfig_C, ArriveDistance) == 0x000074, "Member 'UBP_FlyingFeatherConfig_C::ArriveDistance' has a wrong offset!");

}

