#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HoldingHandsConfig

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HoldingHandsConfig.BP_HoldingHandsConfig_C
// 0x0178 (0x01B0 - 0x0038)
class UBP_HoldingHandsConfig_C final : public UPrimaryDataAsset
{
public:
	struct FGameplayTagContainer                  邀请中;                                            // 0x0038(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  牵手中;                                            // 0x0058(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  被牵手中;                                          // 0x0078(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           牵手范围内;                                        // 0x0098(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  牵手禁止;                                          // 0x00A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         超时终止时长;                                      // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         进出牵手阻尼;                                      // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         跑步速度缩放;                                      // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         牵手点阻尼;                                        // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         长按退出时长;                                      // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRange                            牵手点偏转角范围;                                  // 0x00DC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRange                            牵手点俯仰角范围;                                  // 0x00EC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRange                            肩部偏转角范围;                                    // 0x00FC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRange                            肩部俯仰角范围;                                    // 0x010C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         范围内额外角度;                                    // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         范围外可达距离缩放;                                // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         范围内可达距离缩放;                                // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         范围外牵手点最大距离;                              // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         范围内牵手点最大距离;                              // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_KeepFollowingConfig_C> 跟随配置;                                        // 0x0130(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         跑步最大旋转速度;                                  // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         走路最大旋转速度;                                  // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         牵手者碰撞优先级;                                  // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         被牵手者碰撞优先级;                                // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         牵手者质量;                                        // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         被牵手者质量;                                      // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         邀请距离;                                          // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         邀请距离容差;                                      // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         邀请结束距离;                                      // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         邀请结束距离容差;                                  // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         邀请结束移动速度;                                  // 0x018C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         邀请旋转速度;                                      // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         邀请时牵手点阻尼;                                  // 0x0194(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         手掌最小夹角;                                      // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         牵手者牵手点位置缩放;                              // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         被牵手者牵手点位置缩放;                            // 0x01A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         贴合距离;                                          // 0x01A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         范围外肩部最大高度差;                              // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         范围内肩部最大高度差;                              // 0x01AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HoldingHandsConfig_C">();
	}
	static class UBP_HoldingHandsConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HoldingHandsConfig_C>();
	}
};
static_assert(alignof(UBP_HoldingHandsConfig_C) == 0x000008, "Wrong alignment on UBP_HoldingHandsConfig_C");
static_assert(sizeof(UBP_HoldingHandsConfig_C) == 0x0001B0, "Wrong size on UBP_HoldingHandsConfig_C");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 邀请中) == 0x000038, "Member 'UBP_HoldingHandsConfig_C::邀请中' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 牵手中) == 0x000058, "Member 'UBP_HoldingHandsConfig_C::牵手中' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 被牵手中) == 0x000078, "Member 'UBP_HoldingHandsConfig_C::被牵手中' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 牵手范围内) == 0x000098, "Member 'UBP_HoldingHandsConfig_C::牵手范围内' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 牵手禁止) == 0x0000A8, "Member 'UBP_HoldingHandsConfig_C::牵手禁止' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 超时终止时长) == 0x0000C8, "Member 'UBP_HoldingHandsConfig_C::超时终止时长' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 进出牵手阻尼) == 0x0000CC, "Member 'UBP_HoldingHandsConfig_C::进出牵手阻尼' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 跑步速度缩放) == 0x0000D0, "Member 'UBP_HoldingHandsConfig_C::跑步速度缩放' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 牵手点阻尼) == 0x0000D4, "Member 'UBP_HoldingHandsConfig_C::牵手点阻尼' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 长按退出时长) == 0x0000D8, "Member 'UBP_HoldingHandsConfig_C::长按退出时长' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 牵手点偏转角范围) == 0x0000DC, "Member 'UBP_HoldingHandsConfig_C::牵手点偏转角范围' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 牵手点俯仰角范围) == 0x0000EC, "Member 'UBP_HoldingHandsConfig_C::牵手点俯仰角范围' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 肩部偏转角范围) == 0x0000FC, "Member 'UBP_HoldingHandsConfig_C::肩部偏转角范围' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 肩部俯仰角范围) == 0x00010C, "Member 'UBP_HoldingHandsConfig_C::肩部俯仰角范围' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 范围内额外角度) == 0x00011C, "Member 'UBP_HoldingHandsConfig_C::范围内额外角度' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 范围外可达距离缩放) == 0x000120, "Member 'UBP_HoldingHandsConfig_C::范围外可达距离缩放' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 范围内可达距离缩放) == 0x000124, "Member 'UBP_HoldingHandsConfig_C::范围内可达距离缩放' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 范围外牵手点最大距离) == 0x000128, "Member 'UBP_HoldingHandsConfig_C::范围外牵手点最大距离' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 范围内牵手点最大距离) == 0x00012C, "Member 'UBP_HoldingHandsConfig_C::范围内牵手点最大距离' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 跟随配置) == 0x000130, "Member 'UBP_HoldingHandsConfig_C::跟随配置' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, Debug) == 0x000160, "Member 'UBP_HoldingHandsConfig_C::Debug' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 跑步最大旋转速度) == 0x000164, "Member 'UBP_HoldingHandsConfig_C::跑步最大旋转速度' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 走路最大旋转速度) == 0x000168, "Member 'UBP_HoldingHandsConfig_C::走路最大旋转速度' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 牵手者碰撞优先级) == 0x00016C, "Member 'UBP_HoldingHandsConfig_C::牵手者碰撞优先级' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 被牵手者碰撞优先级) == 0x000170, "Member 'UBP_HoldingHandsConfig_C::被牵手者碰撞优先级' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 牵手者质量) == 0x000174, "Member 'UBP_HoldingHandsConfig_C::牵手者质量' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 被牵手者质量) == 0x000178, "Member 'UBP_HoldingHandsConfig_C::被牵手者质量' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 邀请距离) == 0x00017C, "Member 'UBP_HoldingHandsConfig_C::邀请距离' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 邀请距离容差) == 0x000180, "Member 'UBP_HoldingHandsConfig_C::邀请距离容差' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 邀请结束距离) == 0x000184, "Member 'UBP_HoldingHandsConfig_C::邀请结束距离' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 邀请结束距离容差) == 0x000188, "Member 'UBP_HoldingHandsConfig_C::邀请结束距离容差' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 邀请结束移动速度) == 0x00018C, "Member 'UBP_HoldingHandsConfig_C::邀请结束移动速度' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 邀请旋转速度) == 0x000190, "Member 'UBP_HoldingHandsConfig_C::邀请旋转速度' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 邀请时牵手点阻尼) == 0x000194, "Member 'UBP_HoldingHandsConfig_C::邀请时牵手点阻尼' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 手掌最小夹角) == 0x000198, "Member 'UBP_HoldingHandsConfig_C::手掌最小夹角' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 牵手者牵手点位置缩放) == 0x00019C, "Member 'UBP_HoldingHandsConfig_C::牵手者牵手点位置缩放' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 被牵手者牵手点位置缩放) == 0x0001A0, "Member 'UBP_HoldingHandsConfig_C::被牵手者牵手点位置缩放' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 贴合距离) == 0x0001A4, "Member 'UBP_HoldingHandsConfig_C::贴合距离' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 范围外肩部最大高度差) == 0x0001A8, "Member 'UBP_HoldingHandsConfig_C::范围外肩部最大高度差' has a wrong offset!");
static_assert(offsetof(UBP_HoldingHandsConfig_C, 范围内肩部最大高度差) == 0x0001AC, "Member 'UBP_HoldingHandsConfig_C::范围内肩部最大高度差' has a wrong offset!");

}

