#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KuroStreamingSourceProxy_Seq

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_KuroStreamingSourceProxy_Seq.BP_KuroStreamingSourceProxy_Seq_C.EditorTick
// 0x0004 (0x0004 - 0x0000)
struct BP_KuroStreamingSourceProxy_Seq_C_EditorTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KuroStreamingSourceProxy_Seq_C_EditorTick) == 0x000004, "Wrong alignment on BP_KuroStreamingSourceProxy_Seq_C_EditorTick");
static_assert(sizeof(BP_KuroStreamingSourceProxy_Seq_C_EditorTick) == 0x000004, "Wrong size on BP_KuroStreamingSourceProxy_Seq_C_EditorTick");
static_assert(offsetof(BP_KuroStreamingSourceProxy_Seq_C_EditorTick, DeltaSeconds) == 0x000000, "Member 'BP_KuroStreamingSourceProxy_Seq_C_EditorTick::DeltaSeconds' has a wrong offset!");

// Function BP_KuroStreamingSourceProxy_Seq.BP_KuroStreamingSourceProxy_Seq_C.ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq
// 0x0058 (0x0058 - 0x0000)
struct BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq) == 0x000008, "Wrong alignment on BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq");
static_assert(sizeof(BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq) == 0x000058, "Wrong size on BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq");
static_assert(offsetof(BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq, EntryPoint) == 0x000000, "Member 'BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq, CallFunc_Conv_FloatToString_ReturnValue) == 0x000008, "Member 'BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq, CallFunc_GetAttachParentActor_ReturnValue) == 0x000018, "Member 'BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq, CallFunc_GetVelocity_ReturnValue) == 0x000034, "Member 'BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq, CallFunc_GetVelocity_ReturnValue_1) == 0x000040, "Member 'BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq, CallFunc_VSize_ReturnValue) == 0x00004C, "Member 'BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq, CallFunc_VSize_ReturnValue_1) == 0x000050, "Member 'BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq, K2Node_Event_DeltaSeconds) == 0x000054, "Member 'BP_KuroStreamingSourceProxy_Seq_C_ExecuteUbergraph_BP_KuroStreamingSourceProxy_Seq::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

