#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KeepFollowingConfig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_KeepFollowingConfig.BP_KeepFollowingConfig_C
// 0x0070 (0x00A8 - 0x0038)
class UBP_KeepFollowingConfig_C final : public UPrimaryDataAsset
{
public:
	struct FVector2D                              步行跟随方位向量;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              跑步跟随方位向量;                                  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              跟随变速范围;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          是否启用位移修正;                                  // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         位移修正距离;                                      // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         保持站立距离;                                      // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         走跑状态分界速度;                                  // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         走跑分界速度浮动;                                  // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         跟随距离容差;                                      // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         转向角度容差;                                      // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         最大转向持续时间;                                  // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         变速加速度;                                        // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         转向速度;                                          // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         高低差允许范围;                                    // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugDraw;                                         // 0x007C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         位移修正速度;                                      // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          是否启用超时传送;                                  // 0x0084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         异常距离;                                          // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         超时时间;                                          // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 传送特效buffID;                                    // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         被阻挡触发传送时间;                                // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_KeepFollowingConfig_C">();
	}
	static class UBP_KeepFollowingConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_KeepFollowingConfig_C>();
	}
};
static_assert(alignof(UBP_KeepFollowingConfig_C) == 0x000008, "Wrong alignment on UBP_KeepFollowingConfig_C");
static_assert(sizeof(UBP_KeepFollowingConfig_C) == 0x0000A8, "Wrong size on UBP_KeepFollowingConfig_C");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 步行跟随方位向量) == 0x000038, "Member 'UBP_KeepFollowingConfig_C::步行跟随方位向量' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 跑步跟随方位向量) == 0x000040, "Member 'UBP_KeepFollowingConfig_C::跑步跟随方位向量' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 跟随变速范围) == 0x000048, "Member 'UBP_KeepFollowingConfig_C::跟随变速范围' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 是否启用位移修正) == 0x000050, "Member 'UBP_KeepFollowingConfig_C::是否启用位移修正' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 位移修正距离) == 0x000054, "Member 'UBP_KeepFollowingConfig_C::位移修正距离' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 保持站立距离) == 0x000058, "Member 'UBP_KeepFollowingConfig_C::保持站立距离' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 走跑状态分界速度) == 0x00005C, "Member 'UBP_KeepFollowingConfig_C::走跑状态分界速度' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 走跑分界速度浮动) == 0x000060, "Member 'UBP_KeepFollowingConfig_C::走跑分界速度浮动' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 跟随距离容差) == 0x000064, "Member 'UBP_KeepFollowingConfig_C::跟随距离容差' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 转向角度容差) == 0x000068, "Member 'UBP_KeepFollowingConfig_C::转向角度容差' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 最大转向持续时间) == 0x00006C, "Member 'UBP_KeepFollowingConfig_C::最大转向持续时间' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 变速加速度) == 0x000070, "Member 'UBP_KeepFollowingConfig_C::变速加速度' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 转向速度) == 0x000074, "Member 'UBP_KeepFollowingConfig_C::转向速度' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 高低差允许范围) == 0x000078, "Member 'UBP_KeepFollowingConfig_C::高低差允许范围' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, DebugDraw) == 0x00007C, "Member 'UBP_KeepFollowingConfig_C::DebugDraw' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 位移修正速度) == 0x000080, "Member 'UBP_KeepFollowingConfig_C::位移修正速度' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 是否启用超时传送) == 0x000084, "Member 'UBP_KeepFollowingConfig_C::是否启用超时传送' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 异常距离) == 0x000088, "Member 'UBP_KeepFollowingConfig_C::异常距离' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 超时时间) == 0x00008C, "Member 'UBP_KeepFollowingConfig_C::超时时间' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 传送特效buffID) == 0x000090, "Member 'UBP_KeepFollowingConfig_C::传送特效buffID' has a wrong offset!");
static_assert(offsetof(UBP_KeepFollowingConfig_C, 被阻挡触发传送时间) == 0x0000A0, "Member 'UBP_KeepFollowingConfig_C::被阻挡触发传送时间' has a wrong offset!");

}

