#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mascot

#include "Basic.hpp"

#include "KuroCurve_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mascot.BP_Mascot_C
// 0x0130 (0x03E0 - 0x02B0)
class ABP_Mascot_C final : public AActor
{
public:
	class UABPC_Seq_Body_V2_C*                    ABPC_Body_V2;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Add_Spine;                                         // 0x02C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Add_Spine_Head;                                    // 0x02D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USkeletalMesh*                          Mesh;                                              // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNamedCurveValue>               NamedCurves;                                       // 0x02E8(0x0010)(Edit, BlueprintVisible)
	struct FKuroCurveFloat                        KuroFixCurve;                                      // 0x02F8(0x0090)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         TalkID;                                            // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TalkID_SP;                                         // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FTransform>          Float_Curve_Data;                                  // 0x0390(0x0050)(Edit, BlueprintVisible)

public:
	void UserConstructionScript();
	void GetFixValue(float inValue, float* FixValue);
	void HasFixCurve(class FName CheckName, bool* Ret, class FName* FixName);
	void CalcAllCurve(TArray<struct FNamedCurveValue>* Ret);
	void CalcAllCurve_2(TArray<struct FNamedCurveValue>* Ret);
	bool SetAnimDataVector(const TMap<class FName, struct FVector>& VectorCurveData);
	bool SetAnimDataFloat(const TArray<struct FNamedCurveValue>& FloatCurveData);
	TArray<class FName> GetSupportGroupNames();
	bool GetAnimDataVector(TMap<class FName, struct FVector>* VectorCurveData);
	bool GetAnimDataFloat(TArray<struct FNamedCurveValue>* FloatCurveData);
	bool SetAnimDataTransform(const TMap<class FName, struct FTransform>& FloatCurveData);
	bool IsCustomSupport();
	bool GetAnimDataTransform(TMap<class FName, struct FTransform>* FloatCurveData);
	void GetAddSpineValue(struct FRotator* AddSpine);
	void GetAddSpineHeadValue(struct FRotator* AddSpineHead);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Mascot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Mascot_C")
	}
	static class ABP_Mascot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mascot_C>();
	}
};
DUMPER7_ASSERTS_ABP_Mascot_C;

}

