#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PerformanceDisableLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PerformanceDisableLight.BP_PerformanceDisableLight_C
// 0x0018 (0x03D0 - 0x03B8)
class ABP_PerformanceDisableLight_C final : public AKuroEditorTickActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableLight;                                      // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          IsEnableDisable;                                   // 0x03C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsEnableToonDisable;                               // 0x03CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DisableToonLight;                                  // 0x03CB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_BP_PerformanceDisableLight(int32 EntryPoint);
	void ReceiveDestroyed();
	void EditorTick(float DeltaSeconds);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void DisableLightFun();
	void DisableToonLightFun();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PerformanceDisableLight_C">();
	}
	static class ABP_PerformanceDisableLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PerformanceDisableLight_C>();
	}
};
static_assert(alignof(ABP_PerformanceDisableLight_C) == 0x000008, "Wrong alignment on ABP_PerformanceDisableLight_C");
static_assert(sizeof(ABP_PerformanceDisableLight_C) == 0x0003D0, "Wrong size on ABP_PerformanceDisableLight_C");
static_assert(offsetof(ABP_PerformanceDisableLight_C, UberGraphFrame) == 0x0003B8, "Member 'ABP_PerformanceDisableLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PerformanceDisableLight_C, DefaultSceneRoot) == 0x0003C0, "Member 'ABP_PerformanceDisableLight_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PerformanceDisableLight_C, DisableLight) == 0x0003C8, "Member 'ABP_PerformanceDisableLight_C::DisableLight' has a wrong offset!");
static_assert(offsetof(ABP_PerformanceDisableLight_C, IsEnableDisable) == 0x0003C9, "Member 'ABP_PerformanceDisableLight_C::IsEnableDisable' has a wrong offset!");
static_assert(offsetof(ABP_PerformanceDisableLight_C, IsEnableToonDisable) == 0x0003CA, "Member 'ABP_PerformanceDisableLight_C::IsEnableToonDisable' has a wrong offset!");
static_assert(offsetof(ABP_PerformanceDisableLight_C, DisableToonLight) == 0x0003CB, "Member 'ABP_PerformanceDisableLight_C::DisableToonLight' has a wrong offset!");

}

