#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PilotThrowGameplaySetting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PilotThrowGameplaySetting.BP_PilotThrowGameplaySetting_C
// 0x00C8 (0x0100 - 0x0038)
class UBP_PilotThrowGameplaySetting_C final : public UPrimaryDataAsset
{
public:
	bool                                          DebugMode;                                         // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         初速度仰角;                                        // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         初速度;                                            // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         射线检测半径;                                      // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         重力加速度;                                        // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UEffectModelGroup_C>     样条特效;                                          // 0x0050(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UEffectModelGroup>       终点特效;                                          // 0x0080(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector2D                              触屏移动系数;                                      // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PC移动系数;                                        // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              手柄移动系数;                                      // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         目标点高亮距离;                                    // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         边缘超出角度;                                      // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ui缩放;                                            // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         铁驭旋转偏移;                                      // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKuroForceFeedbackEffect*               手柄震动配置;                                      // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          抛物线起点偏移;                                    // 0x00E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         启动镜头插值;                                      // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         自动投掷转状态延迟;                                // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PilotThrowGameplaySetting_C">();
	}
	static class UBP_PilotThrowGameplaySetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PilotThrowGameplaySetting_C>();
	}
};
static_assert(alignof(UBP_PilotThrowGameplaySetting_C) == 0x000008, "Wrong alignment on UBP_PilotThrowGameplaySetting_C");
static_assert(sizeof(UBP_PilotThrowGameplaySetting_C) == 0x000100, "Wrong size on UBP_PilotThrowGameplaySetting_C");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, DebugMode) == 0x000038, "Member 'UBP_PilotThrowGameplaySetting_C::DebugMode' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 初速度仰角) == 0x00003C, "Member 'UBP_PilotThrowGameplaySetting_C::初速度仰角' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 初速度) == 0x000040, "Member 'UBP_PilotThrowGameplaySetting_C::初速度' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 射线检测半径) == 0x000044, "Member 'UBP_PilotThrowGameplaySetting_C::射线检测半径' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 重力加速度) == 0x000048, "Member 'UBP_PilotThrowGameplaySetting_C::重力加速度' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 样条特效) == 0x000050, "Member 'UBP_PilotThrowGameplaySetting_C::样条特效' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 终点特效) == 0x000080, "Member 'UBP_PilotThrowGameplaySetting_C::终点特效' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 触屏移动系数) == 0x0000B0, "Member 'UBP_PilotThrowGameplaySetting_C::触屏移动系数' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, PC移动系数) == 0x0000B8, "Member 'UBP_PilotThrowGameplaySetting_C::PC移动系数' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 手柄移动系数) == 0x0000C0, "Member 'UBP_PilotThrowGameplaySetting_C::手柄移动系数' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 目标点高亮距离) == 0x0000C8, "Member 'UBP_PilotThrowGameplaySetting_C::目标点高亮距离' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 边缘超出角度) == 0x0000CC, "Member 'UBP_PilotThrowGameplaySetting_C::边缘超出角度' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, Ui缩放) == 0x0000D0, "Member 'UBP_PilotThrowGameplaySetting_C::Ui缩放' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 铁驭旋转偏移) == 0x0000D4, "Member 'UBP_PilotThrowGameplaySetting_C::铁驭旋转偏移' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 手柄震动配置) == 0x0000D8, "Member 'UBP_PilotThrowGameplaySetting_C::手柄震动配置' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 抛物线起点偏移) == 0x0000E0, "Member 'UBP_PilotThrowGameplaySetting_C::抛物线起点偏移' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 启动镜头插值) == 0x0000F8, "Member 'UBP_PilotThrowGameplaySetting_C::启动镜头插值' has a wrong offset!");
static_assert(offsetof(UBP_PilotThrowGameplaySetting_C, 自动投掷转状态延迟) == 0x0000FC, "Member 'UBP_PilotThrowGameplaySetting_C::自动投掷转状态延迟' has a wrong offset!");

}

