#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PerformanceDisableLight_MP4_OnlyEditor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PerformanceDisableLight_MP4_OnlyEditor.BP_PerformanceDisableLight_MP4_OnlyEditor_C.ExecuteUbergraph_BP_PerformanceDisableLight_MP4_OnlyEditor
// 0x0008 (0x0008 - 0x0000)
struct BP_PerformanceDisableLight_MP4_OnlyEditor_C_ExecuteUbergraph_BP_PerformanceDisableLight_MP4_OnlyEditor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PerformanceDisableLight_MP4_OnlyEditor_C_ExecuteUbergraph_BP_PerformanceDisableLight_MP4_OnlyEditor;

// Function BP_PerformanceDisableLight_MP4_OnlyEditor.BP_PerformanceDisableLight_MP4_OnlyEditor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PerformanceDisableLight_MP4_OnlyEditor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PerformanceDisableLight_MP4_OnlyEditor_C_ReceiveTick;

// Function BP_PerformanceDisableLight_MP4_OnlyEditor.BP_PerformanceDisableLight_MP4_OnlyEditor_C.DisableLightFun_MP4
// 0x0020 (0x0020 - 0x0000)
struct BP_PerformanceDisableLight_MP4_OnlyEditor_C_DisableLightFun_MP4 final
{
public:
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PerformanceDisableLight_MP4_OnlyEditor_C_DisableLightFun_MP4;

}

