#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplaceHitEffect

#include "Basic.hpp"

#include "STimeScale_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReplaceHitEffect.BP_ReplaceHitEffect_C
// 0x00F0 (0x0128 - 0x0038)
class UBP_ReplaceHitEffect_C final : public UPrimaryDataAsset
{
public:
	TSoftClassPtr<class UClass>                   震屏;                                              // 0x0038(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UEffectModelBase>        受击特效;                                          // 0x0068(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UEffectModelAudio_C>     受击音效;                                          // 0x0098(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UEffectModelBase>        命中特效;                                          // 0x00C8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          替换近战子弹顿帧;                                  // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTimeScale                            顿帧;                                              // 0x0100(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           不替换的部位;                                      // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ReplaceHitEffect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ReplaceHitEffect_C")
	}
	static class UBP_ReplaceHitEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ReplaceHitEffect_C>();
	}
};
DUMPER7_ASSERTS_UBP_ReplaceHitEffect_C;

}

