#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RhythmGameConfig

#include "Basic.hpp"

#include "KuroRhythmGame_structs.hpp"
#include "RhythmGameFreeFlyCameraConfig_structs.hpp"
#include "RhythmGameSpeedLevelConfig_structs.hpp"
#include "RhythmGamePerformanceCameraConfig_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RhythmGameConfig.BP_RhythmGameConfig_C
// 0x01B8 (0x01F0 - 0x0038)
class UBP_RhythmGameConfig_C final : public UPrimaryDataAsset
{
public:
	struct FKuroRhythmGameConfig                  Config;                                            // 0x0038(0x0110)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<struct FRhythmGameSpeedLevelConfig>    SpeedLevelConfig;                                  // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRhythmGamePerformanceCameraConfig     StartCameraConfig;                                 // 0x0158(0x0030)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRhythmGamePerformanceCameraConfig     EndCameraConfig;                                   // 0x0188(0x0030)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRhythmGameFreeFlyCameraConfig         FreeFlyCameraConfig;                               // 0x01B8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RhythmGameConfig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RhythmGameConfig_C")
	}
	static class UBP_RhythmGameConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_RhythmGameConfig_C>();
	}
};
DUMPER7_ASSERTS_UBP_RhythmGameConfig_C;

}

