#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SunSpiritConfig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SunSpiritConfig.BP_SunSpiritConfig_C
// 0x00B0 (0x00E8 - 0x0038)
class UBP_SunSpiritConfig_C final : public UPrimaryDataAsset
{
public:
	class UBP_CrowdAiConfig_C*                    CrowdAiConfig;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CrowdAiSystemIndex;                                // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AroundPlayerPosQueryRadius;                        // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AroundPlayerPosQueryBoidRadius;                    // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AroundPlayerPosQueryMaxTryCount;                   // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyingEffectMaxDist;                               // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyingEffectMinDist;                               // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyingEffectUpdateFailMaxTimeSec;                  // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FlyingEffectUpdateFailMaxCount;                    // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyingEffectMaxFlyingDuration;                     // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UEffectModelBase>        FlyingEffectDa;                                    // 0x0068(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          FlyFromPlayerToGearInOrderFromMinToMax;            // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FlyFromPlayerToGearDelayInterval;                  // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyFromPlayerToGearWaitTimeBeforeFly;              // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyFromPlayerToGearSpeedForCalc;                   // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyFromPlayerToGearDefaultDuration;                // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlyFromGearToPlayerInOrderFromMinToMax;            // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FlyFromGearToPlayerDelayInterval;                  // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyFromGearToPlayerWaitTimeBeforeFly;              // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyFromGearToPlayerSpeedForCalc;                   // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyFromGearToPlayerDefaultDuration;                // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyFromGearToPlayerMaxOffsetForReQueryTargetLoc;   // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LauncherHintUiAnchorOffset;                        // 0x00C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LauncherHintUiPosLerpSpeed;                        // 0x00CC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CharacterHintUiAnchorOffset;                       // 0x00D4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CharacterHintUiPosLerpSpeed;                       // 0x00DC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CharacterHintUiShowDurationWhenUpdate;             // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SunSpiritConfig_C">();
	}
	static class UBP_SunSpiritConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SunSpiritConfig_C>();
	}
};
static_assert(alignof(UBP_SunSpiritConfig_C) == 0x000008, "Wrong alignment on UBP_SunSpiritConfig_C");
static_assert(sizeof(UBP_SunSpiritConfig_C) == 0x0000E8, "Wrong size on UBP_SunSpiritConfig_C");
static_assert(offsetof(UBP_SunSpiritConfig_C, CrowdAiConfig) == 0x000038, "Member 'UBP_SunSpiritConfig_C::CrowdAiConfig' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, CrowdAiSystemIndex) == 0x000040, "Member 'UBP_SunSpiritConfig_C::CrowdAiSystemIndex' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, AroundPlayerPosQueryRadius) == 0x000044, "Member 'UBP_SunSpiritConfig_C::AroundPlayerPosQueryRadius' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, AroundPlayerPosQueryBoidRadius) == 0x000048, "Member 'UBP_SunSpiritConfig_C::AroundPlayerPosQueryBoidRadius' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, AroundPlayerPosQueryMaxTryCount) == 0x00004C, "Member 'UBP_SunSpiritConfig_C::AroundPlayerPosQueryMaxTryCount' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyingEffectMaxDist) == 0x000050, "Member 'UBP_SunSpiritConfig_C::FlyingEffectMaxDist' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyingEffectMinDist) == 0x000054, "Member 'UBP_SunSpiritConfig_C::FlyingEffectMinDist' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyingEffectUpdateFailMaxTimeSec) == 0x000058, "Member 'UBP_SunSpiritConfig_C::FlyingEffectUpdateFailMaxTimeSec' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyingEffectUpdateFailMaxCount) == 0x00005C, "Member 'UBP_SunSpiritConfig_C::FlyingEffectUpdateFailMaxCount' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyingEffectMaxFlyingDuration) == 0x000060, "Member 'UBP_SunSpiritConfig_C::FlyingEffectMaxFlyingDuration' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyingEffectDa) == 0x000068, "Member 'UBP_SunSpiritConfig_C::FlyingEffectDa' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyFromPlayerToGearInOrderFromMinToMax) == 0x000098, "Member 'UBP_SunSpiritConfig_C::FlyFromPlayerToGearInOrderFromMinToMax' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyFromPlayerToGearDelayInterval) == 0x00009C, "Member 'UBP_SunSpiritConfig_C::FlyFromPlayerToGearDelayInterval' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyFromPlayerToGearWaitTimeBeforeFly) == 0x0000A0, "Member 'UBP_SunSpiritConfig_C::FlyFromPlayerToGearWaitTimeBeforeFly' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyFromPlayerToGearSpeedForCalc) == 0x0000A4, "Member 'UBP_SunSpiritConfig_C::FlyFromPlayerToGearSpeedForCalc' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyFromPlayerToGearDefaultDuration) == 0x0000A8, "Member 'UBP_SunSpiritConfig_C::FlyFromPlayerToGearDefaultDuration' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyFromGearToPlayerInOrderFromMinToMax) == 0x0000AC, "Member 'UBP_SunSpiritConfig_C::FlyFromGearToPlayerInOrderFromMinToMax' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyFromGearToPlayerDelayInterval) == 0x0000B0, "Member 'UBP_SunSpiritConfig_C::FlyFromGearToPlayerDelayInterval' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyFromGearToPlayerWaitTimeBeforeFly) == 0x0000B4, "Member 'UBP_SunSpiritConfig_C::FlyFromGearToPlayerWaitTimeBeforeFly' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyFromGearToPlayerSpeedForCalc) == 0x0000B8, "Member 'UBP_SunSpiritConfig_C::FlyFromGearToPlayerSpeedForCalc' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyFromGearToPlayerDefaultDuration) == 0x0000BC, "Member 'UBP_SunSpiritConfig_C::FlyFromGearToPlayerDefaultDuration' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, FlyFromGearToPlayerMaxOffsetForReQueryTargetLoc) == 0x0000C0, "Member 'UBP_SunSpiritConfig_C::FlyFromGearToPlayerMaxOffsetForReQueryTargetLoc' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, LauncherHintUiAnchorOffset) == 0x0000C4, "Member 'UBP_SunSpiritConfig_C::LauncherHintUiAnchorOffset' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, LauncherHintUiPosLerpSpeed) == 0x0000CC, "Member 'UBP_SunSpiritConfig_C::LauncherHintUiPosLerpSpeed' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, CharacterHintUiAnchorOffset) == 0x0000D4, "Member 'UBP_SunSpiritConfig_C::CharacterHintUiAnchorOffset' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, CharacterHintUiPosLerpSpeed) == 0x0000DC, "Member 'UBP_SunSpiritConfig_C::CharacterHintUiPosLerpSpeed' has a wrong offset!");
static_assert(offsetof(UBP_SunSpiritConfig_C, CharacterHintUiShowDurationWhenUpdate) == 0x0000E4, "Member 'UBP_SunSpiritConfig_C::CharacterHintUiShowDurationWhenUpdate' has a wrong offset!");

}

