#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SM_BindStateBoneCollision

#include "Basic.hpp"

#include "SMSystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SM_BindStateBoneCollision.BP_SM_BindStateBoneCollision_C
// 0x0018 (0x0048 - 0x0030)
class UBP_SM_BindStateBoneCollision_C final : public UASMBindState
{
public:
	class FString                                 骨骼名;                                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          阻挡角色;                                          // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          阻挡子弹;                                          // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          阻挡镜头;                                          // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          退出节点时阻挡角色;                                // 0x0043(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          退出节点时阻挡子弹;                                // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          退出节点时阻挡镜头;                                // 0x0045(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SM_BindStateBoneCollision_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SM_BindStateBoneCollision_C")
	}
	static class UBP_SM_BindStateBoneCollision_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SM_BindStateBoneCollision_C>();
	}
};
DUMPER7_ASSERTS_UBP_SM_BindStateBoneCollision_C;

}

