#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineClimbConfig

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SplineClimbConfig.BP_SplineClimbConfig_C
// 0x0048 (0x0080 - 0x0038)
class UBP_SplineClimbConfig_C final : public UPrimaryDataAsset
{
public:
	struct FGameplayTagContainer                  期间Tag;                                           // 0x0038(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 打断技能;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DebugDraw;                                         // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         采样长度;                                          // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         采样间隔;                                          // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         检测距离;                                          // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         检测起始偏移;                                      // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         离墙额外距离;                                      // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SplineClimbConfig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SplineClimbConfig_C")
	}
	static class UBP_SplineClimbConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SplineClimbConfig_C>();
	}
};
DUMPER7_ASSERTS_UBP_SplineClimbConfig_C;

}

