#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SeqNPC

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_NpcCombinedMesh_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SeqNPC.BP_SeqNPC_C
// 0x0088 (0x0460 - 0x03D8)
class ABP_SeqNPC_C final : public ABP_NpcCombinedMesh_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USeqAudio_Seq_V2_C*                     SeqAudio_Seq_V2;                                   // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UABPC_Seq_Body_V2_C*                    ABPC_Body_V2;                                      // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPD_NpcSetupData_C*                     NPC_DA;                                            // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxLod;                                            // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LodBias;                                           // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreSockets;                                     // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TalkID;                                            // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TalkID_SP;                                         // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FTransform>          Float_Curve_Data;                                  // 0x0410(0x0050)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_SeqNPC(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	void UpdateNpcByDa();
	bool SetAnimDataVector(const TMap<class FName, struct FVector>& VectorCurveData);
	bool SetAnimDataFloat(const TArray<struct FNamedCurveValue>& FloatCurveData);
	TArray<class FName> GetSupportGroupNames();
	bool GetAnimDataVector(TMap<class FName, struct FVector>* VectorCurveData);
	bool GetAnimDataFloat(TArray<struct FNamedCurveValue>* FloatCurveData);
	bool SetAnimDataTransform(const TMap<class FName, struct FTransform>& FloatCurveData);
	bool IsCustomSupport();
	bool GetAnimDataTransform(TMap<class FName, struct FTransform>* FloatCurveData);
	void GetABPC_Body_V2(class UABPC_Seq_Body_V2_C** ABPC_Body_V2_0);
	void GetSeqAudio(class USeqAudio_Seq_V2_C** SeqAudio);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SeqNPC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SeqNPC_C")
	}
	static class ABP_SeqNPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SeqNPC_C>();
	}
};
DUMPER7_ASSERTS_ABP_SeqNPC_C;

}

