#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineClimbConfig

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SplineClimbConfig.BP_SplineClimbConfig_C
// 0x0048 (0x0080 - 0x0038)
class UBP_SplineClimbConfig_C final : public UPrimaryDataAsset
{
public:
	struct FGameplayTagContainer                  期间Tag;                                           // 0x0038(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 打断技能;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DebugDraw;                                         // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         采样长度;                                          // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         采样间隔;                                          // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         检测距离;                                          // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         检测起始偏移;                                      // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         离墙额外距离;                                      // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SplineClimbConfig_C">();
	}
	static class UBP_SplineClimbConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SplineClimbConfig_C>();
	}
};
static_assert(alignof(UBP_SplineClimbConfig_C) == 0x000008, "Wrong alignment on UBP_SplineClimbConfig_C");
static_assert(sizeof(UBP_SplineClimbConfig_C) == 0x000080, "Wrong size on UBP_SplineClimbConfig_C");
static_assert(offsetof(UBP_SplineClimbConfig_C, 期间Tag) == 0x000038, "Member 'UBP_SplineClimbConfig_C::期间Tag' has a wrong offset!");
static_assert(offsetof(UBP_SplineClimbConfig_C, 打断技能) == 0x000058, "Member 'UBP_SplineClimbConfig_C::打断技能' has a wrong offset!");
static_assert(offsetof(UBP_SplineClimbConfig_C, DebugDraw) == 0x000068, "Member 'UBP_SplineClimbConfig_C::DebugDraw' has a wrong offset!");
static_assert(offsetof(UBP_SplineClimbConfig_C, 采样长度) == 0x00006C, "Member 'UBP_SplineClimbConfig_C::采样长度' has a wrong offset!");
static_assert(offsetof(UBP_SplineClimbConfig_C, 采样间隔) == 0x000070, "Member 'UBP_SplineClimbConfig_C::采样间隔' has a wrong offset!");
static_assert(offsetof(UBP_SplineClimbConfig_C, 检测距离) == 0x000074, "Member 'UBP_SplineClimbConfig_C::检测距离' has a wrong offset!");
static_assert(offsetof(UBP_SplineClimbConfig_C, 检测起始偏移) == 0x000078, "Member 'UBP_SplineClimbConfig_C::检测起始偏移' has a wrong offset!");
static_assert(offsetof(UBP_SplineClimbConfig_C, 离墙额外距离) == 0x00007C, "Member 'UBP_SplineClimbConfig_C::离墙额外距离' has a wrong offset!");

}

