#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SeqNPC

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SeqNPC.BP_SeqNPC_C.ExecuteUbergraph_BP_SeqNPC
// 0x0018 (0x0018 - 0x0000)
struct BP_SeqNPC_C_ExecuteUbergraph_BP_SeqNPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroMaterialControllerComponent*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_ExecuteUbergraph_BP_SeqNPC;

// Function BP_SeqNPC.BP_SeqNPC_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SeqNPC_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_ReceiveTick;

// Function BP_SeqNPC.BP_SeqNPC_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_SeqNPC_C_UserConstructionScript final
{
public:
	TArray<class USkeletalMeshComponent*>         SKComps;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_UserConstructionScript;

// Function BP_SeqNPC.BP_SeqNPC_C.UpdateNpcByDa
// 0x0040 (0x0040 - 0x0000)
struct BP_SeqNPC_C_UpdateNpcByDa final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetupNpcMesh_IsSuc;                       // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_SetupNpcMesh_SkleMain;                    // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_UpdateNpcByDa;

// Function BP_SeqNPC.BP_SeqNPC_C.SetAnimDataVector
// 0x0058 (0x0058 - 0x0000)
struct BP_SeqNPC_C_SetAnimDataVector final
{
public:
	TMap<class FName, struct FVector>             VectorCurveData;                                   // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_SetAnimDataVector;

// Function BP_SeqNPC.BP_SeqNPC_C.SetAnimDataFloat
// 0x0018 (0x0018 - 0x0000)
struct BP_SeqNPC_C_SetAnimDataFloat final
{
public:
	TArray<struct FNamedCurveValue>               FloatCurveData;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_SetAnimDataFloat;

// Function BP_SeqNPC.BP_SeqNPC_C.GetSupportGroupNames
// 0x0020 (0x0020 - 0x0000)
struct BP_SeqNPC_C_GetSupportGroupNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_GetSupportGroupNames;

// Function BP_SeqNPC.BP_SeqNPC_C.GetAnimDataVector
// 0x0058 (0x0058 - 0x0000)
struct BP_SeqNPC_C_GetAnimDataVector final
{
public:
	TMap<class FName, struct FVector>             VectorCurveData;                                   // 0x0000(0x0050)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_GetAnimDataVector;

// Function BP_SeqNPC.BP_SeqNPC_C.GetAnimDataFloat
// 0x0018 (0x0018 - 0x0000)
struct BP_SeqNPC_C_GetAnimDataFloat final
{
public:
	TArray<struct FNamedCurveValue>               FloatCurveData;                                    // 0x0000(0x0010)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_GetAnimDataFloat;

// Function BP_SeqNPC.BP_SeqNPC_C.SetAnimDataTransform
// 0x0058 (0x0058 - 0x0000)
struct BP_SeqNPC_C_SetAnimDataTransform final
{
public:
	TMap<class FName, struct FTransform>          FloatCurveData;                                    // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_SetAnimDataTransform;

// Function BP_SeqNPC.BP_SeqNPC_C.IsCustomSupport
// 0x0001 (0x0001 - 0x0000)
struct BP_SeqNPC_C_IsCustomSupport final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_IsCustomSupport;

// Function BP_SeqNPC.BP_SeqNPC_C.GetAnimDataTransform
// 0x0058 (0x0058 - 0x0000)
struct BP_SeqNPC_C_GetAnimDataTransform final
{
public:
	TMap<class FName, struct FTransform>          FloatCurveData;                                    // 0x0000(0x0050)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_GetAnimDataTransform;

// Function BP_SeqNPC.BP_SeqNPC_C.GetABPC_Body_V2
// 0x0008 (0x0008 - 0x0000)
struct BP_SeqNPC_C_GetABPC_Body_V2 final
{
public:
	class UABPC_Seq_Body_V2_C*                    ABPC_Body_V2_0;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_GetABPC_Body_V2;

// Function BP_SeqNPC.BP_SeqNPC_C.GetSeqAudio
// 0x0008 (0x0008 - 0x0000)
struct BP_SeqNPC_C_GetSeqAudio final
{
public:
	class USeqAudio_Seq_V2_C*                     SeqAudio;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SeqNPC_C_GetSeqAudio;

}

