#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UiSceneRenderingComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UiSceneRenderingComponent.BP_UiSceneRenderingComponent_C
// 0x0030 (0x00F0 - 0x00C0)
class UBP_UiSceneRenderingComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_GlobalGI_C*                         BP_GlobalGI;                                       // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInUiSceneRenderingState;                         // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CurUiScenePath;                                    // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UDirectionalLightComponent*             MainLightComponent;                                // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UiSceneRenderingComponent(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Init(class ABP_GlobalGI_C* InGlobalGI);
	void OnKuroStartUiScene(const class FString& UiScenePath);
	void OnKuroEndUiScene();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_UiSceneRenderingComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_UiSceneRenderingComponent_C")
	}
	static class UBP_UiSceneRenderingComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UiSceneRenderingComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_UiSceneRenderingComponent_C;

}

