#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleConfig

#include "Basic.hpp"

#include "SFloatThresholdAndCameraShake_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SGameplayTagArray_structs.hpp"
#include "SInt64Array_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VehicleConfig.BP_VehicleConfig_C
// 0x02A0 (0x02D8 - 0x0038)
class UBP_VehicleConfig_C final : public UPrimaryDataAsset
{
public:
	struct FGameplayTagContainer                  载具出生Tag;                                       // 0x0038(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  载具乘坐期间Tag;                                   // 0x0058(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  角色乘坐期间Tag;                                   // 0x0078(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         弹射时间;                                          // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         弹射高度;                                          // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         打开滑翔伞延迟时间;                                // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCurveFloat>             弹射时间路径曲线;                                  // 0x00A8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UEffectModelGroup>       PreEnterEffect;                                    // 0x00D8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UEffectModelGroup>       PostEnterEffect;                                   // 0x0108(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CharacterControllerData_C> PreEnterMatEffect;                           // 0x0138(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CharacterControllerDataGroup_C> PostEnterMatEffect;                     // 0x0168(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FSGameplayTagArray> 驾驶员同步Tag;                              // 0x0198(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FSInt64Array> 驾驶员同步Buff;                                   // 0x01E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCurveFloat*                            前后输入映射曲线;                                  // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FSGameplayTagArray> 载具同步驾驶员Tag;                          // 0x0240(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSFloatThresholdAndCameraShake> 撞击震屏;                                          // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSFloatThresholdAndCameraShake> 撞击震屏Z;                                         // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         震屏CD;                                            // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSFloatThresholdAndCameraShake> 撞击震屏_第一人称;                                 // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSFloatThresholdAndCameraShake> 撞击震屏Z_第一人称;                                // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VehicleConfig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VehicleConfig_C")
	}
	static class UBP_VehicleConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VehicleConfig_C>();
	}
};
DUMPER7_ASSERTS_UBP_VehicleConfig_C;

}

