#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleConfig

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SGameplayTagArray_structs.hpp"
#include "SInt64Array_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VehicleConfig.BP_VehicleConfig_C
// 0x0258 (0x0290 - 0x0038)
class UBP_VehicleConfig_C final : public UPrimaryDataAsset
{
public:
	struct FGameplayTagContainer                  载具出生Tag;                                       // 0x0038(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  载具乘坐期间Tag;                                   // 0x0058(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  角色乘坐期间Tag;                                   // 0x0078(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         弹射时间;                                          // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         弹射高度;                                          // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         打开滑翔伞延迟时间;                                // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCurveFloat>             弹射时间路径曲线;                                  // 0x00A8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UEffectModelGroup>       PreEnterEffect;                                    // 0x00D8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UEffectModelGroup>       PostEnterEffect;                                   // 0x0108(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CharacterControllerData_C> PreEnterMatEffect;                           // 0x0138(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CharacterControllerDataGroup_C> PostEnterMatEffect;                     // 0x0168(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FSGameplayTagArray> 驾驶员同步Tag;                              // 0x0198(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FSInt64Array> 驾驶员同步Buff;                                   // 0x01E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCurveFloat*                            前后输入映射曲线;                                  // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FSGameplayTagArray> 载具同步驾驶员Tag;                          // 0x0240(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VehicleConfig_C">();
	}
	static class UBP_VehicleConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VehicleConfig_C>();
	}
};
static_assert(alignof(UBP_VehicleConfig_C) == 0x000008, "Wrong alignment on UBP_VehicleConfig_C");
static_assert(sizeof(UBP_VehicleConfig_C) == 0x000290, "Wrong size on UBP_VehicleConfig_C");
static_assert(offsetof(UBP_VehicleConfig_C, 载具出生Tag) == 0x000038, "Member 'UBP_VehicleConfig_C::载具出生Tag' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 载具乘坐期间Tag) == 0x000058, "Member 'UBP_VehicleConfig_C::载具乘坐期间Tag' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 角色乘坐期间Tag) == 0x000078, "Member 'UBP_VehicleConfig_C::角色乘坐期间Tag' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 弹射时间) == 0x000098, "Member 'UBP_VehicleConfig_C::弹射时间' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 弹射高度) == 0x00009C, "Member 'UBP_VehicleConfig_C::弹射高度' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 打开滑翔伞延迟时间) == 0x0000A0, "Member 'UBP_VehicleConfig_C::打开滑翔伞延迟时间' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 弹射时间路径曲线) == 0x0000A8, "Member 'UBP_VehicleConfig_C::弹射时间路径曲线' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, PreEnterEffect) == 0x0000D8, "Member 'UBP_VehicleConfig_C::PreEnterEffect' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, PostEnterEffect) == 0x000108, "Member 'UBP_VehicleConfig_C::PostEnterEffect' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, PreEnterMatEffect) == 0x000138, "Member 'UBP_VehicleConfig_C::PreEnterMatEffect' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, PostEnterMatEffect) == 0x000168, "Member 'UBP_VehicleConfig_C::PostEnterMatEffect' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 驾驶员同步Tag) == 0x000198, "Member 'UBP_VehicleConfig_C::驾驶员同步Tag' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 驾驶员同步Buff) == 0x0001E8, "Member 'UBP_VehicleConfig_C::驾驶员同步Buff' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 前后输入映射曲线) == 0x000238, "Member 'UBP_VehicleConfig_C::前后输入映射曲线' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 载具同步驾驶员Tag) == 0x000240, "Member 'UBP_VehicleConfig_C::载具同步驾驶员Tag' has a wrong offset!");

}

