#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VolumetricFogFalloff_SpotLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VolumetricFogFalloff_SpotLight.BP_VolumetricFogFalloff_SpotLight_C
// 0x0040 (0x0308 - 0x02C8)
class ABP_VolumetricFogFalloff_SpotLight_C final : public ASpotLight
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UKuroGameBudgetComponent*               KuroGameBudget;                                    // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         VolumetricFogIntensity;                            // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         currentDistance;                                   // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         brightness;                                        // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CameraVector;                                      // 0x02E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceEnd;                                       // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceStart;                                     // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_VolumetricFogFalloff_SpotLight(int32 EntryPoint);
	void TimerEvent();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SpotLightFunction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VolumetricFogFalloff_SpotLight_C">();
	}
	static class ABP_VolumetricFogFalloff_SpotLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VolumetricFogFalloff_SpotLight_C>();
	}
};
static_assert(alignof(ABP_VolumetricFogFalloff_SpotLight_C) == 0x000008, "Wrong alignment on ABP_VolumetricFogFalloff_SpotLight_C");
static_assert(sizeof(ABP_VolumetricFogFalloff_SpotLight_C) == 0x000308, "Wrong size on ABP_VolumetricFogFalloff_SpotLight_C");
static_assert(offsetof(ABP_VolumetricFogFalloff_SpotLight_C, UberGraphFrame) == 0x0002C8, "Member 'ABP_VolumetricFogFalloff_SpotLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricFogFalloff_SpotLight_C, KuroGameBudget) == 0x0002D0, "Member 'ABP_VolumetricFogFalloff_SpotLight_C::KuroGameBudget' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricFogFalloff_SpotLight_C, VolumetricFogIntensity) == 0x0002D8, "Member 'ABP_VolumetricFogFalloff_SpotLight_C::VolumetricFogIntensity' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricFogFalloff_SpotLight_C, currentDistance) == 0x0002DC, "Member 'ABP_VolumetricFogFalloff_SpotLight_C::currentDistance' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricFogFalloff_SpotLight_C, brightness) == 0x0002E0, "Member 'ABP_VolumetricFogFalloff_SpotLight_C::brightness' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricFogFalloff_SpotLight_C, CameraVector) == 0x0002E8, "Member 'ABP_VolumetricFogFalloff_SpotLight_C::CameraVector' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricFogFalloff_SpotLight_C, DistanceEnd) == 0x000300, "Member 'ABP_VolumetricFogFalloff_SpotLight_C::DistanceEnd' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricFogFalloff_SpotLight_C, DistanceStart) == 0x000304, "Member 'ABP_VolumetricFogFalloff_SpotLight_C::DistanceStart' has a wrong offset!");

}

