#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletCommonDataAsset

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BulletCommonDataAsset.BulletCommonDataAsset_C
// 0x00A0 (0x00D8 - 0x0038)
class UBulletCommonDataAsset_C final : public UPrimaryDataAsset
{
public:
	TArray<EObjectTypeQuery>                      TakeAim;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      Obstacles;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      HitPoint;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      FastMoveTraceBullet_Type1;                         // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      FastMoveTraceBullet_Type2;                         // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      FastMoveTraceBullet_Type3;                         // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      FastMoveTraceBullet_Type1_Special;                 // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      FastMoveTraceBullet_Type2_Special;                 // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      FastMoveTraceBullet_Only_Bullet;                   // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         OnHitMaterialDelay;                                // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnHitMaterialDuration;                             // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnHitMaterialCd;                                   // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BulletCommonDataAsset_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BulletCommonDataAsset_C")
	}
	static class UBulletCommonDataAsset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBulletCommonDataAsset_C>();
	}
};
DUMPER7_ASSERTS_UBulletCommonDataAsset_C;

}

