#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BvbCardItemData

#include "Basic.hpp"

#include "BvbEffectItemData_structs.hpp"


namespace SDK
{

// UserDefinedStruct BvbCardItemData.BvbCardItemData
// 0x0060 (0x0060 - 0x0000)
struct FBvbCardItemData final
{
public:
	class FString                                 CardName_2_09B4CC7448616448DF60BCA1177648BB;       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Cost_4_A13B9873411C67FD0CCD79ABCF506D50;           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Element_6_30627EB24686A109F674BDB43452CFB7;        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Power_9_873E1257441A0E7FBE2FA5BCF34570DC;          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CardDesc_17_2A7DED6048DA336B8764808C8D0E52D0;      // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FBvbEffectItemData>             EffectList_13_2434410D4C73BBD038D1DF9D2DCED3F8;    // 0x0050(0x0010)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FBvbCardItemData;

}

