#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterBlueprintFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ESelfCenteredMode_structs.hpp"
#include "SEntityTimeDilation_structs.hpp"


namespace SDK::Params
{

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.SetPartCollisionSwitch
// 0x0028 (0x0028 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_SetPartCollisionSwitch final
{
public:
	class ATsBaseCharacter_C*                     character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 compName;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          isBlockPawn;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          isBulletDetect;                                    // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          isBlockCamera;                                     // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_SetPartCollisionSwitch;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetCharacterActorByEntityId
// 0x0018 (0x0018 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetCharacterActorByEntityId final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetCharacterActorByEntityId;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.CharacterOperationRecord
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_CharacterOperationRecord final
{
public:
	bool                                          open;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_CharacterOperationRecord;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.SaveCharacterOperationRecord
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_SaveCharacterOperationRecord final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_SaveCharacterOperationRecord;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetOperationRecordCount
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetOperationRecordCount final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetOperationRecordCount;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.CleanupOperationRecord
// 0x0008 (0x0008 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_CleanupOperationRecord final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_CleanupOperationRecord;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.SetHalfLengthRecord
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_SetHalfLengthRecord final
{
public:
	float                                         sideLenHalf;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_SetHalfLengthRecord;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetStatisticsOpen
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetStatisticsOpen final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetStatisticsOpen;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.ResetPartCollisionSwitch
// 0x0020 (0x0020 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_ResetPartCollisionSwitch final
{
public:
	class ATsBaseCharacter_C*                     character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 compName;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_ResetPartCollisionSwitch;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.TestLeaveSplineMove
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_TestLeaveSplineMove final
{
public:
	class ATsBaseCharacter_C*                     actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_TestLeaveSplineMove;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.SetCurrentAttacker
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_SetCurrentAttacker final
{
public:
	int32                                         index;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_SetCurrentAttacker;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetItemsReset
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetItemsReset final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetItemsReset;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetSubItemsListView
// 0x0020 (0x0020 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetSubItemsListView final
{
public:
	int32                                         startIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         length;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetSubItemsListView;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetItemListViewCount
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetItemListViewCount final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetItemListViewCount;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.SetCombatStarted
// 0x0020 (0x0020 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_SetCombatStarted final
{
public:
	bool                                          started;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         attackerIndex1;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         targetIndex1;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          isDamage;                                          // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isCure;                                            // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isSkillUsed;                                       // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isState;                                           // 0x000F(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isKill;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isReborn;                                          // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_SetCombatStarted;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.SetTypeOpen
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_SetTypeOpen final
{
public:
	bool                                          isDamage;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isCure;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isSkillUsed;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isState;                                           // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isKill;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isReborn;                                          // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_SetTypeOpen;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetTargetCombatEntities
// 0x0018 (0x0018 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetTargetCombatEntities final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetTargetCombatEntities;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetAttackerCombatEntities
// 0x0018 (0x0018 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetAttackerCombatEntities final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetAttackerCombatEntities;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.SetCurrentTarget
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_SetCurrentTarget final
{
public:
	int32                                         index;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_SetCurrentTarget;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.OnItemsResetFinished
// 0x0008 (0x0008 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_OnItemsResetFinished final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_OnItemsResetFinished;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetBaseCharacterTransform
// 0x0050 (0x0050 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetBaseCharacterTransform final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetBaseCharacterTransform;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.SetActorExtraSkeletalMeshComponent
// 0x0018 (0x0018 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_SetActorExtraSkeletalMeshComponent final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 skeletalMeshComponent;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_SetActorExtraSkeletalMeshComponent;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.CanCharacterMonsterOrSummonedDisplayEffect
// 0x0018 (0x0018 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_CanCharacterMonsterOrSummonedDisplayEffect final
{
public:
	class ATsBaseCharacter_C*                     owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_CanCharacterMonsterOrSummonedDisplayEffect;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.DetachFromHost
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_DetachFromHost final
{
public:
	int32                                         id1;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isDetachFollower;                                  // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isRecursion;                                       // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_DetachFromHost;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetCharacterGravityDirect
// 0x0020 (0x0020 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetCharacterGravityDirect final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetCharacterGravityDirect;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetCharacterGravityUp
// 0x0020 (0x0020 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetCharacterGravityUp final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetCharacterGravityUp;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.SetGravityDirect
// 0x0028 (0x0028 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_SetGravityDirect final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          gravityDirect;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_SetGravityDirect;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.EnableSelfCentered
// 0x0018 (0x0018 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_EnableSelfCentered final
{
public:
	ESelfCenteredMode                             selfCenteredMode;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         timeDilation;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         duration1;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_EnableSelfCentered;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.DisableSelfCentered
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_DisableSelfCentered final
{
public:
	ESelfCenteredMode                             selfCenteredMode;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_DisableSelfCentered;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetEntityForeverTimeDilation
// 0x0018 (0x0018 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetEntityForeverTimeDilation final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSEntityTimeDilation                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetEntityForeverTimeDilation;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetSelfCenteredMode
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetSelfCenteredMode final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESelfCenteredMode                             ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetSelfCenteredMode;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetSelfCenteredTimeDilation
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetSelfCenteredTimeDilation final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetSelfCenteredTimeDilation;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetInverseSelfCenteredTimeDilation
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetInverseSelfCenteredTimeDilation final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetInverseSelfCenteredTimeDilation;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.IsSelfCenteredModeEnabled
// 0x0018 (0x0018 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_IsSelfCenteredModeEnabled final
{
public:
	ESelfCenteredMode                             selfCenteredMode;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_IsSelfCenteredModeEnabled;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.IsAnySelfCenteredModeEnabled
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_IsAnySelfCenteredModeEnabled final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_IsAnySelfCenteredModeEnabled;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.SetPlanarReflectionShowPlayers
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_SetPlanarReflectionShowPlayers final
{
public:
	class UPlanarReflectionComponent*             comp;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_SetPlanarReflectionShowPlayers;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.SetCharacterDirectlySightLockEnableState
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_SetCharacterDirectlySightLockEnableState final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_SetCharacterDirectlySightLockEnableState;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.RestoreSightLockBoneLimit
// 0x0010 (0x0010 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_RestoreSightLockBoneLimit final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_RestoreSightLockBoneLimit;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.SetCharacterSightLockBoneLimit
// 0x0038 (0x0038 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_SetCharacterSightLockBoneLimit final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         yawMin;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         yawMax;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         pitchMin;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         pitchMax;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         assistLimit;                                       // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                sightDirectInSightBone;                            // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                upAxisInSightBone;                                 // 0x0024(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_SetCharacterSightLockBoneLimit;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetCharacterMovementModeInfo
// 0x0020 (0x0020 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetCharacterMovementModeInfo final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetCharacterMovementModeInfo;

// Function CharacterBlueprintFunctionLibrary.CharacterBlueprintFunctionLibrary_C.GetCharacterMovementStateInfo
// 0x0020 (0x0020 - 0x0000)
struct CharacterBlueprintFunctionLibrary_C_GetCharacterMovementStateInfo final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterBlueprintFunctionLibrary_C_GetCharacterMovementStateInfo;

}

