#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharRenderingComponent

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "ECharacterRenderingType_structs.hpp"
#include "ECharacterBodySpecifiedType_structs.hpp"
#include "ECharacterControllerCaseType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ECharacterDitherType_structs.hpp"
#include "ECharacterSlotSpecifiedType_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CharRenderingComponent.CharRenderingComponent_C.ExecuteUbergraph_CharRenderingComponent
// 0x000C (0x000C - 0x0000)
struct CharRenderingComponent_C_ExecuteUbergraph_CharRenderingComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_ExecuteUbergraph_CharRenderingComponent;

// Function CharRenderingComponent.CharRenderingComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CharRenderingComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_ReceiveTick;

// Function CharRenderingComponent.CharRenderingComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct CharRenderingComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_ReceiveEndPlay;

// Function CharRenderingComponent.CharRenderingComponent_C.Init
// 0x0001 (0x0001 - 0x0000)
struct CharRenderingComponent_C_Init final
{
public:
	ECharacterRenderingType                       renderType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_Init;

// Function CharRenderingComponent.CharRenderingComponent_C.RemoveMaterialControllerData
// 0x0004 (0x0004 - 0x0000)
struct CharRenderingComponent_C_RemoveMaterialControllerData final
{
public:
	int32                                         handle1;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_RemoveMaterialControllerData;

// Function CharRenderingComponent.CharRenderingComponent_C.AddMaterialControllerData
// 0x0010 (0x0010 - 0x0000)
struct CharRenderingComponent_C_AddMaterialControllerData final
{
public:
	class UObject*                                data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_AddMaterialControllerData;

// Function CharRenderingComponent.CharRenderingComponent_C.RemoveMaterialControllerDataWithEnding
// 0x0004 (0x0004 - 0x0000)
struct CharRenderingComponent_C_RemoveMaterialControllerDataWithEnding final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_RemoveMaterialControllerDataWithEnding;

// Function CharRenderingComponent.CharRenderingComponent_C.AddMaterialControllerDataGroup
// 0x0010 (0x0010 - 0x0000)
struct CharRenderingComponent_C_AddMaterialControllerDataGroup final
{
public:
	class UObject*                                data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_AddMaterialControllerDataGroup;

// Function CharRenderingComponent.CharRenderingComponent_C.RemoveMaterialControllerDataGroup
// 0x0004 (0x0004 - 0x0000)
struct CharRenderingComponent_C_RemoveMaterialControllerDataGroup final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_RemoveMaterialControllerDataGroup;

// Function CharRenderingComponent.CharRenderingComponent_C.CheckInit
// 0x0001 (0x0001 - 0x0000)
struct CharRenderingComponent_C_CheckInit final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_CheckInit;

// Function CharRenderingComponent.CharRenderingComponent_C.SetDebug
// 0x0001 (0x0001 - 0x0000)
struct CharRenderingComponent_C_SetDebug final
{
public:
	bool                                          value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetDebug;

// Function CharRenderingComponent.CharRenderingComponent_C.GetDebugInfo
// 0x0008 (0x0008 - 0x0000)
struct CharRenderingComponent_C_GetDebugInfo final
{
public:
	class UPD_MaterialDebug_C*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_GetDebugInfo;

// Function CharRenderingComponent.CharRenderingComponent_C.AddComponent
// 0x0018 (0x0018 - 0x0000)
struct CharRenderingComponent_C_AddComponent final
{
public:
	class FString                                 skelName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UMeshComponent*                         skeletalComp;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_AddComponent;

// Function CharRenderingComponent.CharRenderingComponent_C.RemoveComponent
// 0x0010 (0x0010 - 0x0000)
struct CharRenderingComponent_C_RemoveComponent final
{
public:
	class FString                                 skelName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_RemoveComponent;

// Function CharRenderingComponent.CharRenderingComponent_C.SetMaterialPropertyFloat
// 0x0028 (0x0028 - 0x0000)
struct CharRenderingComponent_C_SetMaterialPropertyFloat final
{
public:
	ECharacterBodySpecifiedType                   bodyType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         sectionIndex;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ECharacterSlotSpecifiedType                   slotType;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 propertyName;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         value;                                             // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetMaterialPropertyFloat;

// Function CharRenderingComponent.CharRenderingComponent_C.SetMaterialPropertyColor
// 0x0030 (0x0030 - 0x0000)
struct CharRenderingComponent_C_SetMaterialPropertyColor final
{
public:
	ECharacterBodySpecifiedType                   bodyType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         sectionIndex;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ECharacterSlotSpecifiedType                   slotType;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 propertyName;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           value;                                             // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetMaterialPropertyColor;

// Function CharRenderingComponent.CharRenderingComponent_C.SetCapsuleDither
// 0x0004 (0x0004 - 0x0000)
struct CharRenderingComponent_C_SetCapsuleDither final
{
public:
	float                                         value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetCapsuleDither;

// Function CharRenderingComponent.CharRenderingComponent_C.SetDitherEffect
// 0x0008 (0x0008 - 0x0000)
struct CharRenderingComponent_C_SetDitherEffect final
{
public:
	float                                         ditherRate;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ECharacterDitherType                          ditherType;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetDitherEffect;

// Function CharRenderingComponent.CharRenderingComponent_C.RemoveMaterialControllerDataGroupWithEnding
// 0x0004 (0x0004 - 0x0000)
struct CharRenderingComponent_C_RemoveMaterialControllerDataGroupWithEnding final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_RemoveMaterialControllerDataGroupWithEnding;

// Function CharRenderingComponent.CharRenderingComponent_C.QuickInitAndAddDataGroup
// 0x0018 (0x0018 - 0x0000)
struct CharRenderingComponent_C_QuickInitAndAddDataGroup final
{
public:
	class UObject*                                data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ASkeletalMeshActor*                     meshActor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_QuickInitAndAddDataGroup;

// Function CharRenderingComponent.CharRenderingComponent_C.AddComponentByCase
// 0x0010 (0x0010 - 0x0000)
struct CharRenderingComponent_C_AddComponentByCase final
{
public:
	ECharacterControllerCaseType                  caseType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         skeletalComp;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_AddComponentByCase;

// Function CharRenderingComponent.CharRenderingComponent_C.QuickInitAndAddDataWithMeshComponent
// 0x0018 (0x0018 - 0x0000)
struct CharRenderingComponent_C_QuickInitAndAddDataWithMeshComponent final
{
public:
	class UObject*                                data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UMeshComponent*                         meshComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_QuickInitAndAddDataWithMeshComponent;

// Function CharRenderingComponent.CharRenderingComponent_C.GetInWater
// 0x0008 (0x0008 - 0x0000)
struct CharRenderingComponent_C_GetInWater final
{
public:
	float                                         depthThreshold;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_GetInWater;

// Function CharRenderingComponent.CharRenderingComponent_C.SetEffectProgress
// 0x0008 (0x0008 - 0x0000)
struct CharRenderingComponent_C_SetEffectProgress final
{
public:
	float                                         progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         handleId;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetEffectProgress;

// Function CharRenderingComponent.CharRenderingComponent_C.RemoveComponentByCase
// 0x0001 (0x0001 - 0x0000)
struct CharRenderingComponent_C_RemoveComponentByCase final
{
public:
	ECharacterControllerCaseType                  caseType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_RemoveComponentByCase;

// Function CharRenderingComponent.CharRenderingComponent_C.SetBodyEffectOpacity
// 0x0004 (0x0004 - 0x0000)
struct CharRenderingComponent_C_SetBodyEffectOpacity final
{
public:
	float                                         opacity;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetBodyEffectOpacity;

// Function CharRenderingComponent.CharRenderingComponent_C.QuickInitAndAddDataGroupWithMeshComponent
// 0x0018 (0x0018 - 0x0000)
struct CharRenderingComponent_C_QuickInitAndAddDataGroupWithMeshComponent final
{
public:
	class UObject*                                data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         meshComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_QuickInitAndAddDataGroupWithMeshComponent;

// Function CharRenderingComponent.CharRenderingComponent_C.SetDecalShadowEnabled
// 0x0001 (0x0001 - 0x0000)
struct CharRenderingComponent_C_SetDecalShadowEnabled final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetDecalShadowEnabled;

// Function CharRenderingComponent.CharRenderingComponent_C.AddComponentForDecalShadow
// 0x0018 (0x0018 - 0x0000)
struct CharRenderingComponent_C_AddComponentForDecalShadow final
{
public:
	class FString                                 name;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    comp;                                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_AddComponentForDecalShadow;

// Function CharRenderingComponent.CharRenderingComponent_C.RemoveComponentFromDecalShadow
// 0x0010 (0x0010 - 0x0000)
struct CharRenderingComponent_C_RemoveComponentFromDecalShadow final
{
public:
	class FString                                 name;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_RemoveComponentFromDecalShadow;

// Function CharRenderingComponent.CharRenderingComponent_C.ReceiveSeqTick
// 0x0004 (0x0004 - 0x0000)
struct CharRenderingComponent_C_ReceiveSeqTick final
{
public:
	float                                         deltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_ReceiveSeqTick;

// Function CharRenderingComponent.CharRenderingComponent_C.SetLogicOwner
// 0x0008 (0x0008 - 0x0000)
struct CharRenderingComponent_C_SetLogicOwner final
{
public:
	class AActor*                                 owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetLogicOwner;

// Function CharRenderingComponent.CharRenderingComponent_C.GetTimeDilation
// 0x0004 (0x0004 - 0x0000)
struct CharRenderingComponent_C_GetTimeDilation final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_GetTimeDilation;

// Function CharRenderingComponent.CharRenderingComponent_C.SetRealtimeShadowEnabled
// 0x0001 (0x0001 - 0x0000)
struct CharRenderingComponent_C_SetRealtimeShadowEnabled final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetRealtimeShadowEnabled;

// Function CharRenderingComponent.CharRenderingComponent_C.SetDecalShadowOpacity
// 0x0004 (0x0004 - 0x0000)
struct CharRenderingComponent_C_SetDecalShadowOpacity final
{
public:
	float                                         opacity;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetDecalShadowOpacity;

// Function CharRenderingComponent.CharRenderingComponent_C.SetRealtimeShadowOpacity
// 0x0004 (0x0004 - 0x0000)
struct CharRenderingComponent_C_SetRealtimeShadowOpacity final
{
public:
	float                                         opacity;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetRealtimeShadowOpacity;

// Function CharRenderingComponent.CharRenderingComponent_C.SetDisableFightDither
// 0x0001 (0x0001 - 0x0000)
struct CharRenderingComponent_C_SetDisableFightDither final
{
public:
	bool                                          disable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetDisableFightDither;

// Function CharRenderingComponent.CharRenderingComponent_C.AddComponentInnerV2
// 0x0020 (0x0020 - 0x0000)
struct CharRenderingComponent_C_AddComponentInnerV2 final
{
public:
	class FString                                 skelName1;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UMeshComponent*                         skeletalComp1;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          useEmptyMaterial;                                  // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_AddComponentInnerV2;

// Function CharRenderingComponent.CharRenderingComponent_C.RemoveComponentInnerV2
// 0x0010 (0x0010 - 0x0000)
struct CharRenderingComponent_C_RemoveComponentInnerV2 final
{
public:
	class FString                                 skelName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_RemoveComponentInnerV2;

// Function CharRenderingComponent.CharRenderingComponent_C.SetEffectPause
// 0x0008 (0x0008 - 0x0000)
struct CharRenderingComponent_C_SetEffectPause final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          paused;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetEffectPause;

// Function CharRenderingComponent.CharRenderingComponent_C.GetSkeletalMeshComponent
// 0x0018 (0x0018 - 0x0000)
struct CharRenderingComponent_C_GetSkeletalMeshComponent final
{
public:
	class FString                                 skelName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_GetSkeletalMeshComponent;

// Function CharRenderingComponent.CharRenderingComponent_C.AddComponentWithEmptyMaterial
// 0x0018 (0x0018 - 0x0000)
struct CharRenderingComponent_C_AddComponentWithEmptyMaterial final
{
public:
	class FString                                 skelName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UMeshComponent*                         skeletalComp;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_AddComponentWithEmptyMaterial;

// Function CharRenderingComponent.CharRenderingComponent_C.SetStarScarEnergy
// 0x0004 (0x0004 - 0x0000)
struct CharRenderingComponent_C_SetStarScarEnergy final
{
public:
	float                                         value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetStarScarEnergy;

// Function CharRenderingComponent.CharRenderingComponent_C.AddMaterialControllerDataWithAnimObject
// 0x0020 (0x0020 - 0x0000)
struct CharRenderingComponent_C_AddMaterialControllerDataWithAnimObject final
{
public:
	class UObject*                                data1;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 animObject;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                userData;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_AddMaterialControllerDataWithAnimObject;

// Function CharRenderingComponent.CharRenderingComponent_C.AddMaterialControllerDataGroupWithAnimObject
// 0x0018 (0x0018 - 0x0000)
struct CharRenderingComponent_C_AddMaterialControllerDataGroupWithAnimObject final
{
public:
	class UObject*                                data1;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 animObject;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_AddMaterialControllerDataGroupWithAnimObject;

// Function CharRenderingComponent.CharRenderingComponent_C.ShouldTickAfterGoDown
// 0x0001 (0x0001 - 0x0000)
struct CharRenderingComponent_C_ShouldTickAfterGoDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_ShouldTickAfterGoDown;

// Function CharRenderingComponent.CharRenderingComponent_C.SetMaterialPropertyFloatV2
// 0x0014 (0x0014 - 0x0000)
struct CharRenderingComponent_C_SetMaterialPropertyFloatV2 final
{
public:
	class FName                                   name;                                              // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         value;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroCharBodySpecifiedType                    bodyType;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroCharSlotSpecifiedType                    slotType;                                          // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroCharMeshPart                             meshPart;                                          // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetMaterialPropertyFloatV2;

// Function CharRenderingComponent.CharRenderingComponent_C.SetMaterialPropertyColorV2
// 0x0020 (0x0020 - 0x0000)
struct CharRenderingComponent_C_SetMaterialPropertyColorV2 final
{
public:
	class FName                                   name;                                              // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           value;                                             // 0x000C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroCharBodySpecifiedType                    bodyType;                                          // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroCharSlotSpecifiedType                    slotType;                                          // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroCharMeshPart                             meshPart;                                          // 0x001E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetMaterialPropertyColorV2;

// Function CharRenderingComponent.CharRenderingComponent_C.SetMaterialReplaceV2
// 0x0010 (0x0010 - 0x0000)
struct CharRenderingComponent_C_SetMaterialReplaceV2 final
{
public:
	class UMaterialInterface*                     material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroCharBodySpecifiedType                    bodyType;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroCharSlotSpecifiedType                    slotType;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroCharMeshPart                             meshPart;                                          // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetMaterialReplaceV2;

// Function CharRenderingComponent.CharRenderingComponent_C.RemoveExternalMaterialReplaceV2
// 0x0003 (0x0003 - 0x0000)
struct CharRenderingComponent_C_RemoveExternalMaterialReplaceV2 final
{
public:
	EKuroCharBodySpecifiedType                    bodyType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroCharSlotSpecifiedType                    slotType;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroCharMeshPart                             meshPart;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_RemoveExternalMaterialReplaceV2;

// Function CharRenderingComponent.CharRenderingComponent_C.GetSkeletalMeshComponentBodyName
// 0x0018 (0x0018 - 0x0000)
struct CharRenderingComponent_C_GetSkeletalMeshComponentBodyName final
{
public:
	class USkeletalMeshComponent*                 skeletalComp;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_GetSkeletalMeshComponentBodyName;

// Function CharRenderingComponent.CharRenderingComponent_C.AddFloatUpdateParamPermanentByIndexV2
// 0x0020 (0x0020 - 0x0000)
struct CharRenderingComponent_C_AddFloatUpdateParamPermanentByIndexV2 final
{
public:
	class FName                                   name;                                              // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         value;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   bodyName;                                          // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         materialIndex;                                     // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_AddFloatUpdateParamPermanentByIndexV2;

// Function CharRenderingComponent.CharRenderingComponent_C.SetEffectGroupProgress
// 0x0008 (0x0008 - 0x0000)
struct CharRenderingComponent_C_SetEffectGroupProgress final
{
public:
	float                                         progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         groupHandleId;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetEffectGroupProgress;

// Function CharRenderingComponent.CharRenderingComponent_C.GetOpacityConsiderVisibility
// 0x0004 (0x0004 - 0x0000)
struct CharRenderingComponent_C_GetOpacityConsiderVisibility final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_GetOpacityConsiderVisibility;

// Function CharRenderingComponent.CharRenderingComponent_C.SetShouldCastShadow
// 0x0001 (0x0001 - 0x0000)
struct CharRenderingComponent_C_SetShouldCastShadow final
{
public:
	bool                                          castShadow;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetShouldCastShadow;

// Function CharRenderingComponent.CharRenderingComponent_C.SetDitherUseHeadMaskHideEffect
// 0x0001 (0x0001 - 0x0000)
struct CharRenderingComponent_C_SetDitherUseHeadMaskHideEffect final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_SetDitherUseHeadMaskHideEffect;

// Function CharRenderingComponent.CharRenderingComponent_C.GetInAudioShr
// 0x0001 (0x0001 - 0x0000)
struct CharRenderingComponent_C_GetInAudioShr final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_GetInAudioShr;

// Function CharRenderingComponent.CharRenderingComponent_C.QuickInitAndAddData
// 0x0018 (0x0018 - 0x0000)
struct CharRenderingComponent_C_QuickInitAndAddData final
{
public:
	class UObject*                                data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASkeletalMeshActor*                     meshActor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharRenderingComponent_C_QuickInitAndAddData;

}

