#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ColorCorrectRegions

#include "Basic.hpp"

#include "ColorCorrectRegions_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ColorCorrectRegions.ColorCorrectRegion
// 0x0180 (0x0430 - 0x02B0)
class AColorCorrectRegion final : public AActor
{
public:
	EColorCorrectRegionsType                      Type;                                              // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Priority;                                          // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Intensity;                                         // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Inner;                                             // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Outer_0;                                           // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Invert;                                            // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temperature;                                       // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColorGradingSettings                  ColorGradingSettings;                              // 0x02D0(0x0150)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ExcludeStencil;                                    // 0x0421(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_422[0xE];                                      // 0x0422(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ColorCorrectRegion")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ColorCorrectRegion")
	}
	static class AColorCorrectRegion* GetDefaultObj()
	{
		return GetDefaultObjImpl<AColorCorrectRegion>();
	}
};
DUMPER7_ASSERTS_AColorCorrectRegion;

// Class ColorCorrectRegions.ColorCorrectRegionsSubsystem
// 0x0050 (0x0088 - 0x0038)
class UColorCorrectRegionsSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActorDeleted(class AActor* InActor);
	void OnActorSpawned(class AActor* InActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ColorCorrectRegionsSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ColorCorrectRegionsSubsystem")
	}
	static class UColorCorrectRegionsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColorCorrectRegionsSubsystem>();
	}
};
DUMPER7_ASSERTS_UColorCorrectRegionsSubsystem;

}

