#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FastGeoStreaming

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class FastGeoStreaming.FastGeoWorldSubsystem
// 0x0058 (0x00A0 - 0x0048)
class UFastGeoWorldSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_48[0x58];                                      // 0x0048(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FastGeoWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FastGeoWorldSubsystem")
	}
	static class UFastGeoWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFastGeoWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_UFastGeoWorldSubsystem;

// Class FastGeoStreaming.FastGeoComponentEditorProxy
// 0x0000 (0x0030 - 0x0030)
class UFastGeoComponentEditorProxy : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FastGeoComponentEditorProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FastGeoComponentEditorProxy")
	}
	static class UFastGeoComponentEditorProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFastGeoComponentEditorProxy>();
	}
};
DUMPER7_ASSERTS_UFastGeoComponentEditorProxy;

// Class FastGeoStreaming.FastGeoContainer
// 0x00E0 (0x0110 - 0x0030)
class UFastGeoContainer final : public UAssetUserData
{
public:
	uint8                                         Pad_30[0xA8];                                      // 0x0030(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        Assets;                                            // 0x00D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x28];                                      // 0x00E8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FastGeoContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FastGeoContainer")
	}
	static class UFastGeoContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFastGeoContainer>();
	}
};
DUMPER7_ASSERTS_UFastGeoContainer;

// Class FastGeoStreaming.FastGeoPrimitiveComponentEditorProxy
// 0x0000 (0x0030 - 0x0030)
class UFastGeoPrimitiveComponentEditorProxy : public UFastGeoComponentEditorProxy
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FastGeoPrimitiveComponentEditorProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FastGeoPrimitiveComponentEditorProxy")
	}
	static class UFastGeoPrimitiveComponentEditorProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFastGeoPrimitiveComponentEditorProxy>();
	}
};
DUMPER7_ASSERTS_UFastGeoPrimitiveComponentEditorProxy;

// Class FastGeoStreaming.FastGeoStaticMeshComponentEditorProxy
// 0x0008 (0x0038 - 0x0030)
class UFastGeoStaticMeshComponentEditorProxy final : public UFastGeoPrimitiveComponentEditorProxy
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FastGeoStaticMeshComponentEditorProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FastGeoStaticMeshComponentEditorProxy")
	}
	static class UFastGeoStaticMeshComponentEditorProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFastGeoStaticMeshComponentEditorProxy>();
	}
};
DUMPER7_ASSERTS_UFastGeoStaticMeshComponentEditorProxy;

// Class FastGeoStreaming.FastGeoWorldPartitionRuntimeCellTransformer
// 0x0000 (0x0038 - 0x0038)
class UFastGeoWorldPartitionRuntimeCellTransformer final : public UWorldPartitionRuntimeCellTransformer
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FastGeoWorldPartitionRuntimeCellTransformer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FastGeoWorldPartitionRuntimeCellTransformer")
	}
	static class UFastGeoWorldPartitionRuntimeCellTransformer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFastGeoWorldPartitionRuntimeCellTransformer>();
	}
};
DUMPER7_ASSERTS_UFastGeoWorldPartitionRuntimeCellTransformer;

}

