#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSRTUModule

#include "Basic.hpp"

#include "GSRTUModule_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class GSRTUModule.GSRSettings
// 0x0010 (0x0058 - 0x0048)
class UGSRSettings final : public UDeveloperSettings
{
public:
	bool                                          bEnabled;                                          // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoExposure;                                      // 0x0049(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	EGSRQualityMode                               QualityMode;                                       // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSRHistoryFormat                             HistoryFormat;                                     // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AdjustMipBias;                                     // 0x0054(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceVertexDeformationOutputsVelocity;             // 0x0055(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSRSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSRSettings")
	}
	static class UGSRSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSRSettings>();
	}
};
DUMPER7_ASSERTS_UGSRSettings;

}

