#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HotFixLGUIEventSystemActor

#include "Basic.hpp"

#include "LGUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass HotFixLGUIEventSystemActor.HotFixLGUIEventSystemActor_C
// 0x0060 (0x0318 - 0x02B8)
class AHotFixLGUIEventSystemActor_C final : public ALGUIEventSystemActor
{
public:
	class ULGUI_TouchInputModule*                 LGUI_TouchInputModule;                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULGUI_StandaloneInputModule*            LGUI_StandaloneInputModule;                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULGUI_PointerInputModule*               ValidInputModule;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(float AxisValue)> OnMiddleMouseScroll;                             // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool TouchPress, int32 TouchID, const struct FVector& TouchPointPosition)> OnTouch; // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(int32 TouchID, const struct FVector& TouchPointPosition)> OnTouchMove; // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FKey& KeyCode, bool IsPress)> OnClickKey;             // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HotFixLGUIEventSystemActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HotFixLGUIEventSystemActor_C")
	}
	static class AHotFixLGUIEventSystemActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHotFixLGUIEventSystemActor_C>();
	}
};
DUMPER7_ASSERTS_AHotFixLGUIEventSystemActor_C;

}

