#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JsEnv

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "JsEnv_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class JsEnv.JSAnimGeneratedClass
// 0x0020 (0x05F0 - 0x05D0)
class UJSAnimGeneratedClass final : public UAnimBlueprintGeneratedClass
{
public:
	uint8                                         Pad_5D0[0x20];                                     // 0x05D0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JSAnimGeneratedClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JSAnimGeneratedClass")
	}
	static class UJSAnimGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJSAnimGeneratedClass>();
	}
};
DUMPER7_ASSERTS_UJSAnimGeneratedClass;

// Class JsEnv.DynamicDelegateProxy
// 0x0078 (0x00A8 - 0x0030)
class UDynamicDelegateProxy final : public UObject
{
public:
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Fire1();
	void Fire10();
	void Fire100();
	void Fire11();
	void Fire12();
	void Fire13();
	void Fire14();
	void Fire15();
	void Fire16();
	void Fire17();
	void Fire18();
	void Fire19();
	void Fire2();
	void Fire20();
	void Fire21();
	void Fire22();
	void Fire23();
	void Fire24();
	void Fire25();
	void Fire26();
	void Fire27();
	void Fire28();
	void Fire29();
	void Fire3();
	void Fire30();
	void Fire31();
	void Fire32();
	void Fire33();
	void Fire34();
	void Fire35();
	void Fire36();
	void Fire37();
	void Fire38();
	void Fire39();
	void Fire4();
	void Fire40();
	void Fire41();
	void Fire42();
	void Fire43();
	void Fire44();
	void Fire45();
	void Fire46();
	void Fire47();
	void Fire48();
	void Fire49();
	void Fire5();
	void Fire50();
	void Fire51();
	void Fire52();
	void Fire53();
	void Fire54();
	void Fire55();
	void Fire56();
	void Fire57();
	void Fire58();
	void Fire59();
	void Fire6();
	void Fire60();
	void Fire61();
	void Fire62();
	void Fire63();
	void Fire64();
	void Fire65();
	void Fire66();
	void Fire67();
	void Fire68();
	void Fire69();
	void Fire7();
	void Fire70();
	void Fire71();
	void Fire72();
	void Fire73();
	void Fire74();
	void Fire75();
	void Fire76();
	void Fire77();
	void Fire78();
	void Fire79();
	void Fire8();
	void Fire80();
	void Fire81();
	void Fire82();
	void Fire83();
	void Fire84();
	void Fire85();
	void Fire86();
	void Fire87();
	void Fire88();
	void Fire89();
	void Fire9();
	void Fire90();
	void Fire91();
	void Fire92();
	void Fire93();
	void Fire94();
	void Fire95();
	void Fire96();
	void Fire97();
	void Fire98();
	void Fire99();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicDelegateProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicDelegateProxy")
	}
	static class UDynamicDelegateProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicDelegateProxy>();
	}
};
DUMPER7_ASSERTS_UDynamicDelegateProxy;

// Class JsEnv.JsEnvSetting
// 0x00A8 (0x00D8 - 0x0030)
class UJsEnvSetting final : public UObject
{
public:
	class FString                                 JsRootPath;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RawJsRootPath;                                     // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 JsByteCodeRoot;                                    // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 JsMockCodeRoot;                                    // 0x0060(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 V8Flags;                                           // 0x0070(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EV8GCType                                     MemoryWaringBehavior;                              // 0x0080(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        MaxYoungGenerationSizeInMB;                        // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        EditorMaxOldGenerationSizeInMB;                    // 0x0088(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MinorGCIdleBudgetInMicroSec;                       // 0x008C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        V8IdleMinTimeInMicroSec;                           // 0x0090(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        V8EditorTickIdleMinTimeInMicroSec;                 // 0x0094(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MinorGCIdleIntervalInMilliSec;                     // 0x0098(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPumpMessageLoopCountPerFrame;                   // 0x009C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         V8MaxThreadPoolSize;                               // 0x00A0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         V8ThreadPoolSizePercent;                           // 0x00A4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        StackTraceOption;                                  // 0x00A8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReportDeoptFrameInfoThreshold;                     // 0x00AC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableMinorGCInTick;                               // 0x00B0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnablePreloadJS;                                   // 0x00B1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableCheckBlueprintBind;                          // 0x00B2(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         IgnoreCheckBlueprintBindDirs;                      // 0x00B8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          EnableV8Print;                                     // 0x00C8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableGCHeapLayoutTrace;                           // 0x00C9(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableGCHeapStatsTrace;                            // 0x00CA(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseRelativeScriptOrigin;                           // 0x00CB(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          JsAbsPathSupportPak;                               // 0x00CC(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableV8DeoptimizeTrace;                           // 0x00CD(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableV8RuntimeTrace;                              // 0x00CE(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableV8TracingController;                         // 0x00CF(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableV8PriorityMode;                              // 0x00D0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableRedirectV8Stdout;                            // 0x00D1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableRedirectV8Stderr;                            // 0x00D2(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableFastV8ToFString;                             // 0x00D3(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JsEnvSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JsEnvSetting")
	}
	static class UJsEnvSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJsEnvSetting>();
	}
};
DUMPER7_ASSERTS_UJsEnvSetting;

// Class JsEnv.ExtensionMethods
// 0x0000 (0x0030 - 0x0030)
class UExtensionMethods final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExtensionMethods")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExtensionMethods")
	}
	static class UExtensionMethods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExtensionMethods>();
	}
};
DUMPER7_ASSERTS_UExtensionMethods;

// Class JsEnv.JSGeneratedClass
// 0x0020 (0x0358 - 0x0338)
class UJSGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	uint8                                         Pad_338[0x20];                                     // 0x0338(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JSGeneratedClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JSGeneratedClass")
	}
	static class UJSGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJSGeneratedClass>();
	}
};
DUMPER7_ASSERTS_UJSGeneratedClass;

// Class JsEnv.JSGeneratedFunction
// 0x0020 (0x0108 - 0x00E8)
class UJSGeneratedFunction final : public UFunction
{
public:
	uint8                                         Pad_E8[0x20];                                      // 0x00E8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JSGeneratedFunction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JSGeneratedFunction")
	}
	static class UJSGeneratedFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJSGeneratedFunction>();
	}
};
DUMPER7_ASSERTS_UJSGeneratedFunction;

// Class JsEnv.JSWidgetGeneratedClass
// 0x0020 (0x0398 - 0x0378)
class UJSWidgetGeneratedClass final : public UWidgetBlueprintGeneratedClass
{
public:
	uint8                                         Pad_378[0x20];                                     // 0x0378(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JSWidgetGeneratedClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JSWidgetGeneratedClass")
	}
	static class UJSWidgetGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJSWidgetGeneratedClass>();
	}
};
DUMPER7_ASSERTS_UJSWidgetGeneratedClass;

// Class JsEnv.KuroPreloadJSCallback
// 0x0028 (0x0058 - 0x0030)
class UKuroPreloadJSCallback final : public UObject
{
public:
	TDelegate<void()>                             CompletedDelegate;                                 // 0x0030(0x0028)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPreloadJSCallback")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPreloadJSCallback")
	}
	static class UKuroPreloadJSCallback* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroPreloadJSCallback>();
	}
};
DUMPER7_ASSERTS_UKuroPreloadJSCallback;

// Class JsEnv.TypeScriptBlueprint
// 0x0000 (0x00A8 - 0x00A8)
class UTypeScriptBlueprint final : public UBlueprint
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TypeScriptBlueprint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TypeScriptBlueprint")
	}
	static class UTypeScriptBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypeScriptBlueprint>();
	}
};
DUMPER7_ASSERTS_UTypeScriptBlueprint;

// Class JsEnv.TypeScriptGeneratedClass
// 0x0070 (0x03A8 - 0x0338)
class UTypeScriptGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	uint8                                         Pad_338[0x69];                                     // 0x0338(0x0069)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          HasConstructor;                                    // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TypeScriptGeneratedClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TypeScriptGeneratedClass")
	}
	static class UTypeScriptGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypeScriptGeneratedClass>();
	}
};
DUMPER7_ASSERTS_UTypeScriptGeneratedClass;

// Class JsEnv.TypeScriptObject
// 0x0000 (0x0000 - 0x0000)
class ITypeScriptObject final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TypeScriptObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TypeScriptObject")
	}
	static class ITypeScriptObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITypeScriptObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ITypeScriptObject;

}

