#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KawaiiPhysics

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class KawaiiPhysics.KawaiiPhysicsConfig
// 0x0008 (0x0038 - 0x0030)
class UKawaiiPhysicsConfig final : public UObject
{
public:
	bool                                          bEnableSimulate;                                   // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SimulateAllowLOD;                                  // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KawaiiPhysicsConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KawaiiPhysicsConfig")
	}
	static class UKawaiiPhysicsConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKawaiiPhysicsConfig>();
	}
};
DUMPER7_ASSERTS_UKawaiiPhysicsConfig;

// Class KawaiiPhysics.KawaiiPhysicsLimitsDataAsset
// 0x0030 (0x0068 - 0x0038)
class UKawaiiPhysicsLimitsDataAsset final : public UDataAsset
{
public:
	TArray<struct FSphericalLimit>                SphericalLimits;                                   // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCapsuleLimit>                  CapsuleLimits;                                     // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPlanarLimit>                   PlanarLimits;                                      // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KawaiiPhysicsLimitsDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KawaiiPhysicsLimitsDataAsset")
	}
	static class UKawaiiPhysicsLimitsDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKawaiiPhysicsLimitsDataAsset>();
	}
};
DUMPER7_ASSERTS_UKawaiiPhysicsLimitsDataAsset;

}

