#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// Enum KuroAnim.ECombineCurveMode
// NumValues: 0x0005
enum class ECombineCurveMode : uint8
{
	Replenish                                = 0,
	Accumulate                               = 1,
	Override                                 = 2,
	CleanAndOverride                         = 3,
	ECombineCurveMode_MAX                    = 4,
};

// Enum KuroAnim.ECollisionType
// NumValues: 0x0006
enum class ECollisionType : uint8
{
	None                                     = 0,
	Spherical                                = 1,
	Cylinder                                 = 2,
	Capsule                                  = 3,
	Planar                                   = 4,
	ECollisionType_MAX                       = 5,
};

// Enum KuroAnim.EClothType
// NumValues: 0x0004
enum class EClothType : uint8
{
	Line                                     = 0,
	Cloth                                    = 1,
	Dress                                    = 2,
	EClothType_MAX                           = 3,
};

// Enum KuroAnim.EAdjustBoxType
// NumValues: 0x0003
enum class EAdjustBoxType : uint8
{
	OpenMode                                 = 0,
	AlwaysVertical                           = 1,
	EAdjustBoxType_MAX                       = 2,
};

// Enum KuroAnim.EAdjustCapsuleType
// NumValues: 0x0004
enum class EAdjustCapsuleType : uint8
{
	OpenMode                                 = 0,
	ThreeDimension                           = 1,
	AlwaysVertical                           = 2,
	EAdjustCapsuleType_MAX                   = 3,
};

// Enum KuroAnim.EIKPartType
// NumValues: 0x0006
enum class EIKPartType : uint8
{
	None                                     = 0,
	LeftLeg                                  = 1,
	RightLeg                                 = 2,
	LeftArm                                  = 3,
	RightArm                                 = 4,
	EIKPartType_MAX                          = 5,
};

// Enum KuroAnim.EStandTurnType
// NumValues: 0x0004
enum class EStandTurnType : uint8
{
	None                                     = 0,
	Left                                     = 1,
	Right                                    = 2,
	EStandTurnType_MAX                       = 3,
};

// Enum KuroAnim.EBeHitAnim
// NumValues: 0x000D
enum class EBeHitAnim : uint8
{
	LightLeft                                = 0,
	LightRight                               = 1,
	HeavyLeft                                = 2,
	HeavyRight                               = 3,
	KnockUp                                  = 4,
	KnockDown                                = 5,
	Suppress                                 = 6,
	Rebound                                  = 7,
	LightFront                               = 8,
	LightBack                                = 9,
	HeavyFront                               = 10,
	HeavyBack                                = 11,
	EBeHitAnim_MAX                           = 12,
};

// Enum KuroAnim.EWalkPosture
// NumValues: 0x0003
enum class EWalkPosture : uint8
{
	Walk                                     = 0,
	Run                                      = 1,
	EWalkPosture_MAX                         = 2,
};

// Enum KuroAnim.EMoveDirection
// NumValues: 0x0006
enum class EMoveDirection : uint8
{
	Forward                                  = 0,
	Backward                                 = 1,
	Left                                     = 2,
	Right                                    = 3,
	Stop                                     = 4,
	EMoveDirection_MAX                       = 5,
};

// Enum KuroAnim.EExitClimbType
// NumValues: 0x000C
enum class EExitClimbType : uint8
{
	Leave                                    = 0,
	Water                                    = 1,
	Top                                      = 2,
	Bottom                                   = 3,
	Jump                                     = 4,
	Unknown                                  = 5,
	Sprint                                   = 6,
	Vault                                    = 7,
	SprintVaultFar                           = 8,
	SprintVaultNear                          = 9,
	BlockUp                                  = 10,
	EExitClimbType_MAX                       = 11,
};

// Enum KuroAnim.EEnterClimbType
// NumValues: 0x0006
enum class EEnterClimbType : uint8
{
	Air                                      = 0,
	Water                                    = 1,
	Ground                                   = 2,
	Down                                     = 3,
	Skill                                    = 4,
	EEnterClimbType_MAX                      = 5,
};

// Enum KuroAnim.EClimbStateType
// NumValues: 0x0005
enum class EClimbStateType : uint8
{
	None                                     = 0,
	EnterClimb                               = 1,
	Climbing                                 = 2,
	ExitClimb                                = 3,
	EClimbStateType_MAX                      = 4,
};

// Enum KuroAnim.ESwingStateType
// NumValues: 0x0006
enum class ESwingStateType : uint8
{
	None                                     = 0,
	EnterSwing                               = 1,
	LoopSwing                                = 2,
	LeftLoopSwing                            = 3,
	ExitSwing                                = 4,
	ESwingStateType_MAX                      = 5,
};

// Enum KuroAnim.ECharViewDirectionStateType
// NumValues: 0x0006
enum class ECharViewDirectionStateType : uint8
{
	LockDirection                            = 0,
	AimDirection                             = 1,
	FaceDirection                            = 2,
	LookAtDirection                          = 3,
	CameraDirection                          = 4,
	ECharViewDirectionStateType_MAX          = 5,
};

// Enum KuroAnim.ECharMoveStateType
// NumValues: 0x0022
enum class ECharMoveStateType : uint8
{
	Other                                    = 0,
	Stand                                    = 1,
	Walk                                     = 2,
	WalkStop                                 = 3,
	Run                                      = 4,
	RunStop                                  = 5,
	Sprint                                   = 6,
	SprintStop                               = 7,
	Dodge                                    = 8,
	LandRoll                                 = 9,
	KnockDown                                = 10,
	Parry                                    = 11,
	SoftKnock                                = 12,
	HeavyKnock                               = 13,
	NormalClimb                              = 14,
	FastClimb                                = 15,
	Glide                                    = 16,
	KnockUp                                  = 17,
	FastSwim                                 = 18,
	NormalSwim                               = 19,
	Swing                                    = 20,
	Captured                                 = 21,
	Slide                                    = 22,
	Flying                                   = 23,
	EnterClimb                               = 24,
	ExitClimb                                = 25,
	NormalSki                                = 26,
	StandUp                                  = 27,
	Soar                                     = 28,
	Roll                                     = 29,
	Kite                                     = 30,
	Gongduola                                = 31,
	NpcVehicle                               = 32,
	ECharMoveStateType_MAX                   = 33,
};

// Enum KuroAnim.ECharPositionStateType
// NumValues: 0x0007
enum class ECharPositionStateType : uint8
{
	Ground                                   = 0,
	Climb                                    = 1,
	Air                                      = 2,
	Water                                    = 3,
	Ski                                      = 4,
	Ride                                     = 5,
	ECharPositionStateType_MAX               = 6,
};

// Enum KuroAnim.EUpdateInfoFunction
// NumValues: 0x0004
enum class EUpdateInfoFunction : uint8
{
	Default                                  = 0,
	Monster                                  = 1,
	Npc                                      = 2,
	EUpdateInfoFunction_MAX                  = 3,
};

// Enum KuroAnim.SightLockTurnMode
// NumValues: 0x0003
enum class ESightLockTurnMode : uint8
{
	ZFirst                                   = 0,
	XFirst                                   = 1,
	SightLockTurnMode_MAX                    = 2,
};

// Enum KuroAnim.SightLockMode
// NumValues: 0x0005
enum class ESightLockMode : uint8
{
	None                                     = 0,
	SightBoneFirst                           = 1,
	Ratio                                    = 2,
	Shooting                                 = 3,
	SightLockMode_MAX                        = 4,
};

// Enum KuroAnim.EndBoneIKMode
// NumValues: 0x0005
enum class EndBoneIKMode : uint8
{
	None                                     = 0,
	AxisModeLockX                            = 1,
	AxisModeLockY                            = 2,
	FullRotationMode                         = 3,
	EndBoneIKMode_MAX                        = 4,
};

// Enum KuroAnim.KuroAnimIKMode
// NumValues: 0x0004
enum class EKuroAnimIKMode : uint8
{
	DeltaPositionMode                        = 0,
	LocalPositionMode                        = 1,
	DeltaPositionFromCurveMode               = 2,
	KuroAnimIKMode_MAX                       = 3,
};

// Enum KuroAnim.KuroHumanIKMode
// NumValues: 0x0006
enum class EKuroHumanIKMode : uint8
{
	None                                     = 0,
	GroundMode                               = 1,
	ClimbMode                                = 2,
	SlideMode                                = 3,
	RideMode                                 = 4,
	KuroHumanIKMode_MAX                      = 5,
};

// ScriptStruct KuroAnim.BoneBlock
// 0x0060 (0x0060 - 0x0000)
struct FBoneBlock final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int32, float>                            Link;                                              // 0x0010(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBoneBlock;

// ScriptStruct KuroAnim.SpecialBoneShakeData
// 0x0018 (0x0018 - 0x0000)
struct FSpecialBoneShakeData final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Influence;                                         // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShakeTime;                                         // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSpecialBoneShakeData;

// ScriptStruct KuroAnim.SkeletonGroup
// 0x0020 (0x0020 - 0x0000)
struct FSkeletonGroup final
{
public:
	TArray<struct FBoneBlock>                     Blocks;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSpecialBoneShakeData>          SpeicalBoneShakeData;                              // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSkeletonGroup;

// ScriptStruct KuroAnim.HitBones
// 0x0010 (0x0010 - 0x0000)
struct FHitBones final
{
public:
	TArray<class FName>                           Bones;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHitBones;

// ScriptStruct KuroAnim.AnimNode_Feedback
// 0x0190 (0x0278 - 0x00E8)
struct FAnimNode_Feedback final : public FAnimNode_SkeletalControlBase
{
public:
	struct FSkeletonGroup                         SkeletonBlockInfo;                                 // 0x00E8(0x0020)(Edit, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnitTime;                                          // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Hit;                                               // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NotEffectToChild;                                  // 0x0111(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShakeRate;                                         // 0x0114(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitBones                              HitBoneNames;                                      // 0x0118(0x0010)(Edit, NativeAccessSpecifierPublic)
	class UCurveFloat*                            Curve;                                             // 0x0128(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0130(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x147];                                    // 0x0131(0x0147)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_Feedback;

// ScriptStruct KuroAnim.AdditiveBlendAlpha
// 0x000C (0x000C - 0x0000)
struct FAdditiveBlendAlpha final
{
public:
	float                                         MeshSpaceAlpha;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AdditiveAlpha;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverlayAlpha;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAdditiveBlendAlpha;

// ScriptStruct KuroAnim.BranchBlendFilter
// 0x0018 (0x0018 - 0x0000)
struct FBranchBlendFilter final
{
public:
	struct FBoneReference                         BoneConfig;                                        // 0x0000(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         BlendDepth;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBranchBlendFilter;

// ScriptStruct KuroAnim.MaskLayer
// 0x0010 (0x0010 - 0x0000)
struct FMaskLayer final
{
public:
	TArray<struct FBranchBlendFilter>             MaskLayer;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMaskLayer;

// ScriptStruct KuroAnim.AnimNode_AdditiveBoneBlend
// 0x01A8 (0x01B8 - 0x0010)
struct FAnimNode_AdditiveBoneBlend final : public FAnimNode_Base
{
public:
	struct FPoseLink                              BaseLayer;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              OverlayLayer;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              AdditiveBasePose;                                  // 0x0030(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FAdditiveBlendAlpha>            AdditiveBlendAlpha;                                // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bMeshSpaceAdd;                                     // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMaskLayer>                     LayerSetup;                                        // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChestBlendDepth;                                   // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBoneReference>                 SupperotBoneConfigs;                               // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, int32>                      SpecialCurves;                                     // 0x0088(0x0050)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0xE0];                                      // 0x00D8(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_AdditiveBoneBlend;

// ScriptStruct KuroAnim.AnimNode_BoneRotateToLocation
// 0x0050 (0x0138 - 0x00E8)
struct FAnimNode_BoneRotateToLocation final : public FAnimNode_SkeletalControlBase
{
public:
	class FName                                   BoneName;                                          // 0x00E8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnAngle;                                         // 0x00F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookUpAngle;                                       // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ForwardLocation;                                   // 0x00FC(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TurnLimit;                                         // 0x0108(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LookUpLimit;                                       // 0x0110(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookUpOffset;                                      // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnUpOffset;                                      // 0x011C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRollBackToOrigin;                                 // 0x0120(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopRoll;                                         // 0x0121(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0122(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_123[0x15];                                     // 0x0123(0x0015)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_BoneRotateToLocation;

// ScriptStruct KuroAnim.AnimNode_CombineCurves
// 0x0050 (0x0060 - 0x0010)
struct FAnimNode_CombineCurves final : public FAnimNode_Base
{
public:
	struct FPoseLink                              Base;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FPoseLink                              CurveAnim;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	ECombineCurveMode                             CombineMode;                                       // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Alpha;                                             // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   CleanAlphaCurveName;                               // 0x0038(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CleanCurves;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_CombineCurves;

// ScriptStruct KuroAnim.AnimNode_ExtraFollowAnims
// 0x0D50 (0x0D60 - 0x0010)
struct alignas(0x10) FAnimNode_ExtraFollowAnims final : public FAnimNode_Base
{
public:
	class FName                                   DefaultSequenceName;                               // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InternalTimeAccumulator;                           // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAllAnims;                                      // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0xD3F];                                     // 0x0021(0x0D3F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_ExtraFollowAnims;

// ScriptStruct KuroAnim.AnimNode_FeedbackRotate
// 0x0238 (0x0320 - 0x00E8)
struct FAnimNode_FeedbackRotate final : public FAnimNode_SkeletalControlBase
{
public:
	TArray<struct FBoneReference>                 BeginBones;                                        // 0x00E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 EndBones;                                          // 0x00F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 WeakenBones;                                       // 0x0108(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         RootBone;                                          // 0x0118(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MaxTurnAngle;                                      // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weaken;                                            // 0x0130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RecoveryWeaken;                                    // 0x0134(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDistance;                                       // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x013C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimChangeOptizimeParameter;                       // 0x0140(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NewHit;                                            // 0x0144(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitPos;                                            // 0x0148(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitVector;                                         // 0x0154(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FeedbackTimeLength;                                // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Curve;                                             // 0x0168(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_170[0x1B0];                                    // 0x0170(0x01B0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_FeedbackRotate;

// ScriptStruct KuroAnim.AnimNode_FollowAnims
// 0x0118 (0x0128 - 0x0010)
struct FAnimNode_FollowAnims final : public FAnimNode_Base
{
public:
	struct FPoseLink                              Base;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMap<class FString, class UAnimSequenceBase*> AnimMap;                                           // 0x0020(0x0050)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	TSet<class FName>                             Slots;                                             // 0x0070(0x0050)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x68];                                      // 0x00C0(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_FollowAnims;

// ScriptStruct KuroAnim.AnimNode_HumanTwoBoneIK
// 0x00E8 (0x01D0 - 0x00E8)
struct FAnimNode_HumanTwoBoneIK final : public FAnimNode_SkeletalControlBase
{
public:
	struct FBoneReference                         IKBone;                                            // 0x00E8(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EKuroAnimIKMode                               bMode;                                             // 0x00FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BaseAngleCurveName;                                // 0x0100(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LocationCurveName;                                 // 0x0110(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                IKLocalPos;                                        // 0x0120(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowerLimit[0x2];                                   // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OffsetOrTargetPosition;                            // 0x0134(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EndBoneIKMode                                 bEndBoneMode;                                      // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                EndBoneBaseAxis;                                   // 0x0144(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndBoneTargetAxis;                                 // 0x0150(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  EndBoneTargetRotation;                             // 0x0160(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         EndBoneLimit[0x6];                                 // 0x0170(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_188[0x48];                                     // 0x0188(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_HumanTwoBoneIK;

// ScriptStruct KuroAnim.AnimNode_KuroCacheBones
// 0x0060 (0x0148 - 0x00E8)
struct FAnimNode_KuroCacheBones final : public FAnimNode_SkeletalControlBase
{
public:
	TArray<class FName>                           BoneNames;                                         // 0x00E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8[0x50];                                      // 0x00F8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_KuroCacheBones;

// ScriptStruct KuroAnim.KuroHumanIKPart
// 0x0098 (0x0098 - 0x0000)
struct FKuroHumanIKPart final
{
public:
	EIKPartType                                   PartType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         IKBone;                                            // 0x0004(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         TipBone;                                           // 0x0018(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         TipEndOffset;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCurve;                                         // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BaseAngleCurveName;                                // 0x0034(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LocationCurveName;                                 // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AlphaCurveName;                                    // 0x0050(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LandingTimeCurveName;                              // 0x005C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxIkDist;                                         // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowerLimits[0x2];                                  // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndBoneLimits[0x6];                                // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TipAngleLimit[0x2];                                // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EndBoneIKMode                                 EndBoneIKMode;                                     // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugPrint;                                       // 0x0095(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKuroHumanIKPart;

// ScriptStruct KuroAnim.IKTarget
// 0x0030 (0x0030 - 0x0000)
struct FIKTarget final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKTarget;

// ScriptStruct KuroAnim.AnimNode_KuroHumanIK
// 0x0208 (0x02F0 - 0x00E8)
struct FAnimNode_KuroHumanIK final : public FAnimNode_SkeletalControlBase
{
public:
	TArray<struct FKuroHumanIKPart>               FootParts;                                         // 0x00E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FKuroHumanIKPart>               HandParts;                                         // 0x00F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EKuroHumanIKMode                              Mode;                                              // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CapsuleRadius;                                     // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMoving;                                         // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsComplexIk;                                      // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaSeconds;                                      // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForbiddenCurvePosition;                           // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoLerp;                                           // 0x0119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RootLerpSpeed;                                     // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootLerpSpeed;                                     // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandLerpSpeed;                                     // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandTurnSpeed;                                     // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundDepth;                                       // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxIKFootDetectDepth;                              // 0x0130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovingSpeed;                                       // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MovingVelocity;                                    // 0x0138(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WalkRunMix;                                        // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DegMovementSlop;                                   // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClimbRadius;                                       // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SlideForward;                                      // 0x0150(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlideRadius;                                       // 0x015C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStandSlide;                                       // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PredictStrength;                                   // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseComplexPrediction;                             // 0x0168(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PredictIterateMaxCount;                            // 0x016C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PredictInvalidDistance;                            // 0x0170(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PredictDisableAccel;                               // 0x0174(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepLockLandingTimeRatio;                          // 0x0178(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PredictIterateOffset;                              // 0x017C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DefaultTipOffsetAtLand;                            // 0x0180(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIKTarget                              LeftHandTargetCS;                                  // 0x0190(0x0030)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FIKTarget                              RightHandTargetCS;                                 // 0x01C0(0x0030)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F0[0x100];                                    // 0x01F0(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_KuroHumanIK;

// ScriptStruct KuroAnim.AnimNode_KuroModifyBones
// 0x00A8 (0x0190 - 0x00E8)
struct FAnimNode_KuroModifyBones final : public FAnimNode_SkeletalControlBase
{
public:
	TMap<class FName, struct FTransform>          BoneTransformsMap;                                 // 0x00E8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EBoneModificationMode                         TranslationMode;                                   // 0x0138(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoneModificationMode                         RotationMode;                                      // 0x0139(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoneModificationMode                         ScaleMode;                                         // 0x013A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoneControlSpace                             TranslationSpace;                                  // 0x013B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoneControlSpace                             RotationSpace;                                     // 0x013C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoneControlSpace                             ScaleSpace;                                        // 0x013D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13E[0x52];                                     // 0x013E(0x0052)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_KuroModifyBones;

// ScriptStruct KuroAnim.KuroMotorWheelIkParams
// 0x005C (0x005C - 0x0000)
struct FKuroMotorWheelIkParams final
{
public:
	struct FBoneReference                         IkBone;                                            // 0x0000(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                RotateAxis;                                        // 0x0014(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinTurnAngle;                                      // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTurnAngle;                                      // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTurnSpeed;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         IkWheelBone;                                       // 0x002C(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                WheelRotateAxis;                                   // 0x0040(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HangRadius;                                        // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WheelRadius;                                       // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfWheelWidth;                                    // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AccurateCheckCount;                                // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroMotorWheelIkParams;

// ScriptStruct KuroAnim.AnimNode_KuroMotorIK
// 0x0070 (0x0158 - 0x00E8)
struct FAnimNode_KuroMotorIK final : public FAnimNode_SkeletalControlBase
{
public:
	TArray<struct FKuroMotorWheelIkParams>        MotorWheelIkParams;                                // 0x00E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UMotorWheelDisplayInfoObject*           DisplayInfoObject;                                 // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimulateDetect;                                   // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         DebugDraw : 1;                                     // 0x0101(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_102[0x56];                                     // 0x0102(0x0056)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_KuroMotorIK;

// ScriptStruct KuroAnim.KuroRotateBonePart
// 0x0018 (0x0018 - 0x0000)
struct FKuroRotateBonePart final
{
public:
	struct FBoneReference                         IKBone;                                            // 0x0000(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         LimitAngle;                                        // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroRotateBonePart;

// ScriptStruct KuroAnim.AnimNode_KuroRotateBonesToTarget
// 0x00D8 (0x01C0 - 0x00E8)
struct FAnimNode_KuroRotateBonesToTarget final : public FAnimNode_SkeletalControlBase
{
public:
	TArray<struct FKuroRotateBonePart>            Parts;                                             // 0x00E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, float>                    ActivateBoneMap;                                   // 0x00F8(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FVector                                TargetPosition;                                    // 0x0148(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_154[0x6C];                                     // 0x0154(0x006C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_KuroRotateBonesToTarget;

// ScriptStruct KuroAnim.AnimNode_MountBuffer
// 0x00F8 (0x01E0 - 0x00E8)
struct alignas(0x10) FAnimNode_MountBuffer final : public FAnimNode_SkeletalControlBase
{
public:
	struct FBoneReference                         MountBone;                                         // 0x00E8(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         PowerIntensity;                                    // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AirResistance;                                     // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MetaDeltaTime;                                     // 0x0104(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InertanceIntensity;                                // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0xD4];                                     // 0x010C(0x00D4)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_MountBuffer;

// ScriptStruct KuroAnim.AnimNode_MultiBonesIK
// 0x0078 (0x0160 - 0x00E8)
struct FAnimNode_MultiBonesIK final : public FAnimNode_SkeletalControlBase
{
public:
	struct FBoneReference                         IKBone;                                            // 0x00E8(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                IKBonePos;                                         // 0x00FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         BeginBone;                                         // 0x0108(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         EndBone;                                           // 0x011C(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EKuroAnimIKMode                               bMode;                                             // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OffsetOrTargetPosition;                            // 0x0134(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0x20];                                     // 0x0140(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_MultiBonesIK;

// ScriptStruct KuroAnim.AnimNode_MultiTaskBlend
// 0x0038 (0x0048 - 0x0010)
struct FAnimNode_MultiTaskBlend final : public FAnimNode_Base
{
public:
	TArray<class UAnimSequenceBase*>              AdditiveSeqs;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 MixInfo;                                           // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Trigger;                                           // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x13];                                      // 0x0035(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_MultiTaskBlend;

// ScriptStruct KuroAnim.PhyClothLine
// 0x001C (0x001C - 0x0000)
struct FPhyClothLine final
{
public:
	struct FBoneReference                         RootBone;                                          // 0x0000(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Generate;                                          // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPhyClothLine;

// ScriptStruct KuroAnim.PhyClothCollision
// 0x0038 (0x0038 - 0x0000)
struct FPhyClothCollision final
{
public:
	ECollisionType                                Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
