#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroDynamicMeshBatch

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct KuroDynamicMeshBatch.PropMaterialParams
// 0x0014 (0x0014 - 0x0000)
struct FPropMaterialParams final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TextureIndex;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPropMaterialParams;

// ScriptStruct KuroDynamicMeshBatch.PropInstanceData
// 0x0050 (0x0050 - 0x0000)
struct FPropInstanceData final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPropMaterialParams                    MaterialParams;                                    // 0x0030(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bDynamicUpdate;                                    // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0xB];                                       // 0x0045(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPropInstanceData;

// ScriptStruct KuroDynamicMeshBatch.PropGroup
// 0x0028 (0x0028 - 0x0000)
struct FPropGroup final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPropInstanceData>              Instances;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPropGroup;

// ScriptStruct KuroDynamicMeshBatch.BatchKey
// 0x0010 (0x0010 - 0x0000)
struct FBatchKey final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBatchKey;

// ScriptStruct KuroDynamicMeshBatch.DynamicInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FDynamicInstanceData final
{
public:
	struct FBatchKey                              Key;                                               // 0x0000(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachedToBone;                                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDynamicInstanceData;

// ScriptStruct KuroDynamicMeshBatch.PendingRemoval
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FPendingRemoval final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPendingRemoval;

// ScriptStruct KuroDynamicMeshBatch.BatchKeyInfo
// 0x0060 (0x0060 - 0x0000)
struct FBatchKeyInfo final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<TWeakObjectPtr<class USceneComponent>, int32> InstanceMap;                                  // 0x0010(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBatchKeyInfo;

}

