#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroPerformance

#include "Basic.hpp"

#include "KuroPerformance_structs.hpp"


namespace SDK::Params
{

// Function KuroPerformance.KuroPerformanceBPLibrary.BoostCPU
// 0x000C (0x000C - 0x0000)
struct KuroPerformanceBPLibrary_BoostCPU final
{
public:
	int32                                         FrequencyPercentage;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoostDurationInMilliSecond;                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoostMemory;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_BoostCPU;

// Function KuroPerformance.KuroPerformanceBPLibrary.BoostGPU
// 0x000C (0x000C - 0x0000)
struct KuroPerformanceBPLibrary_BoostGPU final
{
public:
	int32                                         FrequencyPercentage;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoostDurationInMilliSecond;                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoostMemory;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_BoostGPU;

// Function KuroPerformance.KuroPerformanceBPLibrary.GetBoostFlags
// 0x0003 (0x0003 - 0x0000)
struct KuroPerformanceBPLibrary_GetBoostFlags final
{
public:
	bool                                          bCPU;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWithMemory;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroBoostFlags                               ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_GetBoostFlags;

// Function KuroPerformance.KuroPerformanceBPLibrary.GetCurrentActivePerformanceAdaptiveModuleName
// 0x0010 (0x0010 - 0x0000)
struct KuroPerformanceBPLibrary_GetCurrentActivePerformanceAdaptiveModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_GetCurrentActivePerformanceAdaptiveModuleName;

// Function KuroPerformance.KuroPerformanceBPLibrary.GetCurrentAndroidDeviceRequireAdaptiveModule
// 0x0004 (0x0004 - 0x0000)
struct KuroPerformanceBPLibrary_GetCurrentAndroidDeviceRequireAdaptiveModule final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_GetCurrentAndroidDeviceRequireAdaptiveModule;

// Function KuroPerformance.KuroPerformanceBPLibrary.GetCurrentTemperatureData
// 0x0028 (0x0028 - 0x0000)
struct KuroPerformanceBPLibrary_GetCurrentTemperatureData final
{
public:
	TDelegate<void(bool bResult, float CurrentTemperature, float TempBudget)> Delegate;              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_GetCurrentTemperatureData;

// Function KuroPerformance.KuroPerformanceBPLibrary.GetInitReturnMessage
// 0x0010 (0x0010 - 0x0000)
struct KuroPerformanceBPLibrary_GetInitReturnMessage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_GetInitReturnMessage;

// Function KuroPerformance.KuroPerformanceBPLibrary.GetMaxBoostDurationInSecondForCPU
// 0x0004 (0x0004 - 0x0000)
struct KuroPerformanceBPLibrary_GetMaxBoostDurationInSecondForCPU final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_GetMaxBoostDurationInSecondForCPU;

// Function KuroPerformance.KuroPerformanceBPLibrary.GetMaxBoostDurationInSecondForGPU
// 0x0004 (0x0004 - 0x0000)
struct KuroPerformanceBPLibrary_GetMaxBoostDurationInSecondForGPU final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_GetMaxBoostDurationInSecondForGPU;

// Function KuroPerformance.KuroPerformanceBPLibrary.GetPerformanceAdaptiveStatus
// 0x0001 (0x0001 - 0x0000)
struct KuroPerformanceBPLibrary_GetPerformanceAdaptiveStatus final
{
public:
	EKuroModuleStatus                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_GetPerformanceAdaptiveStatus;

// Function KuroPerformance.KuroPerformanceBPLibrary.GetRegisterGameThreadId
// 0x0004 (0x0004 - 0x0000)
struct KuroPerformanceBPLibrary_GetRegisterGameThreadId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_GetRegisterGameThreadId;

// Function KuroPerformance.KuroPerformanceBPLibrary.GetRegisterRenderThreadId
// 0x0004 (0x0004 - 0x0000)
struct KuroPerformanceBPLibrary_GetRegisterRenderThreadId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_GetRegisterRenderThreadId;

// Function KuroPerformance.KuroPerformanceBPLibrary.GetRegisterRHIThreadId
// 0x0004 (0x0004 - 0x0000)
struct KuroPerformanceBPLibrary_GetRegisterRHIThreadId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_GetRegisterRHIThreadId;

// Function KuroPerformance.KuroPerformanceBPLibrary.GetSupportedBoostFlag
// 0x0001 (0x0001 - 0x0000)
struct KuroPerformanceBPLibrary_GetSupportedBoostFlag final
{
public:
	EKuroBoostFlags                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_GetSupportedBoostFlag;

// Function KuroPerformance.KuroPerformanceBPLibrary.GetTickedPerformanceReportAndAdvice
// 0x0028 (0x0028 - 0x0000)
struct KuroPerformanceBPLibrary_GetTickedPerformanceReportAndAdvice final
{
public:
	TDelegate<void(const struct FKuroPerformanceReport& PerformanceReport)> ReportDelegate;          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_GetTickedPerformanceReportAndAdvice;

// Function KuroPerformance.KuroPerformanceBPLibrary.InitGameConfig
// 0x0010 (0x0010 - 0x0000)
struct KuroPerformanceBPLibrary_InitGameConfig final
{
public:
	struct FKuroGameConfig                        GameConfig;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_InitGameConfig;

// Function KuroPerformance.KuroPerformanceBPLibrary.InitGameConfigFPS
// 0x0008 (0x0008 - 0x0000)
struct KuroPerformanceBPLibrary_InitGameConfigFPS final
{
public:
	int32                                         FPS;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_InitGameConfigFPS;

// Function KuroPerformance.KuroPerformanceBPLibrary.InitGameConfigSceneTransition
// 0x0002 (0x0002 - 0x0000)
struct KuroPerformanceBPLibrary_InitGameConfigSceneTransition final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_InitGameConfigSceneTransition;

// Function KuroPerformance.KuroPerformanceBPLibrary.IsPerformanceAdaptiveInitialize
// 0x0001 (0x0001 - 0x0000)
struct KuroPerformanceBPLibrary_IsPerformanceAdaptiveInitialize final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_IsPerformanceAdaptiveInitialize;

// Function KuroPerformance.KuroPerformanceBPLibrary.IsPerformanceAdaptiveRunning
// 0x0001 (0x0001 - 0x0000)
struct KuroPerformanceBPLibrary_IsPerformanceAdaptiveRunning final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_IsPerformanceAdaptiveRunning;

// Function KuroPerformance.KuroPerformanceBPLibrary.IsPredictCPUWorkloadSupported
// 0x0001 (0x0001 - 0x0000)
struct KuroPerformanceBPLibrary_IsPredictCPUWorkloadSupported final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_IsPredictCPUWorkloadSupported;

// Function KuroPerformance.KuroPerformanceBPLibrary.IsPredictGPUWorkloadSupported
// 0x0001 (0x0001 - 0x0000)
struct KuroPerformanceBPLibrary_IsPredictGPUWorkloadSupported final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_IsPredictGPUWorkloadSupported;

// Function KuroPerformance.KuroPerformanceBPLibrary.PredictWorkload
// 0x000C (0x000C - 0x0000)
struct KuroPerformanceBPLibrary_PredictWorkload final
{
public:
	int32                                         CPULoadScale;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GPULoadScale;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_PredictWorkload;

// Function KuroPerformance.KuroPerformanceBPLibrary.QueryBoostCPU
// 0x0010 (0x0010 - 0x0000)
struct KuroPerformanceBPLibrary_QueryBoostCPU final
{
public:
	struct FKuroBoostQueryResult                  BoostQueryResult;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_QueryBoostCPU;

// Function KuroPerformance.KuroPerformanceBPLibrary.QueryBoostGPU
// 0x0010 (0x0010 - 0x0000)
struct KuroPerformanceBPLibrary_QueryBoostGPU final
{
public:
	struct FKuroBoostQueryResult                  BoostQueryResult;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_QueryBoostGPU;

// Function KuroPerformance.KuroPerformanceBPLibrary.RegisterCriticalThreads
// 0x0010 (0x0010 - 0x0000)
struct KuroPerformanceBPLibrary_RegisterCriticalThreads final
{
public:
	int32                                         GameTid;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RenderTid;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RHITid;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_RegisterCriticalThreads;

// Function KuroPerformance.KuroPerformanceBPLibrary.SetForeground
// 0x0002 (0x0002 - 0x0000)
struct KuroPerformanceBPLibrary_SetForeground final
{
public:
	bool                                          bForeGround;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_SetForeground;

// Function KuroPerformance.KuroPerformanceBPLibrary.SetPerformanceAdaptiveStatus
// 0x0001 (0x0001 - 0x0000)
struct KuroPerformanceBPLibrary_SetPerformanceAdaptiveStatus final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_SetPerformanceAdaptiveStatus;

// Function KuroPerformance.KuroPerformanceBPLibrary.SetTargetFPS
// 0x000C (0x000C - 0x0000)
struct KuroPerformanceBPLibrary_SetTargetFPS final
{
public:
	int32                                         FPS;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ThreadId;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_SetTargetFPS;

// Function KuroPerformance.KuroPerformanceBPLibrary.StartPerformanceAdaptiveService
// 0x0008 (0x0008 - 0x0000)
struct KuroPerformanceBPLibrary_StartPerformanceAdaptiveService final
{
public:
	int32                                         EServiceFlags;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_StartPerformanceAdaptiveService;

// Function KuroPerformance.KuroPerformanceBPLibrary.StartService
// 0x0008 (0x0008 - 0x0000)
struct KuroPerformanceBPLibrary_StartService final
{
public:
	int32                                         Service;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_StartService;

// Function KuroPerformance.KuroPerformanceBPLibrary.StopPerformanceAdaptiveService
// 0x0008 (0x0008 - 0x0000)
struct KuroPerformanceBPLibrary_StopPerformanceAdaptiveService final
{
public:
	int32                                         EServiceFlags;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_StopPerformanceAdaptiveService;

// Function KuroPerformance.KuroPerformanceBPLibrary.StopService
// 0x0008 (0x0008 - 0x0000)
struct KuroPerformanceBPLibrary_StopService final
{
public:
	int32                                         Service;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_StopService;

// Function KuroPerformance.KuroPerformanceBPLibrary.SyncRenderingFrameID
// 0x0008 (0x0008 - 0x0000)
struct KuroPerformanceBPLibrary_SyncRenderingFrameID final
{
public:
	int32                                         FrameId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_SyncRenderingFrameID;

// Function KuroPerformance.KuroPerformanceBPLibrary.Tick
// 0x0004 (0x0004 - 0x0000)
struct KuroPerformanceBPLibrary_Tick final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_Tick;

// Function KuroPerformance.KuroPerformanceBPLibrary.TickPerformanceReport
// 0x0004 (0x0004 - 0x0000)
struct KuroPerformanceBPLibrary_TickPerformanceReport final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_TickPerformanceReport;

// Function KuroPerformance.KuroPerformanceBPLibrary.TickPerfReport
// 0x0004 (0x0004 - 0x0000)
struct KuroPerformanceBPLibrary_TickPerfReport final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_TickPerfReport;

// Function KuroPerformance.KuroPerformanceBPLibrary.UnregisterCriticalThreads
// 0x0010 (0x0010 - 0x0000)
struct KuroPerformanceBPLibrary_UnregisterCriticalThreads final
{
public:
	int32                                         GameTid;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RenderTid;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RHITid;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_UnregisterCriticalThreads;

// Function KuroPerformance.KuroPerformanceBPLibrary.UpdateGameConfig
// 0x0010 (0x0010 - 0x0000)
struct KuroPerformanceBPLibrary_UpdateGameConfig final
{
public:
	struct FKuroGameConfig                        GameConfig;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_UpdateGameConfig;

// Function KuroPerformance.KuroPerformanceBPLibrary.UpdateGameConfigFPS
// 0x0008 (0x0008 - 0x0000)
struct KuroPerformanceBPLibrary_UpdateGameConfigFPS final
{
public:
	int32                                         FPS;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_UpdateGameConfigFPS;

// Function KuroPerformance.KuroPerformanceBPLibrary.UpdateGameConfigSceneTransition
// 0x0002 (0x0002 - 0x0000)
struct KuroPerformanceBPLibrary_UpdateGameConfigSceneTransition final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPerformanceBPLibrary_UpdateGameConfigSceneTransition;

}

