#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroPushSdk

#include "Basic.hpp"


namespace SDK::Params
{

// Function KuroPushSdk.KuroPushSdkStaticLibrary.BindAlias
// 0x0020 (0x0020 - 0x0000)
struct KuroPushSdkStaticLibrary_BindAlias final
{
public:
	class FString                                 alias;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 sn;                                                // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_BindAlias;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.GetClientId
// 0x0010 (0x0010 - 0x0000)
struct KuroPushSdkStaticLibrary_GetClientId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_GetClientId;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.GetPushObject
// 0x0008 (0x0008 - 0x0000)
struct KuroPushSdkStaticLibrary_GetPushObject final
{
public:
	class UKuroPushObject*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_GetPushObject;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.GetStatus
// 0x0004 (0x0004 - 0x0000)
struct KuroPushSdkStaticLibrary_GetStatus final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_GetStatus;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.GetVersion
// 0x0010 (0x0010 - 0x0000)
struct KuroPushSdkStaticLibrary_GetVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_GetVersion;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.IsPushTurnOn
// 0x0001 (0x0001 - 0x0000)
struct KuroPushSdkStaticLibrary_IsPushTurnOn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_IsPushTurnOn;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.PushLocalNotification
// 0x0030 (0x0030 - 0x0000)
struct KuroPushSdkStaticLibrary_PushLocalNotification final
{
public:
	class FString                                 title;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 body;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 exData;                                            // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_PushLocalNotification;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.SendFeedBackMessage
// 0x0030 (0x0030 - 0x0000)
struct KuroPushSdkStaticLibrary_SendFeedBackMessage final
{
public:
	class FString                                 actionId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 taskId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 msgId;                                             // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_SendFeedBackMessage;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.SetApplicationGroupIdentify
// 0x0010 (0x0010 - 0x0000)
struct KuroPushSdkStaticLibrary_SetApplicationGroupIdentify final
{
public:
	class FString                                 identify;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_SetApplicationGroupIdentify;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.SetBudge
// 0x0010 (0x0010 - 0x0000)
struct KuroPushSdkStaticLibrary_SetBudge final
{
public:
	class FString                                 budge;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_SetBudge;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.SetChannel
// 0x0010 (0x0010 - 0x0000)
struct KuroPushSdkStaticLibrary_SetChannel final
{
public:
	class FString                                 channelId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_SetChannel;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.SetLocalChannelId
// 0x0010 (0x0010 - 0x0000)
struct KuroPushSdkStaticLibrary_SetLocalChannelId final
{
public:
	class FString                                 channelId;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_SetLocalChannelId;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.SetLocalChannelIdAndName
// 0x0020 (0x0020 - 0x0000)
struct KuroPushSdkStaticLibrary_SetLocalChannelIdAndName final
{
public:
	class FString                                 channelId;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 channelName;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_SetLocalChannelIdAndName;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.SetLocalSetNotificationIcon
// 0x0020 (0x0020 - 0x0000)
struct KuroPushSdkStaticLibrary_SetLocalSetNotificationIcon final
{
public:
	class FString                                 smallIcon;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 largeIcon;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_SetLocalSetNotificationIcon;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.SetLocationEnable
// 0x0002 (0x0002 - 0x0000)
struct KuroPushSdkStaticLibrary_SetLocationEnable final
{
public:
	bool                                          isEnable;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isVerify;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_SetLocationEnable;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.SetNotificationIcon
// 0x0020 (0x0020 - 0x0000)
struct KuroPushSdkStaticLibrary_SetNotificationIcon final
{
public:
	class FString                                 smallIcon;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 largeIcon;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_SetNotificationIcon;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.SetPushMode
// 0x0001 (0x0001 - 0x0000)
struct KuroPushSdkStaticLibrary_SetPushMode final
{
public:
	bool                                          turnOn;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_SetPushMode;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.SetRunInBackGround
// 0x0001 (0x0001 - 0x0000)
struct KuroPushSdkStaticLibrary_SetRunInBackGround final
{
public:
	bool                                          state;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_SetRunInBackGround;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.SetTag
// 0x0028 (0x0028 - 0x0000)
struct KuroPushSdkStaticLibrary_SetTag final
{
public:
	class FString                                 tags;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 sn;                                                // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_SetTag;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.StartPushSdk
// 0x0030 (0x0030 - 0x0000)
struct KuroPushSdkStaticLibrary_StartPushSdk final
{
public:
	class FString                                 appId;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 appKey;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 appSecret;                                         // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_StartPushSdk;

// Function KuroPushSdk.KuroPushSdkStaticLibrary.UnBindAlias
// 0x0028 (0x0028 - 0x0000)
struct KuroPushSdkStaticLibrary_UnBindAlias final
{
public:
	class FString                                 alias;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 sn;                                                // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isSelf;                                            // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPushSdkStaticLibrary_UnBindAlias;

}

