#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroAI

#include "Basic.hpp"


namespace SDK::Params
{

// Function KuroAI.KuroAILibrary.GetCurrentRootNode
// 0x0010 (0x0010 - 0x0000)
struct KuroAILibrary_GetCurrentRootNode final
{
public:
	class UBehaviorTreeComponent*                 BTComp;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTNode*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroAILibrary_GetCurrentRootNode) == 0x000008, "Wrong alignment on KuroAILibrary_GetCurrentRootNode");
static_assert(sizeof(KuroAILibrary_GetCurrentRootNode) == 0x000010, "Wrong size on KuroAILibrary_GetCurrentRootNode");
static_assert(offsetof(KuroAILibrary_GetCurrentRootNode, BTComp) == 0x000000, "Member 'KuroAILibrary_GetCurrentRootNode::BTComp' has a wrong offset!");
static_assert(offsetof(KuroAILibrary_GetCurrentRootNode, ReturnValue) == 0x000008, "Member 'KuroAILibrary_GetCurrentRootNode::ReturnValue' has a wrong offset!");

// Function KuroAI.KuroAILibrary.ResetRandomNode
// 0x0020 (0x0020 - 0x0000)
struct KuroAILibrary_ResetRandomNode final
{
public:
	class UBehaviorTreeComponent*                 BTComp;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTNode*                                Node;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 WeightsOverride;                                   // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroAILibrary_ResetRandomNode) == 0x000008, "Wrong alignment on KuroAILibrary_ResetRandomNode");
static_assert(sizeof(KuroAILibrary_ResetRandomNode) == 0x000020, "Wrong size on KuroAILibrary_ResetRandomNode");
static_assert(offsetof(KuroAILibrary_ResetRandomNode, BTComp) == 0x000000, "Member 'KuroAILibrary_ResetRandomNode::BTComp' has a wrong offset!");
static_assert(offsetof(KuroAILibrary_ResetRandomNode, Node) == 0x000008, "Member 'KuroAILibrary_ResetRandomNode::Node' has a wrong offset!");
static_assert(offsetof(KuroAILibrary_ResetRandomNode, WeightsOverride) == 0x000010, "Member 'KuroAILibrary_ResetRandomNode::WeightsOverride' has a wrong offset!");

}

