#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroBullet

#include "Basic.hpp"

#include "KuroBullet_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KuroBullet.BulletEntity.OnObstacleTrace
// 0x0020 (0x0020 - 0x0000)
struct BulletEntity_OnObstacleTrace final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTraceBaseElement*                      Element;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Frame;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Index_0;                                           // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletEntity_OnObstacleTrace;

// Function KuroBullet.BulletWorld.AddCommonBulletDataTable
// 0x0008 (0x0008 - 0x0000)
struct BulletWorld_AddCommonBulletDataTable final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_AddCommonBulletDataTable;

// Function KuroBullet.BulletWorld.CreateBullet
// 0x0070 (0x0070 - 0x0000)
struct BulletWorld_CreateBullet final
{
public:
	TScriptInterface<class IBulletOwner>          BulletOwner;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	int64                                         BulletConfigId;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       InitialTransform;                                  // 0x0020(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletWorld_CreateBullet;

// Function KuroBullet.BulletWorld.DestroyAllBulletsByOwner
// 0x0008 (0x0008 - 0x0000)
struct BulletWorld_DestroyAllBulletsByOwner final
{
public:
	const class AActor*                           Owner;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_DestroyAllBulletsByOwner;

// Function KuroBullet.BulletWorld.DestroyBullet
// 0x0010 (0x0010 - 0x0000)
struct BulletWorld_DestroyBullet final
{
public:
	class UBulletEntity*                          BulletEntity;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClearOwner;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletWorld_DestroyBullet;

// Function KuroBullet.BulletWorld.DestroyBulletById
// 0x0008 (0x0008 - 0x0000)
struct BulletWorld_DestroyBulletById final
{
public:
	int32                                         BulletEntityId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClearOwner;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletWorld_DestroyBulletById;

// Function KuroBullet.BulletWorld.EnableFlatGround
// 0x0008 (0x0008 - 0x0000)
struct BulletWorld_EnableFlatGround final
{
public:
	double                                        Height;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_EnableFlatGround;

// Function KuroBullet.BulletWorld.EnableFlatGroundByAbovePoint
// 0x0018 (0x0018 - 0x0000)
struct BulletWorld_EnableFlatGroundByAbovePoint final
{
public:
	struct FVectorDouble                          AbovePoint;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_EnableFlatGroundByAbovePoint;

// Function KuroBullet.BulletWorld.FindBulletConfig
// 0x0228 (0x0228 - 0x0000)
struct BulletWorld_FindBulletConfig final
{
public:
	int64                                         BulletConfigId;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             OwnerBulletDataTable;                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKuroBulletData                        OutRow;                                            // 0x0010(0x0210)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0220(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletWorld_FindBulletConfig;

// Function KuroBullet.BulletWorld.InitBulletConfig
// 0x0020 (0x0020 - 0x0000)
struct BulletWorld_InitBulletConfig final
{
public:
	class UBulletEntity*                          BulletEntity;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         BulletConfigId;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             OwnerBulletDataTable;                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletWorld_InitBulletConfig;

// Function KuroBullet.BulletWorld.SetShowBulletCollision
// 0x0001 (0x0001 - 0x0000)
struct BulletWorld_SetShowBulletCollision final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_SetShowBulletCollision;

// Function KuroBullet.KuroBulletFunctionLibrary.CreateBullet
// 0x0070 (0x0070 - 0x0000)
struct KuroBulletFunctionLibrary_CreateBullet final
{
public:
	class AKSC_Entity*                            KSC_Entity;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         BulletConfigId;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransformDouble                       InitialTransform;                                  // 0x0010(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UDataTable*                             OwnerBulletDataTable;                              // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AKSC_Entity*                            SkillTarget;                                       // 0x0058(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroBulletFunctionLibrary_CreateBullet;

// Function KuroBullet.KuroBulletFunctionLibrary.DestroyBulletById
// 0x0008 (0x0008 - 0x0000)
struct KuroBulletFunctionLibrary_DestroyBulletById final
{
public:
	int32                                         BulletEntityId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClearOwner;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroBulletFunctionLibrary_DestroyBulletById;

// Function KuroBullet.KuroBulletFunctionLibrary.SetShowBulletCollision
// 0x0001 (0x0001 - 0x0000)
struct KuroBulletFunctionLibrary_SetShowBulletCollision final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBulletFunctionLibrary_SetShowBulletCollision;

// Function KuroBullet.KuroBulletSubsystem.CreateWorld
// 0x0008 (0x0008 - 0x0000)
struct KuroBulletSubsystem_CreateWorld final
{
public:
	class UBulletWorld*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBulletSubsystem_CreateWorld;

// Function KuroBullet.KuroBulletSubsystem.GetBulletWorld
// 0x0008 (0x0008 - 0x0000)
struct KuroBulletSubsystem_GetBulletWorld final
{
public:
	class UBulletWorld*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBulletSubsystem_GetBulletWorld;

}

