#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroUtility

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "JsEnv_structs.hpp"
#include "KuroUtility_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function KuroUtility.AsyncLoadState.AsyncLoadClass
// 0x0018 (0x0018 - 0x0000)
struct AsyncLoadState_AsyncLoadClass final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                UserData;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncLoadState_AsyncLoadClass;

// Function KuroUtility.AsyncLoadState.AsyncLoadObject
// 0x0018 (0x0018 - 0x0000)
struct AsyncLoadState_AsyncLoadObject final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                UserData;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncLoadState_AsyncLoadObject;

// Function KuroUtility.HoldPreloadObject.AddCommonAsset
// 0x0008 (0x0008 - 0x0000)
struct HoldPreloadObject_AddCommonAsset final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HoldPreloadObject_AddCommonAsset;

// Function KuroUtility.HoldPreloadObject.AddEntityAsset
// 0x0018 (0x0018 - 0x0000)
struct HoldPreloadObject_AddEntityAsset final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InObject;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HoldPreloadObject_AddEntityAsset;

// Function KuroUtility.HoldPreloadObject.GetCommonAssetArray
// 0x0010 (0x0010 - 0x0000)
struct HoldPreloadObject_GetCommonAssetArray final
{
public:
	TArray<class UObject*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HoldPreloadObject_GetCommonAssetArray;

// Function KuroUtility.HoldPreloadObject.GetEntityAssetArray
// 0x0020 (0x0020 - 0x0000)
struct HoldPreloadObject_GetEntityAssetArray final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        OutAssets;                                         // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HoldPreloadObject_GetEntityAssetArray;

// Function KuroUtility.HoldPreloadObject.RemoveEntityAssets
// 0x0008 (0x0008 - 0x0000)
struct HoldPreloadObject_RemoveEntityAssets final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HoldPreloadObject_RemoveEntityAssets;

// Function KuroUtility.KuroActorComponent.EditorTickComponent
// 0x0004 (0x0004 - 0x0000)
struct KuroActorComponent_EditorTickComponent final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroActorComponent_EditorTickComponent;

// Function KuroUtility.KuroActorManager.ClearAcquiredComponents
// 0x0010 (0x0010 - 0x0000)
struct KuroActorManager_ClearAcquiredComponents final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroActorManager_ClearAcquiredComponents;

// Function KuroUtility.KuroActorManager.D_SpawnActor
// 0x0080 (0x0080 - 0x0000)
struct KuroActorManager_D_SpawnActor final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransformDouble                       SpawnTransform;                                    // 0x0010(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	ESpawnActorCollisionHandlingMethod            CollisionHandlingOverride;                         // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0058(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  Instigator;                                        // 0x0060(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsPoolActor;                                      // 0x0068(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroActorManager_D_SpawnActor;

// Function KuroUtility.KuroActorManager.DestroyActor
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_DestroyActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroActorManager_DestroyActor;

// Function KuroUtility.KuroActorManager.GetAllAcquiredComponents
// 0x0018 (0x0018 - 0x0000)
struct KuroActorManager_GetAllAcquiredComponents final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroActorManager_GetAllAcquiredComponents;

// Function KuroUtility.KuroActorManager.GetDummySequence
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_GetDummySequence final
{
public:
	class ULevelSequence*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroActorManager_GetDummySequence;

// Function KuroUtility.KuroActorManager.GetResourceSizeBytes
// 0x0010 (0x0010 - 0x0000)
struct KuroActorManager_GetResourceSizeBytes final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isExclusive;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroActorManager_GetResourceSizeBytes;

// Function KuroUtility.KuroActorManager.IsActorPoolEnable
// 0x0001 (0x0001 - 0x0000)
struct KuroActorManager_IsActorPoolEnable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroActorManager_IsActorPoolEnable;

// Function KuroUtility.KuroActorManager.IsPooledActor
// 0x0010 (0x0010 - 0x0000)
struct KuroActorManager_IsPooledActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroActorManager_IsPooledActor;

// Function KuroUtility.KuroActorManager.RegisterActorSkipProperties
// 0x0018 (0x0018 - 0x0000)
struct KuroActorManager_RegisterActorSkipProperties final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPropertyPair>                  Properties;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroActorManager_RegisterActorSkipProperties;

// Function KuroUtility.KuroActorManager.ResetActorToDefault
// 0x0010 (0x0010 - 0x0000)
struct KuroActorManager_ResetActorToDefault final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroActorManager_ResetActorToDefault;

// Function KuroUtility.KuroActorManager.ResetClassPropertyCache
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_ResetClassPropertyCache final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroActorManager_ResetClassPropertyCache;

// Function KuroUtility.KuroActorManager.ResetDelegates
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_ResetDelegates final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroActorManager_ResetDelegates;

// Function KuroUtility.KuroActorManager.ResetUberGraph
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_ResetUberGraph final
{
public:
	class UObject*                                Obj;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroActorManager_ResetUberGraph;

// Function KuroUtility.KuroActorManager.ResetUObjectByCDO
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_ResetUObjectByCDO final
{
public:
	class UObject*                                Obj;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroActorManager_ResetUObjectByCDO;

// Function KuroUtility.KuroActorManager.SpawnActor
// 0x0070 (0x0070 - 0x0000)
struct KuroActorManager_SpawnActor final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             SpawnTransform;                                    // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	ESpawnActorCollisionHandlingMethod            CollisionHandlingOverride;                         // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0048(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  Instigator;                                        // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsPoolActor;                                      // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroActorManager_SpawnActor;

// Function KuroUtility.KuroActorManager.UnregisterComponent
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_UnregisterComponent final
{
public:
	class UActorComponent*                        Componet;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroActorManager_UnregisterComponent;

// Function KuroUtility.KuroApplicationLibrary.AddApplicationLifetimeDelegate
// 0x0030 (0x0030 - 0x0000)
struct KuroApplicationLibrary_AddApplicationLifetimeDelegate final
{
public:
	TDelegate<void(int32 Type)>                   InDelegate;                                        // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroApplicationLibrary_AddApplicationLifetimeDelegate;

// Function KuroUtility.KuroApplicationLibrary.AddEditorPreEndPIEDelegate
// 0x0030 (0x0030 - 0x0000)
struct KuroApplicationLibrary_AddEditorPreEndPIEDelegate final
{
public:
	TDelegate<void(bool bSimulateInEditor)>       InDelegate;                                        // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroApplicationLibrary_AddEditorPreEndPIEDelegate;

// Function KuroUtility.KuroApplicationLibrary.AddWindowActivationDelegate
// 0x0030 (0x0030 - 0x0000)
struct KuroApplicationLibrary_AddWindowActivationDelegate final
{
public:
	TDelegate<void(bool Activated)>               InDelegate;                                        // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroApplicationLibrary_AddWindowActivationDelegate;

// Function KuroUtility.KuroApplicationLibrary.Test
// 0x0008 (0x0008 - 0x0000)
struct KuroApplicationLibrary_Test final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroApplicationLibrary_Test;

// Function KuroUtility.KuroApplicationLibrary.UnBind
// 0x0001 (0x0001 - 0x0000)
struct KuroApplicationLibrary_UnBind final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroApplicationLibrary_UnBind;

// Function KuroUtility.KuroCollectActorComponent.GetActorWithTag
// 0x0018 (0x0018 - 0x0000)
struct KuroCollectActorComponent_GetActorWithTag final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollectActorType                             Type;                                              // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroCollectActorComponent_GetActorWithTag;

// Function KuroUtility.KuroCompressLibrary.CompressFileOrFolder
// 0x00A0 (0x00A0 - 0x0000)
struct KuroCompressLibrary_CompressFileOrFolder final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DestPath;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float Rate)>                   OnProgress;                                        // 0x0020(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<class FString>& SuccessedPaths)> OnCompressComplete;                 // 0x0048(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnFail;                                            // 0x0070(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         MaxSingleFileReadSize;                             // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroCompressLibrary_CompressFileOrFolder;

// Function KuroUtility.KuroCompressLibrary.CompressFilesOrFoldersAsync
// 0x00A8 (0x00A8 - 0x0000)
struct KuroCompressLibrary_CompressFilesOrFoldersAsync final
{
public:
	TArray<class FString>                         Paths;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 DestPath;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float Rate)>                   OnProgress;                                        // 0x0020(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<class FString>& SuccessedPaths)> OnCompressComplete;                 // 0x0048(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnFail;                                            // 0x0070(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bAutoIncludeFilesUnderFolder;                      // 0x0098(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         MaxSingleFileReadSize;                             // 0x00A0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroCompressLibrary_CompressFilesOrFoldersAsync;

// Function KuroUtility.KuroDemoInteractSubSystem.GetDemoInteractiveActor
// 0x0018 (0x0018 - 0x0000)
struct KuroDemoInteractSubSystem_GetDemoInteractiveActor final
{
public:
	class FName                                   ActorKey;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroDemoInteractSubSystem_GetDemoInteractiveActor;

// Function KuroUtility.KuroMathLibrary.BitwiseLeftShift
// 0x0018 (0x0018 - 0x0000)
struct KuroMathLibrary_BitwiseLeftShift final
{
public:
	int64                                         Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Bit;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroMathLibrary_BitwiseLeftShift;

// Function KuroUtility.KuroMathLibrary.BitwiseRightShift
// 0x0018 (0x0018 - 0x0000)
struct KuroMathLibrary_BitwiseRightShift final
{
public:
	int64                                         Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Bit;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroMathLibrary_BitwiseRightShift;

// Function KuroUtility.KuroMathLibrary.Max
// 0x0018 (0x0018 - 0x0000)
struct KuroMathLibrary_Max final
{
public:
	struct FVector2D                              A;                                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              B;                                                 // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroMathLibrary_Max;

// Function KuroUtility.KuroMathLibrary.Min
// 0x0018 (0x0018 - 0x0000)
struct KuroMathLibrary_Min final
{
public:
	struct FVector2D                              A;                                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              B;                                                 // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroMathLibrary_Min;

// Function KuroUtility.KuroMemoryLibrary.PrintUObjectMemoryInfo
// 0x0008 (0x0008 - 0x0000)
struct KuroMemoryLibrary_PrintUObjectMemoryInfo final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroMemoryLibrary_PrintUObjectMemoryInfo;

// Function KuroUtility.KuroMeshTextureFunctionLibrary.AddMeshesBundleStreamedAllMipsDelegate
// 0x0030 (0x0030 - 0x0000)
struct KuroMeshTextureFunctionLibrary_AddMeshesBundleStreamedAllMipsDelegate final
{
public:
	TDelegate<void(const TArray<class USkeletalMesh*>& SkeletalMeshes, const TArray<class UStaticMesh*>& StaticMeshes)> InDelegate; // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroMeshTextureFunctionLibrary_AddMeshesBundleStreamedAllMipsDelegate;

// Function KuroUtility.KuroMeshTextureFunctionLibrary.AddSkeletalStreamedAllMipsDelegate
// 0x0030 (0x0030 - 0x0000)
struct KuroMeshTextureFunctionLibrary_AddSkeletalStreamedAllMipsDelegate final
{
public:
	TDelegate<void(class USkeletalMesh* SkeletalMesh)> InDelegate;                                   // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroMeshTextureFunctionLibrary_AddSkeletalStreamedAllMipsDelegate;

// Function KuroUtility.KuroMeshTextureFunctionLibrary.AddStaticMeshStreamedAllMipsDelegate
// 0x0030 (0x0030 - 0x0000)
struct KuroMeshTextureFunctionLibrary_AddStaticMeshStreamedAllMipsDelegate final
{
public:
	TDelegate<void(class UStaticMesh* StaticMesh)> InDelegate;                                       // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroMeshTextureFunctionLibrary_AddStaticMeshStreamedAllMipsDelegate;

// Function KuroUtility.KuroMeshTextureFunctionLibrary.ForceMeshesBundleStreamingInAllMips
// 0x0050 (0x0050 - 0x0000)
struct KuroMeshTextureFunctionLibrary_ForceMeshesBundleStreamingInAllMips final
{
public:
	TArray<class USkeletalMesh*>                  MeshBundleSkeletalMeshes;                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UStaticMesh*>                    MeshBundleStaticMeshes;                            // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<class USkeletalMesh*>& SkeletalMeshes, const TArray<class UStaticMesh*>& StaticMeshes)> InDelegate; // 0x0020(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroMeshTextureFunctionLibrary_ForceMeshesBundleStreamingInAllMips;

// Function KuroUtility.KuroMeshTextureFunctionLibrary.HandleMeshesComponentsBundleStreaming
// 0x0028 (0x0028 - 0x0000)
struct KuroMeshTextureFunctionLibrary_HandleMeshesComponentsBundleStreaming final
{
public:
	TArray<class USkeletalMesh*>                  MeshBundleSkeletalMeshes;                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UStaticMesh*>                    MeshBundleStaticMeshes;                            // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bStartForceStreamIn;                               // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroMeshTextureFunctionLibrary_HandleMeshesComponentsBundleStreaming;

// Function KuroUtility.KuroMeshTextureFunctionLibrary.HandleSkeletalMeshComponentStreaming
// 0x0010 (0x0010 - 0x0000)
struct KuroMeshTextureFunctionLibrary_HandleSkeletalMeshComponentStreaming final
{
public:
	class USkeletalMesh*                          skeletalMesh;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartForceStreamIn;                               // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroMeshTextureFunctionLibrary_HandleSkeletalMeshComponentStreaming;

// Function KuroUtility.KuroMeshTextureFunctionLibrary.HandleStaticMeshComponentStreaming
// 0x0010 (0x0010 - 0x0000)
struct KuroMeshTextureFunctionLibrary_HandleStaticMeshComponentStreaming final
{
public:
	class UStaticMesh*                            staticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartForceStreamIn;                               // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroMeshTextureFunctionLibrary_HandleStaticMeshComponentStreaming;

// Function KuroUtility.KuroMeshTextureFunctionLibrary.IsSkeletalMeshComponentStreamingComplete
// 0x0010 (0x0010 - 0x0000)
struct KuroMeshTextureFunctionLibrary_IsSkeletalMeshComponentStreamingComplete final
{
public:
	class USkeletalMesh*                          skeletalMesh;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroMeshTextureFunctionLibrary_IsSkeletalMeshComponentStreamingComplete;

// Function KuroUtility.KuroMeshTextureFunctionLibrary.IsStaticMeshComponentStreamingComplete
// 0x0010 (0x0010 - 0x0000)
struct KuroMeshTextureFunctionLibrary_IsStaticMeshComponentStreamingComplete final
{
public:
	class UStaticMesh*                            staticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroMeshTextureFunctionLibrary_IsStaticMeshComponentStreamingComplete;

// Function KuroUtility.KuroMeshTextureFunctionLibrary.StopMeshesBundleStreamingInAllMips
// 0x0008 (0x0008 - 0x0000)
struct KuroMeshTextureFunctionLibrary_StopMeshesBundleStreamingInAllMips final
{
public:
	int32                                         UniqueInstanceID;                                  // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroMeshTextureFunctionLibrary_StopMeshesBundleStreamingInAllMips;

// Function KuroUtility.KuroMeshTextureFunctionLibrary.UnbindMeshesBundleStreamedAllMipsDelegate
// 0x0001 (0x0001 - 0x0000)
struct KuroMeshTextureFunctionLibrary_UnbindMeshesBundleStreamedAllMipsDelegate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroMeshTextureFunctionLibrary_UnbindMeshesBundleStreamedAllMipsDelegate;

// Function KuroUtility.KuroMeshTextureFunctionLibrary.UnbindSkeletalStreamedAllMipsDelegate
// 0x0001 (0x0001 - 0x0000)
struct KuroMeshTextureFunctionLibrary_UnbindSkeletalStreamedAllMipsDelegate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroMeshTextureFunctionLibrary_UnbindSkeletalStreamedAllMipsDelegate;

// Function KuroUtility.KuroMeshTextureFunctionLibrary.UnbindStaticMeshStreamedAllMipsDelegate
// 0x0001 (0x0001 - 0x0000)
struct KuroMeshTextureFunctionLibrary_UnbindStaticMeshStreamedAllMipsDelegate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroMeshTextureFunctionLibrary_UnbindStaticMeshStreamedAllMipsDelegate;

// Function KuroUtility.KuroPhysicsLibrary.GetHitPoint
// 0x0050 (0x0050 - 0x0000)
struct KuroPhysicsLibrary_GetHitPoint final
{
public:
	struct FVectorDouble                          StartLocation;                                     // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVectorDouble                          EndLocation;                                       // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    TraceComp;                                         // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroHitResult*                         HitResult;                                         // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DrawDuration;                                      // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceTrace;                                        // 0x004C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x004D(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPhysicsLibrary_GetHitPoint;

// Function KuroUtility.KuroPhysicsLibrary.GetSphereHitPoint
// 0x0058 (0x0058 - 0x0000)
struct KuroPhysicsLibrary_GetSphereHitPoint final
{
public:
	struct FVectorDouble                          StartLocation;                                     // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVectorDouble                          EndLocation;                                       // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    TraceComp;                                         // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroHitResult*                         HitResult;                                         // 0x0048(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DrawDuration;                                      // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceTrace;                                        // 0x0054(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0055(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroPhysicsLibrary_GetSphereHitPoint;

// Function KuroUtility.KuroPolypartition.BuildTriangleByVertex2D
// 0x0020 (0x0020 - 0x0000)
struct KuroPolypartition_BuildTriangleByVertex2D final
{
public:
	TArray<struct FVector2D>                      points;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroPolypartition_BuildTriangleByVertex2D;

// Function KuroUtility.KuroStaticAndroidLibrary.AddAndroidScreenChangeDelegate
// 0x0028 (0x0028 - 0x0000)
struct KuroStaticAndroidLibrary_AddAndroidScreenChangeDelegate final
{
public:
	TDelegate<void()>                             Handler;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticAndroidLibrary_AddAndroidScreenChangeDelegate;

// Function KuroUtility.KuroStaticAndroidLibrary.GetCustomChannel
// 0x0010 (0x0010 - 0x0000)
struct KuroStaticAndroidLibrary_GetCustomChannel final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticAndroidLibrary_GetCustomChannel;

// Function KuroUtility.KuroStaticAndroidLibrary.GetDeviceIsEmulator
// 0x0001 (0x0001 - 0x0000)
struct KuroStaticAndroidLibrary_GetDeviceIsEmulator final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticAndroidLibrary_GetDeviceIsEmulator;

// Function KuroUtility.KuroStaticAndroidLibrary.GetDeviceIsRooted
// 0x0001 (0x0001 - 0x0000)
struct KuroStaticAndroidLibrary_GetDeviceIsRooted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticAndroidLibrary_GetDeviceIsRooted;

// Function KuroUtility.KuroStaticAndroidLibrary.GetHarmonyOSVersion
// 0x0010 (0x0010 - 0x0000)
struct KuroStaticAndroidLibrary_GetHarmonyOSVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticAndroidLibrary_GetHarmonyOSVersion;

// Function KuroUtility.KuroStaticAndroidLibrary.IsHarmonyOS
// 0x0001 (0x0001 - 0x0000)
struct KuroStaticAndroidLibrary_IsHarmonyOS final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticAndroidLibrary_IsHarmonyOS;

// Function KuroUtility.KuroStaticAndroidLibrary.OpenAppWithUrl
// 0x0020 (0x0020 - 0x0000)
struct KuroStaticAndroidLibrary_OpenAppWithUrl final
{
public:
	class FString                                 schema;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 failSchema;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticAndroidLibrary_OpenAppWithUrl;

// Function KuroUtility.KuroStaticiOSLibrary.GetDeviceJailbroken
// 0x0001 (0x0001 - 0x0000)
struct KuroStaticiOSLibrary_GetDeviceJailbroken final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticiOSLibrary_GetDeviceJailbroken;

// Function KuroUtility.KuroStaticiOSLibrary.OpenAppWithUrl
// 0x0020 (0x0020 - 0x0000)
struct KuroStaticiOSLibrary_OpenAppWithUrl final
{
public:
	class FString                                 url;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 failUrl;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticiOSLibrary_OpenAppWithUrl;

// Function KuroUtility.KuroStaticLibrary.AddToRoot
// 0x0008 (0x0008 - 0x0000)
struct KuroStaticLibrary_AddToRoot final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticLibrary_AddToRoot;

// Function KuroUtility.KuroStaticLibrary.ApplyChangeToBlueprint
// 0x0008 (0x0008 - 0x0000)
struct KuroStaticLibrary_ApplyChangeToBlueprint final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticLibrary_ApplyChangeToBlueprint;

// Function KuroUtility.KuroStaticLibrary.ArrayToBuffer
// 0x0020 (0x0020 - 0x0000)
struct KuroStaticLibrary_ArrayToBuffer final
{
public:
	TArray<uint8>                                 InArray;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FArrayBuffer                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticLibrary_ArrayToBuffer;

// Function KuroUtility.KuroStaticLibrary.Base64Decode
// 0x0020 (0x0020 - 0x0000)
struct KuroStaticLibrary_Base64Decode final
{
public:
	class FString                                 inString;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticLibrary_Base64Decode;

// Function KuroUtility.KuroStaticLibrary.Base64Encode
// 0x0020 (0x0020 - 0x0000)
struct KuroStaticLibrary_Base64Encode final
{
public:
	class FString                                 inString;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticLibrary_Base64Encode;

// Function KuroUtility.KuroStaticLibrary.Base64EncodeBinary
// 0x0020 (0x0020 - 0x0000)
struct KuroStaticLibrary_Base64EncodeBinary final
{
public:
	struct FArrayBuffer                           InBuffer;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticLibrary_Base64EncodeBinary;

// Function KuroUtility.KuroStaticLibrary.Base64EncodeWithConvertToUTF8
// 0x0020 (0x0020 - 0x0000)
struct KuroStaticLibrary_Base64EncodeWithConvertToUTF8 final
{
public:
	class FString                                 inString;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticLibrary_Base64EncodeWithConvertToUTF8;

// Function KuroUtility.KuroStaticLibrary.Base64EncodeWithSpecifyChar
// 0x0030 (0x0030 - 0x0000)
struct KuroStaticLibrary_Base64EncodeWithSpecifyChar final
{
public:
	TArray<uint8>                                 ByteArray;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 SpecifyChar;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticLibrary_Base64EncodeWithSpecifyChar;

// Function KuroUtility.KuroStaticLibrary.Base64EncodeWithSpecifyCharWithConvertToUTF8
// 0x0030 (0x0030 - 0x0000)
struct KuroStaticLibrary_Base64EncodeWithSpecifyCharWithConvertToUTF8 final
{
public:
	class FString                                 inString;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SpecifyChar;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticLibrary_Base64EncodeWithSpecifyCharWithConvertToUTF8;

// Function KuroUtility.KuroStaticLibrary.BindCustomGetTimeBetweenGarbageCollectionPassesDelegate
// 0x0028 (0x0028 - 0x0000)
struct KuroStaticLibrary_BindCustomGetTimeBetweenGarbageCollectionPassesDelegate final
{
public:
	TDelegate<void(float MBFree, float ExtraDevelopmentMemorySize, int32 NumObjects)> Delegate;      // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroStaticLibrary_BindCustomGetTimeBetweenGarbageCollectionPassesDelegate;

// Function KuroUtility.KuroStaticLibrary.BindDeviceLangChangeDelegate
// 0x0028 (0x0028 - 0x0000)
struct KuroStaticLibrary_BindDeviceLangChangeDelegate final
{
