#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroGameplayUI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class KuroGameplayUI.DamageBatchView
// 0x0090 (0x00C0 - 0x0030)
class alignas(0x10) UDamageBatchView final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AUIBaseActor*                           RootActor;                                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UUIText*>                        TextList;                                          // 0x0048(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UUITextAdditionalUVModifier*>    TextUvModifierList;                                // 0x0058(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UUIDynamicBatchMesh*                    DynamicBatch;                                      // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIItem*                                AnchorItem;                                        // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USimpleDamageView*>              UnusedSimpleDamageViewList;                        // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimpleDamageViewInfo*>          UnusedSimpleDamageViewInfoList;                    // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class USimpleDamageViewInfo*>          SimpleDamageViewInfoList;                          // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DamageBatchView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DamageBatchView")
	}
	static class UDamageBatchView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDamageBatchView>();
	}
};
DUMPER7_ASSERTS_UDamageBatchView;

// Class KuroGameplayUI.DamageUiManager
// 0x0170 (0x01A0 - 0x0030)
class alignas(0x10) UDamageUiManager final : public UObject
{
public:
	uint8                                         Pad_30[0x140];                                     // 0x0030(0x0140)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraSystem*>                 CritNiagaraList;                                   // 0x0170(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UDamageBatchView*                       DamageBatchView;                                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDamageViewVisible;                                // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_World*                             KscWorld;                                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDamageUiManager* CreateInstance(class UObject* Outer_0);
	static void DestroyInstance();
	static class UDamageUiManager* GetInstance();

	void AddCritNiagara(class UNiagaraSystem* CritNiagara);
	void AddDamageInfo(const struct FDamageInfo& DamageInfo);
	void AddDamageViewData(const struct FDamageViewData& InDamageViewData);
	void ClearDamageInfo();
	void InitAllRes(class USceneComponent* Parent, class AUIBaseActor* DynamicBatchActor, class AUIBaseActor* DamageActor, int32 PreloadCount, bool bMobilePlatform);
	void InitDamageConfig(const struct FDamageConfig& InDamageConfig);
	void Update(const float& DeltaTime, const struct FVectorDouble& CameraLocation, class APlayerController* Player);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DamageUiManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DamageUiManager")
	}
	static class UDamageUiManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDamageUiManager>();
	}
};
DUMPER7_ASSERTS_UDamageUiManager;

// Class KuroGameplayUI.KSC_HeadStateDynamicBatchView
// 0x0020 (0x0050 - 0x0030)
class UKSC_HeadStateDynamicBatchView final : public UObject
{
public:
	class UKSC_HeadStateView*                     HeadStateView;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AUIBaseActor*                           RootActor;                                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIDynamicBatchMesh*                    DynamicBatch;                                      // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIItem*                                HpParentItem;                                      // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_HeadStateDynamicBatchView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_HeadStateDynamicBatchView")
	}
	static class UKSC_HeadStateDynamicBatchView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_HeadStateDynamicBatchView>();
	}
};
DUMPER7_ASSERTS_UKSC_HeadStateDynamicBatchView;

// Class KuroGameplayUI.KSC_HeadStateManager
// 0x0088 (0x00B8 - 0x0030)
class UKSC_HeadStateManager final : public UObject
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_HeadStateDynamicBatchView*         DynamicBatchView;                                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKSC_World*                             KscWorld;                                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x28];                                      // 0x0090(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UKSC_HeadStateManager* CreateInstance(class UObject* Outer_0);
	static void DestroyInstance();
	static class UKSC_HeadStateManager* GetInstance();

	void InitAllRes(class USceneComponent* Parent, class AUIBaseActor* DynamicBatchActor, class AUIBaseActor* HeadStateActor, class UCurveFloat* ScaleCurve);
	void Update(const float& DeltaTime, const struct FVectorDouble& CameraLocation);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_HeadStateManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_HeadStateManager")
	}
	static class UKSC_HeadStateManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_HeadStateManager>();
	}
};
DUMPER7_ASSERTS_UKSC_HeadStateManager;

// Class KuroGameplayUI.KSC_HeadStateView
// 0x0068 (0x0098 - 0x0030)
class UKSC_HeadStateView final : public UObject
{
public:
	class UCurveFloat*                            ScaleCurve;                                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AUIBaseActor*                           RootActor;                                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIItem*                                RootItem;                                          // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUITextAdditionalUVModifier*            HpBarUVModifier;                                   // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUITextAdditionalUVModifier*            HpBarBufferUVModifier;                             // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUITextAdditionalUVModifier*            ShieldBarUVModifier;                               // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UUITextAdditionalUVModifier*>    UvModifierList;                                    // 0x0060(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UUIItem*>                        UvModifierItemList;                                // 0x0070(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x18];                                      // 0x0080(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_HeadStateView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_HeadStateView")
	}
	static class UKSC_HeadStateView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_HeadStateView>();
	}
};
DUMPER7_ASSERTS_UKSC_HeadStateView;

// Class KuroGameplayUI.SimpleDamageView
// 0x0020 (0x0050 - 0x0030)
class USimpleDamageView final : public UObject
{
public:
	class AUIBaseActor*                           RootActor;                                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIItem*                                RootItem;                                          // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIItem*                                CritItem;                                          // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUINiagara*                             CritNiagara;                                       // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimpleDamageView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleDamageView")
	}
	static class USimpleDamageView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleDamageView>();
	}
};
DUMPER7_ASSERTS_USimpleDamageView;

// Class KuroGameplayUI.SimpleDamageViewInfo
// 0x0078 (0x00A8 - 0x0030)
class USimpleDamageViewInfo final : public UObject
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class USimpleDamageView*                      SimpleDamageView;                                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryHandle*                        GeometryHandle;                                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x18];                                      // 0x0090(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimpleDamageViewInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleDamageViewInfo")
	}
	static class USimpleDamageViewInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleDamageViewInfo>();
	}
};
DUMPER7_ASSERTS_USimpleDamageViewInfo;

}

