#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroGameBudget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum KuroGameBudget.EGameBudgetBlueprintGroup
// NumValues: 0x000D
enum class EGameBudgetBlueprintGroup : uint8
{
	None                                     = 0,
	DisableTick                              = 1,
	Singleton                                = 2,
	SceneActor                               = 3,
	FarActor                                 = 7,
	SuperFarActor                            = 4,
	DynamicPhysicsInteractionActor           = 5,
	StaticPhysicInteractionActor             = 6,
	HighPriorityPhysicInteractionActor       = 8,
	SparseGridPhysicsInteractionActor        = 10,
	SpecialBlueprintActor                    = 9,
	Max                                      = 11,
	EGameBudgetBlueprintGroup_MAX            = 12,
};

// Enum KuroGameBudget.EGameBudgetBlueprintEnvironment
// NumValues: 0x0003
enum class EGameBudgetBlueprintEnvironment : uint8
{
	Scene                                    = 0,
	UIScene                                  = 1,
	EGameBudgetBlueprintEnvironment_MAX      = 2,
};

// Enum KuroGameBudget.ESignificanceGroup
// NumValues: 0x0006
enum class ESignificanceGroup : uint8
{
	Idle                                     = 0,
	Low                                      = 1,
	Middle                                   = 2,
	High                                     = 3,
	Critical                                 = 4,
	ESignificanceGroup_MAX                   = 5,
};

// Enum KuroGameBudget.EActorCavernMode
// NumValues: 0x0005
enum class EActorCavernMode : uint8
{
	ActorCavernMode_None                     = 0,
	ActorCavernMode_Outside                  = 1,
	ActorCavernMode_Inside                   = 2,
	ActorCavernMode_IntermediateZone         = 3,
	ActorCavernMode_MAX                      = 4,
};

// Enum KuroGameBudget.EDisableActorTickStrategy
// NumValues: 0x0006
enum class EDisableActorTickStrategy : uint8
{
	DisableActorTickStrategy_None            = 0,
	DisableActorTickStrategy_DistanceOnly    = 1,
	DisableActorTickStrategy_NotRenderedOnly = 2,
	DisableActorTickStrategy_NotRenderedAndDistance = 3,
	DisableActorTickStrategy_MaxInterval     = 4,
	DisableActorTickStrategy_MAX             = 5,
};

// Enum KuroGameBudget.EGameBudgetAllocatorActorMode
// NumValues: 0x0005
enum class EGameBudgetAllocatorActorMode : uint8
{
	GBA_ActorMode_Rendered                   = 0,
	GBA_ActorMode_NotRendered                = 1,
	GBA_ActorMode_Fighting                   = 2,
	GBA_ActorMode_Num                        = 3,
	GBA_ActorMode_MAX                        = 4,
};

// Enum KuroGameBudget.EGameBudgetAllocatorGlobalMode
// NumValues: 0x0005
enum class EGameBudgetAllocatorGlobalMode : uint8
{
	GBA_GlobalMode_Normal                    = 0,
	GBA_GlobalMode_Fighting                  = 1,
	GBA_GlobalMode_Cutscene                  = 2,
	GBA_GlobalMode_Num                       = 3,
	GBA_GlobalMode_MAX                       = 4,
};

// Enum KuroGameBudget.EKuroPlatformFlags
// NumValues: 0x0006
enum class EKuroPlatformFlags : uint8
{
	Windows                                  = 0,
	Android                                  = 1,
	IOS                                      = 2,
	PS5                                      = 3,
	Mac                                      = 4,
	EKuroPlatformFlags_MAX                   = 5,
};

// ScriptStruct KuroGameBudget.GameBudgetBoundsScreenRadiusConfig
// 0x0008 (0x0008 - 0x0000)
struct FGameBudgetBoundsScreenRadiusConfig final
{
public:
	float                                         TickReductionStartScreenRatio;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TickReductionIntervalScreenRatio;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameBudgetBoundsScreenRadiusConfig;

// ScriptStruct KuroGameBudget.KuroGameBudgetBlueprint
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FKuroGameBudgetBlueprint final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EGameBudgetBlueprintGroup                     GroupType;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SupportedPlatforms;                                // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRegisterGameBudgetTick;                           // 0x000A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRegisterOnEnableChangeEvent;                      // 0x000B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRegisterOnVisibilityChangeEvent;                  // 0x000C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRegisterOnEnvInteractChangeEvent;                 // 0x000D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSyncComponentTick;                                // 0x000E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseBoundsCalculateDistance;                       // 0x000F(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseScreenRadiusCalculateTickInterval;             // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x37];                                      // 0x0011(0x0037)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKuroGameBudgetBlueprint;

// ScriptStruct KuroGameBudget.GameBudgetAllocatorGroupConfig
// 0x00D0 (0x00D0 - 0x0000)
struct FGameBudgetAllocatorGroupConfig final
{
public:
	class FName                                   GroupName;                                         // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESignificanceGroup                            SignificanceGroup;                                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        TickPriority;                                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDisableActorTickStrategy                     DisableActorTickStrategy;                          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        DisableActorTickDistance;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0xB4];                                      // 0x001C(0x00B4)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGameBudgetAllocatorGroupConfig;

// ScriptStruct KuroGameBudget.GameBudgetAllocatorTickDetailConfig
// 0x0010 (0x0010 - 0x0000)
struct FGameBudgetAllocatorTickDetailConfig final
{
public:
	uint32                                        MaxTickInterval;                                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        TickReductionStartSize;                            // 0x0004(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        TickReductionIntervalSize;                         // 0x0006(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameBudgetBoundsScreenRadiusConfig    ScreenRadiusConfig;                                // 0x0008(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameBudgetAllocatorTickDetailConfig;

// ScriptStruct KuroGameBudget.GameBudgetAllocatorAfterTickFunction
// 0x0008 (0x0030 - 0x0028)
struct FGameBudgetAllocatorAfterTickFunction final : public FTickFunction
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGameBudgetAllocatorAfterTickFunction;

// ScriptStruct KuroGameBudget.GameBudgetAllocatorTickFunction
// 0x0008 (0x0030 - 0x0028)
struct FGameBudgetAllocatorTickFunction final : public FTickFunction
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGameBudgetAllocatorTickFunction;

// ScriptStruct KuroGameBudget.GameBudgetBlueprintGroupConfig
// 0x0018 (0x0018 - 0x0000)
struct FGameBudgetBlueprintGroupConfig final
{
public:
	EGameBudgetBlueprintGroup                     Group;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GameBudgetGroupName;                               // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisableCollisionRange;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisablePhysicsSimulationRange;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameBudgetBlueprintGroupConfig;

}

