#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroLogAnalyzer

#include "Basic.hpp"


namespace SDK::Params
{

// Function KuroLogAnalyzer.KuroLogAnalyzerLibrary.Clear
// 0x0001 (0x0001 - 0x0000)
struct KuroLogAnalyzerLibrary_Clear final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroLogAnalyzerLibrary_Clear;

// Function KuroLogAnalyzer.KuroLogAnalyzerLibrary.Initialize
// 0x0038 (0x0038 - 0x0000)
struct KuroLogAnalyzerLibrary_Initialize final
{
public:
	int32                                         InVerbosity;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FName& Category, const int32 Verbosity, const class FString& Format, const class FString& Message)> InLogDelegate; // 0x0008(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         InMessageMaxSize;                                  // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0034(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroLogAnalyzerLibrary_Initialize;

// Function KuroLogAnalyzer.KuroLogAnalyzerLibrary.SetEnable
// 0x0001 (0x0001 - 0x0000)
struct KuroLogAnalyzerLibrary_SetEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroLogAnalyzerLibrary_SetEnable;

}

