#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroSimpleCombat

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "KuroSimpleCombat_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function KuroSimpleCombat.InstanceCapsuleComponent.AddNewInstanceData
// 0x0040 (0x0040 - 0x0000)
struct InstanceCapsuleComponent_AddNewInstanceData final
{
public:
	struct FTransform                             WorldSpaceInstanceTransform;                       // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InstanceCapsuleComponent_AddNewInstanceData;

// Function KuroSimpleCombat.InstanceCapsuleComponent.UpdateInstanceBodyTransform
// 0x0040 (0x0040 - 0x0000)
struct InstanceCapsuleComponent_UpdateInstanceBodyTransform final
{
public:
	int32                                         InstanceIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             WorldSpaceInstanceTransform;                       // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InstanceCapsuleComponent_UpdateInstanceBodyTransform;

// Function KuroSimpleCombat.InstanceCapsuleComponent.UpdateInstanceTransforms
// 0x0020 (0x0020 - 0x0000)
struct InstanceCapsuleComponent_UpdateInstanceTransforms final
{
public:
	TArray<int32>                                 InstanceIndices;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     InTransforms;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InstanceCapsuleComponent_UpdateInstanceTransforms;

// Function KuroSimpleCombat.KSC_AttrSet.AssignAttrListen
// 0x0030 (0x0030 - 0x0000)
struct KSC_AttrSet_AssignAttrListen final
{
public:
	EKSC_AttrType                                 Id;                                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EKSC_AttrType AttrType, int32 Value)> InDelegate;                                 // 0x0008(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_AttrSet_AssignAttrListen;

// Function KuroSimpleCombat.KSC_AttrSet.RemoveAttrListen
// 0x0030 (0x0030 - 0x0000)
struct KSC_AttrSet_RemoveAttrListen final
{
public:
	EKSC_AttrType                                 Id;                                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EKSC_AttrType AttrType, int32 Value)> InDelegate;                                 // 0x0008(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_AttrSet_RemoveAttrListen;

// Function KuroSimpleCombat.KSC_Buff_DiffTransferAddAttr.OnAttrChange
// 0x0008 (0x0008 - 0x0000)
struct KSC_Buff_DiffTransferAddAttr_OnAttrChange final
{
public:
	EKSC_AttrType                                 AttrType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Buff_DiffTransferAddAttr_OnAttrChange;

// Function KuroSimpleCombat.KSC_Buff_ListenEvent.OnAttrChange
// 0x0008 (0x0008 - 0x0000)
struct KSC_Buff_ListenEvent_OnAttrChange final
{
public:
	EKSC_AttrType                                 AttrType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Buff_ListenEvent_OnAttrChange;

// Function KuroSimpleCombat.KSC_Buff_Period.OnAttackSpeedChange
// 0x0008 (0x0008 - 0x0000)
struct KSC_Buff_Period_OnAttackSpeedChange final
{
public:
	EKSC_AttrType                                 AttrType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Buff_Period_OnAttackSpeedChange;

// Function KuroSimpleCombat.KSC_GPUHeadUI.InitHeadUIInternal
// 0x0010 (0x0010 - 0x0000)
struct KSC_GPUHeadUI_InitHeadUIInternal final
{
public:
	class UInstancedStaticMeshComponent*          InComp;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               InMI;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_GPUHeadUI_InitHeadUIInternal;

// Function KuroSimpleCombat.KSC_Buff_TransferAddAttr.OnAttrChange
// 0x0008 (0x0008 - 0x0000)
struct KSC_Buff_TransferAddAttr_OnAttrChange final
{
public:
	EKSC_AttrType                                 AttrType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Buff_TransferAddAttr_OnAttrChange;

// Function KuroSimpleCombat.KSC_BuffId.AddBuffDA
// 0x0010 (0x0010 - 0x0000)
struct KSC_BuffId_AddBuffDA final
{
public:
	int64                                         BuffId;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKSC_DA_Buff*                           Data;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_BuffId_AddBuffDA;

// Function KuroSimpleCombat.KSC_Skill.GetSkillCoolDownMax
// 0x0004 (0x0004 - 0x0000)
struct KSC_Skill_GetSkillCoolDownMax final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Skill_GetSkillCoolDownMax;

// Function KuroSimpleCombat.KSC_Skill.GetSkillCoolDownRemain
// 0x0004 (0x0004 - 0x0000)
struct KSC_Skill_GetSkillCoolDownRemain final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Skill_GetSkillCoolDownRemain;

// Function KuroSimpleCombat.KSC_PlayerHeadUiHandle.OnAttrChange
// 0x0008 (0x0008 - 0x0000)
struct KSC_PlayerHeadUiHandle_OnAttrChange final
{
public:
	EKSC_AttrType                                 AttrType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_PlayerHeadUiHandle_OnAttrChange;

// Function KuroSimpleCombat.KuroSimpleCombatSubsystem.CreateWorld
// 0x0008 (0x0008 - 0x0000)
struct KuroSimpleCombatSubsystem_CreateWorld final
{
public:
	class UKSC_World*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSimpleCombatSubsystem_CreateWorld;

// Function KuroSimpleCombat.KuroSimpleCombatSubsystem.GetKSCWorld
// 0x0008 (0x0008 - 0x0000)
struct KuroSimpleCombatSubsystem_GetKSCWorld final
{
public:
	class UKSC_World*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSimpleCombatSubsystem_GetKSCWorld;

// Function KuroSimpleCombat.KSC_SkillComp.GetSkillCollDown
// 0x0004 (0x0004 - 0x0000)
struct KSC_SkillComp_GetSkillCollDown final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_SkillComp_GetSkillCollDown;

// Function KuroSimpleCombat.KSC_Skill_ManualBulletAttack.OnBulletHit
// 0x0040 (0x0040 - 0x0000)
struct KSC_Skill_ManualBulletAttack_OnBulletHit final
{
public:
	struct FKSC_BulletTargetContext               TargetContext;                                     // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Skill_ManualBulletAttack_OnBulletHit;

// Function KuroSimpleCombat.KSC_World.AddDaEntity
// 0x0050 (0x0050 - 0x0000)
struct KSC_World_AddDaEntity final
{
public:
	class UKSC_DA_Entity*                         DaEntity;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsPreview;                                         // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CreatureId;                                        // 0x0044(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AKSC_Entity*                            ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_AddDaEntity;

// Function KuroSimpleCombat.KSC_World.AddDecorator
// 0x0010 (0x0010 - 0x0000)
struct KSC_World_AddDecorator final
{
public:
	class UKSC_DA_Decorator*                      DaDecorator;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_World_AddDecorator;

// Function KuroSimpleCombat.KSC_World.AddHeadUI
// 0x0010 (0x0010 - 0x0000)
struct KSC_World_AddHeadUI final
{
public:
	TSubclassOf<class AKSC_GPUHeadUI>             InHeadUIClass;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_World_AddHeadUI;

// Function KuroSimpleCombat.KSC_World.AssignBatchRemoveDelegate
// 0x0028 (0x0028 - 0x0000)
struct KSC_World_AssignBatchRemoveDelegate final
{
public:
	TDelegate<void(const TArray<struct FKSC_RemoveContext>& RemoveContext)> InDelegate;              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_AssignBatchRemoveDelegate;

// Function KuroSimpleCombat.KSC_World.AssignKSCEntitySpawn
// 0x0028 (0x0028 - 0x0000)
struct KSC_World_AssignKSCEntitySpawn final
{
public:
	TDelegate<void(const struct FTransformDouble& OwnerTransform, const TArray<struct FKSC_SpawnEntity>& SpawnEntities)> InDelegate; // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_AssignKSCEntitySpawn;

// Function KuroSimpleCombat.KSC_World.AssignLandFireSpawnDelegate
// 0x0028 (0x0028 - 0x0000)
struct KSC_World_AssignLandFireSpawnDelegate final
{
public:
	TDelegate<void(const TArray<struct FKSC_LandFireContext>& LandFireContext)> InDelegate;          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_AssignLandFireSpawnDelegate;

// Function KuroSimpleCombat.KSC_World.AssignWorldAttrListen
// 0x0030 (0x0030 - 0x0000)
struct KSC_World_AssignWorldAttrListen final
{
public:
	EKSC_WorldAttrType                            Id;                                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EKSC_WorldAttrType AttrType, int32 OldValue, int32 NewValue)> InDelegate;         // 0x0008(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_AssignWorldAttrListen;

// Function KuroSimpleCombat.KSC_World.D_AddDaEntity
// 0x0060 (0x0060 - 0x0000)
struct KSC_World_D_AddDaEntity final
{
public:
	class UKSC_DA_Entity*                         DaEntity;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       Transform;                                         // 0x0010(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          InIsPreview;                                       // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CreatureId;                                        // 0x0054(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AKSC_Entity*                            ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_D_AddDaEntity;

// Function KuroSimpleCombat.KSC_World.Debug_GetEntityAttr
// 0x0060 (0x0060 - 0x0000)
struct KSC_World_Debug_GetEntityAttr final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EKSC_AttrType, int32>                    Attr;                                              // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_World_Debug_GetEntityAttr;

// Function KuroSimpleCombat.KSC_World.Debug_GetEntityBuffs
// 0x0060 (0x0060 - 0x0000)
struct KSC_World_Debug_GetEntityBuffs final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UKSC_DA_Buff*, int32>              Buffs;                                             // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_World_Debug_GetEntityBuffs;

// Function KuroSimpleCombat.KSC_World.Debug_GetEntityTags
// 0x0060 (0x0060 - 0x0000)
struct KSC_World_Debug_GetEntityTags final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, int32>              Tags;                                              // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_World_Debug_GetEntityTags;

// Function KuroSimpleCombat.KSC_World.Debug_GetOriginalTagName
// 0x0020 (0x0020 - 0x0000)
struct KSC_World_Debug_GetOriginalTagName final
{
public:
	class FName                                   TagName;                                           // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_Debug_GetOriginalTagName;

// Function KuroSimpleCombat.KSC_World.Debug_GetWorldAttr
// 0x0058 (0x0058 - 0x0000)
struct KSC_World_Debug_GetWorldAttr final
{
public:
	TMap<EKSC_WorldAttrType, int32>               Attr;                                              // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_World_Debug_GetWorldAttr;

// Function KuroSimpleCombat.KSC_World.Debug_IsEntityAlive
// 0x0008 (0x0008 - 0x0000)
struct KSC_World_Debug_IsEntityAlive final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_World_Debug_IsEntityAlive;

// Function KuroSimpleCombat.KSC_World.Debug_SetEntityAttr
// 0x0010 (0x0010 - 0x0000)
struct KSC_World_Debug_SetEntityAttr final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_AttrType                                 Attr;                                              // 0x0004(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_World_Debug_SetEntityAttr;

// Function KuroSimpleCombat.KSC_World.Debug_SetEntityTag
// 0x0018 (0x0018 - 0x0000)
struct KSC_World_Debug_SetEntityTag final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Attr;                                              // 0x0004(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TagCount;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_World_Debug_SetEntityTag;

// Function KuroSimpleCombat.KSC_World.GetEntityById
// 0x0010 (0x0010 - 0x0000)
struct KSC_World_GetEntityById final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AKSC_Entity*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_GetEntityById;

// Function KuroSimpleCombat.KSC_World.GetEntityPositionsEx
// 0x0010 (0x0010 - 0x0000)
struct KSC_World_GetEntityPositionsEx final
{
public:
	TArray<struct FKSC_MiniMapContext>            EntityPositions;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_GetEntityPositionsEx;

// Function KuroSimpleCombat.KSC_World.GetHeadHpInfos
// 0x0010 (0x0010 - 0x0000)
struct KSC_World_GetHeadHpInfos final
{
public:
	TArray<struct FKSC_HeadHpContext>             HpInfos;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_GetHeadHpInfos;

// Function KuroSimpleCombat.KSC_World.GetWorldAttr
// 0x0008 (0x0008 - 0x0000)
struct KSC_World_GetWorldAttr final
{
public:
	EKSC_WorldAttrType                            Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_GetWorldAttr;

// Function KuroSimpleCombat.KSC_World.ModifyWorldAttr
// 0x0008 (0x0008 - 0x0000)
struct KSC_World_ModifyWorldAttr final
{
public:
	EKSC_WorldAttrType                            Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_ModifyWorldAttr;

// Function KuroSimpleCombat.KSC_World.PopHitInfos
// 0x0010 (0x0010 - 0x0000)
struct KSC_World_PopHitInfos final
{
public:
	TArray<struct FKSC_HitContext>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_PopHitInfos;

// Function KuroSimpleCombat.KSC_World.RemoveDecorator
// 0x0010 (0x0010 - 0x0000)
struct KSC_World_RemoveDecorator final
{
public:
	class UKSC_DA_Decorator*                      DaDecorator;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_World_RemoveDecorator;

// Function KuroSimpleCombat.KSC_World.RemoveEntity
// 0x0008 (0x0008 - 0x0000)
struct KSC_World_RemoveEntity final
{
public:
	class AKSC_Entity*                            Entity;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_RemoveEntity;

// Function KuroSimpleCombat.KSC_World.RemoveEntityReason
// 0x0018 (0x0018 - 0x0000)
struct KSC_World_RemoveEntityReason final
{
public:
	class AKSC_Entity*                            Entity;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Reason;                                            // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_World_RemoveEntityReason;

// Function KuroSimpleCombat.KSC_World.RemoveWorldAttrListen
// 0x0030 (0x0030 - 0x0000)
struct KSC_World_RemoveWorldAttrListen final
{
public:
	EKSC_WorldAttrType                            Id;                                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EKSC_WorldAttrType AttrType, int32 OldValue, int32 NewValue)> InDelegate;         // 0x0008(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_RemoveWorldAttrListen;

// Function KuroSimpleCombat.KSC_World.SetObstacleSegments
// 0x0010 (0x0010 - 0x0000)
struct KSC_World_SetObstacleSegments final
{
public:
	TArray<struct FKSC_Segment>                   InObstacleSegments;                                // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_SetObstacleSegments;

// Function KuroSimpleCombat.KSC_World.SetWorldAttr
// 0x0008 (0x0008 - 0x0000)
struct KSC_World_SetWorldAttr final
{
public:
	EKSC_WorldAttrType                            Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_SetWorldAttr;

// Function KuroSimpleCombat.KSC_World.SetWorldBounds
// 0x0008 (0x0008 - 0x0000)
struct KSC_World_SetWorldBounds final
{
public:
	class UKSC_DA_WorldBounds*                    DAWorldBounds;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_SetWorldBounds;

// Function KuroSimpleCombat.KSC_World.SetWorldTimeDilation
// 0x0004 (0x0004 - 0x0000)
struct KSC_World_SetWorldTimeDilation final
{
public:
	float                                         NewTimeDilation;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_SetWorldTimeDilation;

// Function KuroSimpleCombat.KSC_World.GetBuffData
// 0x0008 (0x0008 - 0x0000)
struct KSC_World_GetBuffData final
{
public:
	class UKSC_BuffId*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_World_GetBuffData;

// Function KuroSimpleCombat.KSC_TopBossHeadUiHandle.OnAttrChange
// 0x0008 (0x0008 - 0x0000)
struct KSC_TopBossHeadUiHandle_OnAttrChange final
{
public:
	EKSC_AttrType                                 AttrType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_TopBossHeadUiHandle_OnAttrChange;

// Function KuroSimpleCombat.KSC_Skill_BulletAttack.OnBulletHit
// 0x0040 (0x0040 - 0x0000)
struct KSC_Skill_BulletAttack_OnBulletHit final
{
public:
	struct FKSC_BulletTargetContext               TargetContext;                                     // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Skill_BulletAttack_OnBulletHit;

// Function KuroSimpleCombat.KSC_DamageId.AddDamageData
// 0x0010 (0x0010 - 0x0000)
struct KSC_DamageId_AddDamageData final
{
public:
	int32                                         DamageId;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKSCDamage                             Data;                                              // 0x0004(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_DamageId_AddDamageData;

// Function KuroSimpleCombat.KSC_DamageId.UpdateDamageAmplify
// 0x0008 (0x0008 - 0x0000)
struct KSC_DamageId_UpdateDamageAmplify final
{
public:
	int32                                         DamageId;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Amplify;                                           // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_DamageId_UpdateDamageAmplify;

// Function KuroSimpleCombat.KSC_Entity.ApplyBuffSelf
// 0x0008 (0x0008 - 0x0000)
struct KSC_Entity_ApplyBuffSelf final
{
public:
	class UKSC_DA_Buff*                           DaBuff;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_ApplyBuffSelf;

// Function KuroSimpleCombat.KSC_Entity.Dead
// 0x0004 (0x0004 - 0x0000)
struct KSC_Entity_Dead final
{
public:
	int32                                         KillBy;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_Dead;

// Function KuroSimpleCombat.KSC_Entity.GetMoveComponent
// 0x0008 (0x0008 - 0x0000)
struct KSC_Entity_GetMoveComponent final
{
public:
	class UKSC_Move*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_GetMoveComponent;

// Function KuroSimpleCombat.KSC_Entity.GetRenderActor
// 0x0008 (0x0008 - 0x0000)
struct KSC_Entity_GetRenderActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_GetRenderActor;

// Function KuroSimpleCombat.KSC_Entity.RemoveBuffSelf
// 0x0008 (0x0008 - 0x0000)
struct KSC_Entity_RemoveBuffSelf final
{
public:
	class UKSC_DA_Buff*                           DaBuff;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_RemoveBuffSelf;

// Function KuroSimpleCombat.KSC_Entity.RemoveDaBuffImmediately
// 0x0008 (0x0008 - 0x0000)
struct KSC_Entity_RemoveDaBuffImmediately final
{
public:
	class UKSC_DA_Buff*                           DaBuff;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_RemoveDaBuffImmediately;

// Function KuroSimpleCombat.KSC_Entity.SetAttr
// 0x0008 (0x0008 - 0x0000)
struct KSC_Entity_SetAttr final
{
public:
	EKSC_AttrType                                 Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_SetAttr;

// Function KuroSimpleCombat.KSC_Entity.SetFaction
// 0x0001 (0x0001 - 0x0000)
struct KSC_Entity_SetFaction final
{
public:
	EKSC_Faction                                  Faction;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_SetFaction;

// Function KuroSimpleCombat.KSC_Entity.SetIgnoreFactions
// 0x0010 (0x0010 - 0x0000)
struct KSC_Entity_SetIgnoreFactions final
{
public:
	TArray<EKSC_Faction>                          Factions;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_SetIgnoreFactions;

// Function KuroSimpleCombat.KSC_Entity.SetLocationByWorld
// 0x0018 (0x0018 - 0x0000)
struct KSC_Entity_SetLocationByWorld final
{
public:
	struct FVectorDouble                          D_Location;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_SetLocationByWorld;

// Function KuroSimpleCombat.KSC_Entity.SetRenderActor
// 0x0008 (0x0008 - 0x0000)
struct KSC_Entity_SetRenderActor final
{
public:
	class AActor*                                 RenderActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_SetRenderActor;

// Function KuroSimpleCombat.KSC_Entity.SetTransformByWorld
// 0x0040 (0x0040 - 0x0000)
struct KSC_Entity_SetTransformByWorld final
{
public:
	struct FTransformDouble                       D_Transform;                                       // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_SetTransformByWorld;

// Function KuroSimpleCombat.KSC_Entity.TryActiveSKill
// 0x0004 (0x0004 - 0x0000)
struct KSC_Entity_TryActiveSKill final
{
public:
	int32                                         SkillIndex;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_TryActiveSKill;

// Function KuroSimpleCombat.KSC_Entity.UpdateBuffWithStackNumSelf
// 0x0010 (0x0010 - 0x0000)
struct KSC_Entity_UpdateBuffWithStackNumSelf final
{
public:
	class UKSC_DA_Buff*                           DaBuff;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StackNum;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_Entity_UpdateBuffWithStackNumSelf;

// Function KuroSimpleCombat.KSC_Entity.GetSceneComp
// 0x0008 (0x0008 - 0x0000)
struct KSC_Entity_GetSceneComp final
{
public:
	class UKSC_SceneComp*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_GetSceneComp;

// Function KuroSimpleCombat.KSC_Entity.GetSkillComp
// 0x0008 (0x0008 - 0x0000)
struct KSC_Entity_GetSkillComp final
{
public:
	class UKSC_SkillComp*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_Entity_GetSkillComp;

// Function KuroSimpleCombat.KSC_RenderEntityInterface.KSC_AddEntity
// 0x0050 (0x0050 - 0x0000)
struct KSC_RenderEntityInterface_KSC_AddEntity final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InTransform;                                       // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          InIsPreview;                                       // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_RenderEntityInterface_KSC_AddEntity;

// Function KuroSimpleCombat.KSC_RenderEntityInterface.KSC_DelayRemoveEntity
// 0x0008 (0x0008 - 0x0000)
struct KSC_RenderEntityInterface_KSC_DelayRemoveEntity final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayTime;                                         // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityInterface_KSC_DelayRemoveEntity;

// Function KuroSimpleCombat.KSC_RenderEntityInterface.KSC_InitData
// 0x0008 (0x0008 - 0x0000)
struct KSC_RenderEntityInterface_KSC_InitData final
{
public:
	class UKSC_DA_EntityRender*                   DaEntityRender;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityInterface_KSC_InitData;

// Function KuroSimpleCombat.KSC_RenderEntityInterface.KSC_RemoveEntity
// 0x0004 (0x0004 - 0x0000)
struct KSC_RenderEntityInterface_KSC_RemoveEntity final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityInterface_KSC_RemoveEntity;

// Function KuroSimpleCombat.KSC_RenderEntityInterface.KSC_SetActorTransform_AnyThread
// 0x0040 (0x0040 - 0x0000)
struct KSC_RenderEntityInterface_KSC_SetActorTransform_AnyThread final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InTransform;                                       // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityInterface_KSC_SetActorTransform_AnyThread;

// Function KuroSimpleCombat.KSC_RenderEntityInterface.KSC_UpdateEntity
// 0x0004 (0x0004 - 0x0000)
struct KSC_RenderEntityInterface_KSC_UpdateEntity final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityInterface_KSC_UpdateEntity;

// Function KuroSimpleCombat.KSC_RenderEntityHeadUIInterface.KSC_AddEntity
// 0x0010 (0x0010 - 0x0000)
struct KSC_RenderEntityHeadUIInterface_KSC_AddEntity final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InLocation;                                        // 0x0004(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityHeadUIInterface_KSC_AddEntity;

// Function KuroSimpleCombat.KSC_RenderEntityHeadUIInterface.KSC_RemoveEntity
// 0x0004 (0x0004 - 0x0000)
struct KSC_RenderEntityHeadUIInterface_KSC_RemoveEntity final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityHeadUIInterface_KSC_RemoveEntity;

// Function KuroSimpleCombat.KSC_RenderEntityHeadUIInterface.KSC_SetActorLocation
// 0x0010 (0x0010 - 0x0000)
struct KSC_RenderEntityHeadUIInterface_KSC_SetActorLocation final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InLocation;                                        // 0x0004(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityHeadUIInterface_KSC_SetActorLocation;

// Function KuroSimpleCombat.KSC_RenderEntityHeadUIInterface.KSC_SetHP
// 0x0008 (0x0008 - 0x0000)
struct KSC_RenderEntityHeadUIInterface_KSC_SetHP final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Percent;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityHeadUIInterface_KSC_SetHP;

// Function KuroSimpleCombat.KSC_Entity_AssistMachine.D_Fire
// 0x0050 (0x0050 - 0x0000)
struct KSC_Entity_AssistMachine_D_Fire final
{
public:
	struct FTransformDouble                       D_FireTrans;                                       // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         SkillIndex;                                        // 0x0040(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_Entity_AssistMachine_D_Fire;

// Function KuroSimpleCombat.KSC_Entity_AssistMachine.SetSkillAutoCast
// 0x0008 (0x0008 - 0x0000)
struct KSC_Entity_AssistMachine_SetSkillAutoCast final
{
public:
	int32                                         SkillIndex;                                        // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_SkillAutoCast                            AutoCast;                                          // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_Entity_AssistMachine_SetSkillAutoCast;

// Function KuroSimpleCombat.KSC_RenderEntityAnimInterface.KSC_PauseAnim
// 0x0004 (0x0004 - 0x0000)
struct KSC_RenderEntityAnimInterface_KSC_PauseAnim final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityAnimInterface_KSC_PauseAnim;

// Function KuroSimpleCombat.KSC_RenderEntityAnimInterface.KSC_ResumeAnim
// 0x0004 (0x0004 - 0x0000)
struct KSC_RenderEntityAnimInterface_KSC_ResumeAnim final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityAnimInterface_KSC_ResumeAnim;

// Function KuroSimpleCombat.KSC_RenderEntityAnimInterface.KSC_UpdateAnimState
// 0x0008 (0x0008 - 0x0000)
struct KSC_RenderEntityAnimInterface_KSC_UpdateAnimState final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_GPUNPCAnimState                          EnemyState;                                        // 0x0004(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KSC_RenderEntityAnimInterface_KSC_UpdateAnimState;

// Function KuroSimpleCombat.KSC_RenderEntityMaterialInterface.KSC_AddMaterial
// 0x0018 (0x0018 - 0x0000)
struct KSC_RenderEntityMaterialInterface_KSC_AddMaterial final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroMaterialControllerDataAsset*       DataAsset;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityMaterialInterface_KSC_AddMaterial;

// Function KuroSimpleCombat.KSC_RenderEntityMaterialInterface.KSC_ApplyBeHitMaterial
// 0x0004 (0x0004 - 0x0000)
struct KSC_RenderEntityMaterialInterface_KSC_ApplyBeHitMaterial final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityMaterialInterface_KSC_ApplyBeHitMaterial;

// Function KuroSimpleCombat.KSC_RenderEntityMaterialInterface.KSC_DelayAddMaterial
// 0x0010 (0x0010 - 0x0000)
struct KSC_RenderEntityMaterialInterface_KSC_DelayAddMaterial final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroMaterialControllerDataAsset*       DataAsset;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KSC_RenderEntityMaterialInterface_KSC_DelayAddMaterial;

// Function KuroSimpleCombat.KSC_RenderEntityMaterialInterface.KSC_RemoveMaterial
// 0x0008 (0x0008 - 0x0000)
struct KSC_RenderEntityMaterialInterface_KSC_RemoveMaterial final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
