#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroSplines

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class KuroSplines.KuroMoveSplineComponent
// 0x0050 (0x0670 - 0x0620)
class UKuroMoveSplineComponent final : public USplineComponent
{
public:
	TArray<int32>                                 MoveStates;                                        // 0x0620(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 MoveSpeeds;                                        // 0x0630(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 IgnorePoints;                                      // 0x0640(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 StayTimes;                                         // 0x0650(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 IsHides;                                           // 0x0660(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	int32 GetIgnorePoint(int32 Index_0);
	int32 GetIsHide(int32 Index_0);
	int32 GetMoveSpeed(int32 Index_0);
	int32 GetMoveState(int32 Index_0);
	int32 GetStayTime(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroMoveSplineComponent">();
	}
	static class UKuroMoveSplineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroMoveSplineComponent>();
	}
};
static_assert(alignof(UKuroMoveSplineComponent) == 0x000010, "Wrong alignment on UKuroMoveSplineComponent");
static_assert(sizeof(UKuroMoveSplineComponent) == 0x000670, "Wrong size on UKuroMoveSplineComponent");
static_assert(offsetof(UKuroMoveSplineComponent, MoveStates) == 0x000620, "Member 'UKuroMoveSplineComponent::MoveStates' has a wrong offset!");
static_assert(offsetof(UKuroMoveSplineComponent, MoveSpeeds) == 0x000630, "Member 'UKuroMoveSplineComponent::MoveSpeeds' has a wrong offset!");
static_assert(offsetof(UKuroMoveSplineComponent, IgnorePoints) == 0x000640, "Member 'UKuroMoveSplineComponent::IgnorePoints' has a wrong offset!");
static_assert(offsetof(UKuroMoveSplineComponent, StayTimes) == 0x000650, "Member 'UKuroMoveSplineComponent::StayTimes' has a wrong offset!");
static_assert(offsetof(UKuroMoveSplineComponent, IsHides) == 0x000660, "Member 'UKuroMoveSplineComponent::IsHides' has a wrong offset!");

// Class KuroSplines.KuroParkourSplineComponent
// 0x0030 (0x0650 - 0x0620)
class UKuroParkourSplineComponent final : public USplineComponent
{
public:
	TArray<float>                                 RadiusGroup;                                       // 0x0620(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ModifiedTimes;                                     // 0x0630(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 BuffIds;                                           // 0x0640(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	int32 GetBuffId(int32 Index_0);
	float GetModifiedTime(int32 Index_0);
	float GetRadius(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroParkourSplineComponent">();
	}
	static class UKuroParkourSplineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroParkourSplineComponent>();
	}
};
static_assert(alignof(UKuroParkourSplineComponent) == 0x000010, "Wrong alignment on UKuroParkourSplineComponent");
static_assert(sizeof(UKuroParkourSplineComponent) == 0x000650, "Wrong size on UKuroParkourSplineComponent");
static_assert(offsetof(UKuroParkourSplineComponent, RadiusGroup) == 0x000620, "Member 'UKuroParkourSplineComponent::RadiusGroup' has a wrong offset!");
static_assert(offsetof(UKuroParkourSplineComponent, ModifiedTimes) == 0x000630, "Member 'UKuroParkourSplineComponent::ModifiedTimes' has a wrong offset!");
static_assert(offsetof(UKuroParkourSplineComponent, BuffIds) == 0x000640, "Member 'UKuroParkourSplineComponent::BuffIds' has a wrong offset!");

}

