#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroBuildingGridSystem

#include "Basic.hpp"

#include "KuroBuildingGridSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class KuroBuildingGridSystem.KuroBuildingGrid
// 0x0150 (0x0400 - 0x02B0)
class alignas(0x10) AKuroBuildingGrid final : public AActor
{
public:
	class UPrimitiveComponent*                    RenderingComp;                                     // 0x02B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FKuroBuildingGridCellVector            GridSize;                                          // 0x02B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FKuroBuildingGridCellVector>    BlockCoords;                                       // 0x02C0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                  BuildingGridSpawnGuid;                             // 0x02D0(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E0[0x120];                                    // 0x02E0(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool OccupyTarget(const struct FKuroBuildingGridCellVector& InCoords, class UObject* InTarget, const float& DegreeAlongNormal);
	bool UnoccupyTarget(class UObject* InTarget);

	class FString GetBuildingGridGuidString() const;
	bool GetCellIndex(const struct FKuroBuildingGridCellVector& InCoords, int32* OutIndex) const;
	struct FVectorDouble GetPosition(const struct FKuroBuildingGridCellVector& InSize, const struct FKuroBuildingGridCellVector& InCoords) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBuildingGrid")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBuildingGrid")
	}
	static class AKuroBuildingGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroBuildingGrid>();
	}
};
DUMPER7_ASSERTS_AKuroBuildingGrid;

// Class KuroBuildingGridSystem.KuroBuildingGridPersistentPlaceholder
// 0x0008 (0x0038 - 0x0030)
class UKuroBuildingGridPersistentPlaceholder final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBuildingGridPersistentPlaceholder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBuildingGridPersistentPlaceholder")
	}
	static class UKuroBuildingGridPersistentPlaceholder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroBuildingGridPersistentPlaceholder>();
	}
};
DUMPER7_ASSERTS_UKuroBuildingGridPersistentPlaceholder;

// Class KuroBuildingGridSystem.KuroBuildingGridPlaceholderComponent
// 0x0010 (0x00D0 - 0x00C0)
class UKuroBuildingGridPlaceholderComponent final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroBuildingGridCellVector            GridSize;                                          // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBuildingGridPlaceholderComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBuildingGridPlaceholderComponent")
	}
	static class UKuroBuildingGridPlaceholderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroBuildingGridPlaceholderComponent>();
	}
};
DUMPER7_ASSERTS_UKuroBuildingGridPlaceholderComponent;

// Class KuroBuildingGridSystem.KuroBuildingGridPlaceholderInterface
// 0x0000 (0x0000 - 0x0000)
class IKuroBuildingGridPlaceholderInterface final
{
public:
	void Occupied(class AKuroBuildingGrid* InGrid, const struct FKuroBuildingGridCellVector& InCoords, const float& InDegree);
	void Unoccupied();

	bool CanBeRemoved() const;
	struct FKuroBuildingGridCellVector GetSize() const;
	struct FKuroBuildingGridCellVector GetSizeByDegree(float* Degree) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBuildingGridPlaceholderInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBuildingGridPlaceholderInterface")
	}
	static class IKuroBuildingGridPlaceholderInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IKuroBuildingGridPlaceholderInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IKuroBuildingGridPlaceholderInterface;

// Class KuroBuildingGridSystem.KuroBuildingGridRenderingComponent
// 0x0010 (0x0590 - 0x0580)
class UKuroBuildingGridRenderingComponent final : public UDebugDrawComponent
{
public:
	uint8                                         Pad_580[0x10];                                     // 0x0580(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBuildingGridRenderingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBuildingGridRenderingComponent")
	}
	static class UKuroBuildingGridRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroBuildingGridRenderingComponent>();
	}
};
DUMPER7_ASSERTS_UKuroBuildingGridRenderingComponent;

// Class KuroBuildingGridSystem.KuroBuildingGridSettings
// 0x0008 (0x0050 - 0x0048)
class UKuroBuildingGridSettings final : public UDeveloperSettings
{
public:
	float                                         CellSize;                                          // 0x0048(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Threshold;                                         // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBuildingGridSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBuildingGridSettings")
	}
	static class UKuroBuildingGridSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroBuildingGridSettings>();
	}
};
DUMPER7_ASSERTS_UKuroBuildingGridSettings;

// Class KuroBuildingGridSystem.KuroBuildingGridSubsystem
// 0x0058 (0x0090 - 0x0038)
class UKuroBuildingGridSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroBuildingGridPersistentPlaceholder* PersistentPlaceholder;                             // 0x0088(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static float GetGridCellSize();
	static class AKuroBuildingGrid* K2_FindBuildingGrid(class UObject* WorldContextObject, const class FString& InGuidString);
	static void K2_ForEachIntersectingCell(class UObject* WorldContextObject, const struct FVectorDouble& InPoint, const double& InRadius, const bool UseDirMask, const int32 DirMask, TDelegate<void(const class FString& GridGuid, const struct FKuroBuildingGridCellVector& Coords, const int32 CellIndex)> Func_0);
	static bool K2_ProjectPointToGrid(class UObject* WorldContextObject, const struct FVectorDouble& InPoint, const struct FVector& InNormal, struct FKuroBuildingGridRaycastResult& OutResult);
	static bool K2_RaycastGrid(class UObject* WorldContextObject, const struct FVectorDouble& Start, const struct FVectorDouble& End, struct FKuroBuildingGridRaycastResult& OutResult);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBuildingGridSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBuildingGridSubsystem")
	}
	static class UKuroBuildingGridSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroBuildingGridSubsystem>();
	}
};
DUMPER7_ASSERTS_UKuroBuildingGridSubsystem;

}

