#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroSceneModifier

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct KuroSceneModifier.KuroSceneMatModifyData
// 0x0018 (0x0018 - 0x0000)
struct FKuroSceneMatModifyData final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceConstant*>      MatModifyArray;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroSceneMatModifyData;

// ScriptStruct KuroSceneModifier.KuroSceneModifierDataState
// 0x0010 (0x0010 - 0x0000)
struct FKuroSceneModifierDataState final
{
public:
	class UKuroSceneMatModifyDataAsset*           MatDataAsset;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKuroSceneModifierDataState;

// ScriptStruct KuroSceneModifier.KuroSceneModifierComponentBackupEntry
// 0x0020 (0x0020 - 0x0000)
struct FKuroSceneModifierComponentBackupEntry final
{
public:
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKuroSceneModifierComponentBackupEntry;

// ScriptStruct KuroSceneModifier.KuroSceneModifierEntry
// 0x0068 (0x0068 - 0x0000)
struct FKuroSceneModifierEntry final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TWeakObjectPtr<class UStaticMeshComponent>, struct FKuroSceneModifierComponentBackupEntry> BackupComponents; // 0x0018(0x0050)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FKuroSceneModifierEntry;

}

