#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroAI

#include "Basic.hpp"


namespace SDK::Params
{

// Function KuroAI.KuroAILibrary.GetCurrentRootNode
// 0x0010 (0x0010 - 0x0000)
struct KuroAILibrary_GetCurrentRootNode final
{
public:
	class UBehaviorTreeComponent*                 BTComp;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTNode*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroAILibrary_GetCurrentRootNode;

// Function KuroAI.KuroAILibrary.ResetRandomNode
// 0x0020 (0x0020 - 0x0000)
struct KuroAILibrary_ResetRandomNode final
{
public:
	class UBehaviorTreeComponent*                 BTComp;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTNode*                                Node;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 WeightsOverride;                                   // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroAILibrary_ResetRandomNode;

}

