#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroGamePartition

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum KuroGamePartition.EGamePartitionCellSizeType
// NumValues: 0x0004
enum class EGamePartitionCellSizeType : uint8
{
	Default                                  = 0,
	Medium                                   = 1,
	MaxType                                  = 2,
	EGamePartitionCellSizeType_MAX           = 3,
};

// Enum KuroGamePartition.ESubGamePartitionObjectType
// NumValues: 0x0002
enum class ESubGamePartitionObjectType : uint8
{
	KuroRoadway                              = 0,
	ESubGamePartitionObjectType_MAX          = 1,
};

// Enum KuroGamePartition.EMainGamePartitionObjectType
// NumValues: 0x0004
enum class EMainGamePartitionObjectType : uint16
{
	KuroNormal                               = 1,
	KuroDestructible                         = 64,
	PhysicsInteractionActor                  = 4096,
	EMainGamePartitionObjectType_MAX         = 4097,
};

// ScriptStruct KuroGamePartition.GamePartitionObject
// 0x0058 (0x0058 - 0x0000)
struct FGamePartitionObject final
{
public:
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          Location;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   Bounds;                                            // 0x0030(0x001C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ObjectID;                                          // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubType;                                           // 0x0054(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGamePartitionObject;

}

