#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroGAS

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "Engine_classes.hpp"
#include "GameplayTasks_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "KuroGAS_structs.hpp"


namespace SDK
{

// Class KuroGAS.AbilityTask_SpecifiedAnimInstancePlayMontageAndWait
// 0x00A8 (0x0130 - 0x0088)
class UAbilityTask_SpecifiedAnimInstancePlayMontageAndWait final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void()>              OnCompleted;                                       // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnBlendOut;                                        // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnInterrupted;                                     // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCancelled;                                       // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnTick;                                            // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x28];                                      // 0x00D8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           MontageToPlay;                                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   SkeletalMeshComponentTag;                          // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Rate;                                              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   StartSection;                                      // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AnimRootMotionTranslationScale;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         StartTimeSeconds;                                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bStopWhenAbilityEnds;                              // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_SpecifiedAnimInstancePlayMontageAndWait* CreatePlayMontageAndWaitProxy(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class UAnimMontage* MontageToPlay_0, class FName SkeletalMeshComponentTag_0, float Rate_0, class FName StartSection_0, bool bStopWhenAbilityEnds_0, float AnimRootMotionTranslationScale_0, float StartTimeSeconds_0, bool NeedTick);

	void OnMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);
	void OnMontageEnded(class UAnimMontage* Montage, bool bInterrupted);
	void OnMontageInterrupted();
	void TickTask(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_SpecifiedAnimInstancePlayMontageAndWait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_SpecifiedAnimInstancePlayMontageAndWait")
	}
	static class UAbilityTask_SpecifiedAnimInstancePlayMontageAndWait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_SpecifiedAnimInstancePlayMontageAndWait>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_SpecifiedAnimInstancePlayMontageAndWait;

// Class KuroGAS.AsyncTaskAnyAttributeChanged
// 0x0018 (0x0050 - 0x0038)
class UAsyncTaskAnyAttributeChanged final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(int32 AttributeID, float NewValue, float OldValue)> OnAttributeChanged; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                ASC;                                               // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UAsyncTaskAnyAttributeChanged* ListenForAnyAttributeChange(class UAbilitySystemComponent* AbilitySystemComponent);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskAnyAttributeChanged")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskAnyAttributeChanged")
	}
	static class UAsyncTaskAnyAttributeChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskAnyAttributeChanged>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskAnyAttributeChanged;

// Class KuroGAS.AsyncTaskAnyEffectInhibitionChanged
// 0x0018 (0x0050 - 0x0038)
class UAsyncTaskAnyEffectInhibitionChanged final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FActiveGameplayEffectHandle& Handle, bool bInhibited)> OnEffectInhibitionChanged; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	class UAbilitySystemComponent*                AbilityComp;                                       // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UAsyncTaskAnyEffectInhibitionChanged* ListenForAnyEffectInhibitionChanged(class UAbilitySystemComponent* AbilityComp_0);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskAnyEffectInhibitionChanged")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskAnyEffectInhibitionChanged")
	}
	static class UAsyncTaskAnyEffectInhibitionChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskAnyEffectInhibitionChanged>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskAnyEffectInhibitionChanged;

// Class KuroGAS.AsyncTaskAnyEffectRemoved
// 0x0030 (0x0068 - 0x0038)
class UAsyncTaskAnyEffectRemoved final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FActiveGameplayEffectHandle& Handle, const struct FGameplayEffectSpec& Spec, const struct FGameplayEffectRemovalInfo& RemovalInfo)> OnEffectRemoved; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	class UAbilitySystemComponent*                ASC;                                               // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncTaskAnyEffectRemoved* ListenForAnyEffectRemoved(class UAbilitySystemComponent* AbilitySystemComponent);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskAnyEffectRemoved")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskAnyEffectRemoved")
	}
	static class UAsyncTaskAnyEffectRemoved* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskAnyEffectRemoved>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskAnyEffectRemoved;

// Class KuroGAS.AsyncTaskAnyEffectStackChanged
// 0x0030 (0x0068 - 0x0038)
class UAsyncTaskAnyEffectStackChanged final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FActiveGameplayEffectHandle& Handle, const int32 NewStack, const int32 OldStack, bool bPremature)> OnStackChanged; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	class UAbilitySystemComponent*                AbilityComp;                                       // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncTaskAnyEffectStackChanged* ListenForAnyEffectStackChanged(class UAbilitySystemComponent* AbilityComp_0);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskAnyEffectStackChanged")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskAnyEffectStackChanged")
	}
	static class UAsyncTaskAnyEffectStackChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskAnyEffectStackChanged>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskAnyEffectStackChanged;

// Class KuroGAS.AsyncTaskEffectApplied
// 0x0030 (0x0068 - 0x0038)
class UAsyncTaskEffectApplied final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FActiveGameplayEffectHandle& ActiveHandle)> OnEffectApplied; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	class UAbilitySystemComponent*                ASC;                                               // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncTaskEffectApplied* ListenForEffectApplied(class UAbilitySystemComponent* AbilitySystemComponent, const struct FGameplayTag& EffectGameplayTag, const struct FGameplayTag& IgnoreGameplayTag);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskEffectApplied")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskEffectApplied")
	}
	static class UAsyncTaskEffectApplied* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskEffectApplied>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskEffectApplied;

// Class KuroGAS.AsyncTaskEffectDebugString
// 0x0018 (0x0050 - 0x0038)
class UAsyncTaskEffectDebugString final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const class FString& DebugInfo)> OnAnyGameplayEffectExecuted;      // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	class UAbilitySystemComponent*                ASC;                                               // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UAsyncTaskEffectDebugString* ListenForGameplayEffectExecutedDebugString(class UAbilitySystemComponent* AbilitySystemComponent);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskEffectDebugString")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskEffectDebugString")
	}
	static class UAsyncTaskEffectDebugString* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskEffectDebugString>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskEffectDebugString;

// Class KuroGAS.AsyncTaskEffectInhibitionChanged
// 0x0020 (0x0058 - 0x0038)
class UAsyncTaskEffectInhibitionChanged final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool IsInhibited)> OnInhibitionChanged;                            // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncTaskEffectInhibitionChanged* ListenForInhibitionChanged(const struct FActiveGameplayEffectHandle& Handle);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskEffectInhibitionChanged")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskEffectInhibitionChanged")
	}
	static class UAsyncTaskEffectInhibitionChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskEffectInhibitionChanged>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskEffectInhibitionChanged;

// Class KuroGAS.AsyncTaskEffectStackChanged
// 0x0020 (0x0058 - 0x0038)
class UAsyncTaskEffectStackChanged final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(int32 NewStackCount, int32 PreviousStackCount, bool bPremature)> OnStackChanged; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncTaskEffectStackChanged* ListenForStackChanged(const struct FActiveGameplayEffectHandle& Handle);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskEffectStackChanged")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskEffectStackChanged")
	}
	static class UAsyncTaskEffectStackChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskEffectStackChanged>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskEffectStackChanged;

// Class KuroGAS.AsyncTaskGameplayCueNotify
// 0x0018 (0x0050 - 0x0038)
class UAsyncTaskGameplayCueNotify final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FActiveGameplayEffectHandle& ActiveHandle, const struct FGameplayEffectContextHandle& ContextHandle, int64 GameplayCueId, bool bIsAdd)> GameplayCueEvent; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	class UAbilitySystemComponent*                ASC;                                               // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UAsyncTaskGameplayCueNotify* ListenForGameplayCueNotify(class UAbilitySystemComponent* AbilitySystemComponent);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskGameplayCueNotify")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskGameplayCueNotify")
	}
	static class UAsyncTaskGameplayCueNotify* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskGameplayCueNotify>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskGameplayCueNotify;

// Class KuroGAS.AsyncTaskPlayMontageAndWait
// 0x0078 (0x00B0 - 0x0038)
class UAsyncTaskPlayMontageAndWait final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool bInterrupted)> EndCallback;                                   // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(bool bInterrupted)> BlendOutCallback;                              // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(float RemainTime)> RemainCallback;                                 // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	bool                                          bShouldEmitOnEndedEvent;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MontageLength;                                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimInstance*                          AnimInstance;                                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           MontageToPlay;                                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0x30];                                      // 0x0080(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncTaskPlayMontageAndWait* ListenForPlayMontage(class UAnimInstance* AnimInstance_0, class UAnimMontage* MontageToPlay_0, float PlayRate, float StartingPosition, class FName StartingSection);
	static class UAsyncTaskPlayMontageAndWait* ListenRemainForPlayMontage(class UAnimInstance* AnimInstance_0, class UAnimMontage* MontageToPlay_0, float PlayRate, float StartingPosition, class FName StartingSection, float RemainedTrigger);

	void EndTask();
	void StopMontage();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskPlayMontageAndWait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskPlayMontageAndWait")
	}
	static class UAsyncTaskPlayMontageAndWait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskPlayMontageAndWait>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskPlayMontageAndWait;

// Class KuroGAS.AsyncTaskRotateSequence
// 0x0140 (0x01B0 - 0x0070)
class alignas(0x10) UAsyncTaskRotateSequence final : public UGameplayTask
{
public:
	TMulticastInlineDelegate<void(class USceneComponent* AimPivot, const struct FVector& TargetLocation)> OnShootStepFired; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USceneComponent* AimPivot)> OnSequenceFinished;              // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         AimToleranceDeg;                                   // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimSpeedDegPerSec;                                 // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PostFireDelay;                                     // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeDilation;                                      // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEaseOut : 1;                                      // 0x00A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEaseIn : 1;                                       // 0x00A0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bForceShortestRoute : 1;                           // 0x00A0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RotateOffset;                                      // 0x00A4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x100];                                     // 0x00B0(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncTaskRotateSequence* D_StartRotateSequenceByTranslation(const TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner, class USceneComponent* InAimPivot, const TArray<struct FVectorDouble>& InTargets, const float AimSpeedDegPerSec_0, const float AimToleranceDeg_0, const bool bEaseIn_0, const bool bEaseOut_0, const bool bForceShortestRoute_0, const float PostFireDelay_0, const struct FRotator& RotateOffset_0, const float TimeDilation_0);
	static void RotateComponentTo(class USceneComponent* Component, const struct FRotator& TargetWorldRotation, const bool bEaseOut_0, const bool bEaseIn_0, const float OverTime, const bool bForceShortestRotationPath, const float TimeDilation_0, const ERotateComponentAction MoveAction, const struct FLatentActionInfo& LatentInfo);
	static class UAsyncTaskRotateSequence* StartRotateSequenceByActor(const TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner, class USceneComponent* InAimPivot, const TArray<class AActor*>& InTargets, const float AimSpeedDegPerSec_0, const float AimToleranceDeg_0, const bool bEaseIn_0, const bool bEaseOut_0, const bool bForceShortestRoute_0, const float PostFireDelay_0, const struct FRotator& RotateOffset_0, const float TimeDilation_0);
	static class UAsyncTaskRotateSequence* StartRotateSequenceByTranslation(const TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner, class USceneComponent* InAimPivot, const TArray<struct FVector>& InTargets, const float AimSpeedDegPerSec_0, const float AimToleranceDeg_0, const bool bEaseIn_0, const bool bEaseOut_0, const bool bForceShortestRoute_0, const float PostFireDelay_0, const struct FRotator& RotateOffset_0, const float TimeDilation_0);

	void OnAimLatentFinished();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskRotateSequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskRotateSequence")
	}
	static class UAsyncTaskRotateSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskRotateSequence>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskRotateSequence;

// Class KuroGAS.AsyncTaskTagCountChanged
// 0x0028 (0x0060 - 0x0038)
class UAsyncTaskTagCountChanged final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(int32 NewCount)> OnTagCountChanged;                                // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                ASC;                                               // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncTaskTagCountChanged* ListenForTagCountChanged(class UAbilitySystemComponent* AbilitySystemComponent, const struct FGameplayTag& Tag);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskTagCountChanged")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskTagCountChanged")
	}
	static class UAsyncTaskTagCountChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskTagCountChanged>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskTagCountChanged;

// Class KuroGAS.AsyncTaskTagSignificantChanged
// 0x0028 (0x0060 - 0x0038)
class UAsyncTaskTagSignificantChanged final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool bTagExists)> OnTagSignificantChanged;                         // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                ASC;                                               // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncTaskTagSignificantChanged* ListenForTagSignificantChanged(class UAbilitySystemComponent* AbilitySystemComponent, const struct FGameplayTag& Tag);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskTagSignificantChanged")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskTagSignificantChanged")
	}
	static class UAsyncTaskTagSignificantChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskTagSignificantChanged>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskTagSignificantChanged;

// Class KuroGAS.AsyncTaskWaitGameplayEvent
// 0x0018 (0x0050 - 0x0038)
class UAsyncTaskWaitGameplayEvent final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& Payload)> EventReceived; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPrivate)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UAsyncTaskWaitGameplayEvent* ListenForGameplayEvent(class UAbilitySystemComponent* AbilitySystemComponent_0);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskWaitGameplayEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskWaitGameplayEvent")
	}
	static class UAsyncTaskWaitGameplayEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskWaitGameplayEvent>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskWaitGameplayEvent;

// Class KuroGAS.BaseAbilitySystemComponent
// 0x0000 (0x1388 - 0x1388)
class UBaseAbilitySystemComponent final : public UAbilitySystemComponent
{
public:
	struct FActiveGameplayEffectHandle ApplyGeToSelfById(int64 GameplayEffectId, const struct FGameplayEffectContextHandle& Context, float Level, int32 ServerId);
	void BP_InitAbilityActorInfo(class FName AnimInstanceTag);
	void DestroyDynamicGameplayEffect(class UGameplayEffect* Ge);
	struct FGameplayAbilitySpecHandle GetAbility(const TSubclassOf<class UGameplayAbility>& Ability);
	int32 GetAbilityScopeLockCount();
	TArray<struct FActiveGameplayEffectHandle> GetActiveEffectsByGrantedTags(const struct FGameplayTag& Tag);
	TArray<struct FActiveGameplayEffectHandle> GetActiveEffectsById(const int64 GeId);
	int32 GetGameplayEffectCountById(int64 GameplayEffectId, class UAbilitySystemComponent* OptionalInstigatorFilterComponent, bool bEnforceOnGoingCheck);
	void InternalApplyModToAttribute(const int32 AttributeId, EGameplayModOp ModifierOp, float ModifierMagnitude);
	class UGameplayEffect* MakeDynamicGameplayEffect(const class FName GeName, const int64 GeId);
	bool OnAnyTagChangeInternal(const struct FGameplayTag& GameplayTag, int32 NewTagCount);
	void PauseActiveGameplayEffect(const struct FActiveGameplayEffectHandle& Handle, bool bPause);
	void PauseAllActiveGameplayEffects(bool bPause);
	void RemoveAbility(const struct FGameplayAbilitySpecHandle& Handle);
	int32 RemoveActiveEffectsById(const int64 GeId, int32 StackCount);
	void RemoveActiveEffectsByUniqueServerId(const int32 GameplayEffectSpecServerId);
	void ResetDilationForActiveEffects(const float TimeDilation);
	bool UpdateActiveGameplayEffectDurationHandle(const struct FActiveGameplayEffectHandle& Handle, const float DurationModifyValue);

	void AddGeGrantGa(class UGameplayEffect* Ge, const TSubclassOf<class UGameplayAbility>& Ability, int32 level, EGameplayEffectGrantedAbilityRemovePolicy RemovalPolicy) const;
	void AddGeModifierByAttributeId(class UGameplayEffect* Ge, const int32 ModifiedAttributeId, EAttributeBasedFloatCalculationType CalculationType, const EGameplayModOp ModOp, const int32 AttributeId, const struct FGameplayTag& DataTag, const struct FGameplayTag& DataTag2, EGameplayEffectAttributeCaptureSource InSource, bool InSnapShot) const;
	void AddGeModifierByKey(class UGameplayEffect* Ge, int32 ModifiedAttributeId, const EGameplayModOp ModOp, const int32 ModifierKey) const;
	void AddGeModifierByMMC(class UGameplayEffect* Ge, int32 ModifiedAttributeId, const EGameplayModOp ModOp, const TSubclassOf<class UGameplayModMagnitudeCalculation>& CalculationClassMagnitude) const;
	void AddGeModifierByTag(class UGameplayEffect* Ge, int32 ModifiedAttributeId, const EGameplayModOp ModOp, const struct FGameplayTag& ModifierTag) const;
	bool HasAllGameplayTag(const struct FGameplayTagContainer& GameplayTagContainer) const;
	bool HasAnyGameplayTag(const struct FGameplayTagContainer& GameplayTagContainer) const;
	bool HasGameplayTag(const struct FGameplayTag& GameplayTag) const;
	struct FGameplayEffectSpecHandle MakeDynamicOutgoingSpec(class UGameplayEffect* GameplayEffect, float Level, const struct FGameplayEffectContextHandle& Context, int32 GameplayEffectServerId) const;
	struct FGameplayEffectSpecHandle MakeRemoteDynamicOutgoingSpec(class UGameplayEffect* GameplayEffect, float Level, const struct FGameplayEffectContextHandle& Context, int32 GameplayEffectServerId, int32 InGeHandleId) const;
	void SetDurationMagnitudeByAttributeId(class UGameplayEffect* Ge, EAttributeBasedFloatCalculationType CalculationType, int32 AttributeId, const struct FGameplayTag& DataTag, const struct FGameplayTag& DataTag2, EGameplayEffectAttributeCaptureSource InSource, bool InSnapShot) const;
	void SetDurationMagnitudeByTag(class UGameplayEffect* Ge, const struct FGameplayTag& ModifierTag) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseAbilitySystemComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseAbilitySystemComponent")
	}
	static class UBaseAbilitySystemComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseAbilitySystemComponent>();
	}
};
DUMPER7_ASSERTS_UBaseAbilitySystemComponent;

// Class KuroGAS.BaseAttributeSet
// 0x0D98 (0x0DD0 - 0x0038)
class UBaseAttributeSet final : public UAttributeSet
{
public:
	struct FGameplayAttributeData                 Lv;                                                // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 LifeMax;                                           // 0x0050(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Life;                                              // 0x0068(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Sheild;                                            // 0x0080(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SheildDamageChange;                                // 0x0098(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SheildDamageReduce;                                // 0x00B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Atk;                                               // 0x00C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Crit;                                              // 0x00E0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 CritDamage;                                        // 0x00F8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Def;                                               // 0x0110(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 EnergyEfficiency;                                  // 0x0128(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 CDReduse;                                          // 0x0140(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionEfficiency;                                // 0x0158(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChangeNormalSkill;                           // 0x0170(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChange;                                      // 0x0188(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageReduce;                                      // 0x01A0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChangeAuto;                                  // 0x01B8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChangeCast;                                  // 0x01D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChangeUltra;                                 // 0x01E8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChangeQTE;                                   // 0x0200(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChangePhys;                                  // 0x0218(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChangeElement1;                              // 0x0230(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChangeElement2;                              // 0x0248(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChangeElement3;                              // 0x0260(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChangeElement4;                              // 0x0278(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChangeElement5;                              // 0x0290(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChangeElement6;                              // 0x02A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageResistancePhys;                              // 0x02C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageResistanceElement1;                          // 0x02D8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageResistanceElement2;                          // 0x02F0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageResistanceElement3;                          // 0x0308(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageResistanceElement4;                          // 0x0320(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageResistanceElement5;                          // 0x0338(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageResistanceElement6;                          // 0x0350(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 HealChange;                                        // 0x0368(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 HealedChange;                                      // 0x0380(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageReducePhys;                                  // 0x0398(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageReduceElement1;                              // 0x03B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageReduceElement2;                              // 0x03C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageReduceElement3;                              // 0x03E0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageReduceElement4;                              // 0x03F8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageReduceElement5;                              // 0x0410(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageReduceElement6;                              // 0x0428(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange1;                                   // 0x0440(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange2;                                   // 0x0458(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange3;                                   // 0x0470(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange4;                                   // 0x0488(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange5;                                   // 0x04A0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange6;                                   // 0x04B8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange7;                                   // 0x04D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange8;                                   // 0x04E8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange9;                                   // 0x0500(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange10;                                  // 0x0518(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange11;                                  // 0x0530(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange12;                                  // 0x0548(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange13;                                  // 0x0560(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange14;                                  // 0x0578(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ReactionChange15;                                  // 0x0590(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 EnergyMax;                                         // 0x05A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Energy;                                            // 0x05C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SpecialEnergy1Max;                                 // 0x05D8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SpecialEnergy1;                                    // 0x05F0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SpecialEnergy2Max;                                 // 0x0608(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SpecialEnergy2;                                    // 0x0620(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SpecialEnergy3Max;                                 // 0x0638(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SpecialEnergy3;                                    // 0x0650(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SpecialEnergy4Max;                                 // 0x0668(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SpecialEnergy4;                                    // 0x0680(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StrengthMax;                                       // 0x0698(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Strength;                                          // 0x06B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StrengthRecover;                                   // 0x06C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StrengthPunishTime;                                // 0x06E0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StrengthRun;                                       // 0x06F8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StrengthSwim;                                      // 0x0710(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StrengthFastSwim;                                  // 0x0728(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StrengthClimb;                                     // 0x0740(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StrengthFastClimb;                                 // 0x0758(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 HardnessMax;                                       // 0x0770(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Hardness;                                          // 0x0788(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 HardnessRecover;                                   // 0x07A0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 HardnessPunishTime;                                // 0x07B8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 HardnessChange;                                    // 0x07D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 HardnessReduce;                                    // 0x07E8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ToughMax;                                          // 0x0800(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Tough;                                             // 0x0818(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ToughRecover;                                      // 0x0830(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ToughChange;                                       // 0x0848(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ToughReduce;                                       // 0x0860(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ElementPower1;                                     // 0x0878(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ElementPower2;                                     // 0x0890(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ElementPower3;                                     // 0x08A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ElementPower4;                                     // 0x08C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ElementPower5;                                     // 0x08D8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ElementPower6;                                     // 0x08F0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SpecialDamageChange;                               // 0x0908(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StrengthFastClimbCost;                             // 0x0920(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ElementPropertyType;                               // 0x0938(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 WeakTime;                                          // 0x0950(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 IgnoreDefRate;                                     // 0x0968(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 IgnoreDamageResistancePhys;                        // 0x0980(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 IgnoreDamageResistanceElement1;                    // 0x0998(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 IgnoreDamageResistanceElement2;                    // 0x09B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 IgnoreDamageResistanceElement3;                    // 0x09C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 IgnoreDamageResistanceElement4;                    // 0x09E0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 IgnoreDamageResistanceElement5;                    // 0x09F8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 IgnoreDamageResistanceElement6;                    // 0x0A10(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SkillToughRatio;                                   // 0x0A28(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StrengthClimbJump;                                 // 0x0A40(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StrengthGliding;                                   // 0x0A58(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Mass;                                              // 0x0A70(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 BrakingFrictionFactor;                             // 0x0A88(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 GravityScale;                                      // 0x0AA0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SpeedRatio;                                        // 0x0AB8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DamageChangePhantom;                               // 0x0AD0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 AutoAttackSpeed;                                   // 0x0AE8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 CastAttackSpeed;                                   // 0x0B00(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StatusBuildUp1Max;                                 // 0x0B18(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StatusBuildUp1;                                    // 0x0B30(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StatusBuildUp2Max;                                 // 0x0B48(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StatusBuildUp2;                                    // 0x0B60(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StatusBuildUp3Max;                                 // 0x0B78(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StatusBuildUp3;                                    // 0x0B90(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StatusBuildUp4Max;                                 // 0x0BA8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StatusBuildUp4;                                    // 0x0BC0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StatusBuildUp5Max;                                 // 0x0BD8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StatusBuildUp5;                                    // 0x0BF0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 RageMax;                                           // 0x0C08(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Rage;                                              // 0x0C20(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 RageRecover;                                       // 0x0C38(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 RagePunishTime;                                    // 0x0C50(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 RageChange;                                        // 0x0C68(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 RageReduce;                                        // 0x0C80(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ToughRecoverDelayTime;                             // 0x0C98(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Jump;                                              // 0x0CB0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ParalysisTimeMax;                                  // 0x0CC8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ParalysisTime;                                     // 0x0CE0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ParalysisTimeRecover;                              // 0x0CF8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 WeaknessBuildUp;                                   // 0x0D10(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 WeaknessBuildUpMax;                                // 0x0D28(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 WeaknessTotalBonus;                                // 0x0D40(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 WeaknessTotalResist;                               // 0x0D58(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_D70[0x60];                                     // 0x0D70(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void SetAttackSpeedMax(float InMaxSpeed);
	static void SetElementPowerMax(float InElementPowerMax);
