#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroEditorRuntime

#include "Basic.hpp"

#include "KuroEditorRuntime_structs.hpp"


namespace SDK::Params
{

// Function KuroEditorRuntime.CommandService.EnableRecvLog
// 0x0001 (0x0001 - 0x0000)
struct CommandService_EnableRecvLog final
{
public:
	bool                                          isEnable;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommandService_EnableRecvLog;

// Function KuroEditorRuntime.CommandService.Start
// 0x0004 (0x0004 - 0x0000)
struct CommandService_Start final
{
public:
	int32                                         Port;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommandService_Start;

// Function KuroEditorRuntime.EditorRuntimeOperations.IsPortInUse
// 0x0008 (0x0008 - 0x0000)
struct EditorRuntimeOperations_IsPortInUse final
{
public:
	int32                                         Port;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EditorRuntimeOperations_IsPortInUse;

// Function KuroEditorRuntime.EditorRuntimeOperations.IsTcpPortInUse
// 0x0008 (0x0008 - 0x0000)
struct EditorRuntimeOperations_IsTcpPortInUse final
{
public:
	int32                                         Port;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EditorRuntimeOperations_IsTcpPortInUse;

// Function KuroEditorRuntime.EditorRuntimeOperations.IsUdpPortInUse
// 0x0008 (0x0008 - 0x0000)
struct EditorRuntimeOperations_IsUdpPortInUse final
{
public:
	int32                                         Port;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EditorRuntimeOperations_IsUdpPortInUse;

// Function KuroEditorRuntime.EditorRuntimeOperations.ReadBatchFilesAsync
// 0x0038 (0x0038 - 0x0000)
struct EditorRuntimeOperations_ReadBatchFilesAsync final
{
public:
	TArray<class FString>                         FilePaths;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<struct FReadFileData>& LoadedFiles, const TArray<class FString>& ReadFailedFiles)> OnAllFilesRead; // 0x0010(0x0028)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EditorRuntimeOperations_ReadBatchFilesAsync;

// Function KuroEditorRuntime.EditorRuntimeOperations.ReadFileAsync
// 0x0038 (0x0038 - 0x0000)
struct EditorRuntimeOperations_ReadFileAsync final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool IsSuccess, const class FString& FileContent)> OnFileRead;                    // 0x0010(0x0028)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EditorRuntimeOperations_ReadFileAsync;

// Function KuroEditorRuntime.EditorRuntimeOperations.SendHttpRequest
// 0x00A8 (0x00A8 - 0x0000)
struct EditorRuntimeOperations_SendHttpRequest final
{
public:
	class FString                                 Method;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Url;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            HeaderParam;                                       // 0x0020(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0070(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool Success, int32 Code, const class FString& Data)> Handler;                    // 0x0080(0x0028)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EditorRuntimeOperations_SendHttpRequest;

// Function KuroEditorRuntime.EditorRuntimeOperations.SendMessage
// 0x0028 (0x0028 - 0x0000)
struct EditorRuntimeOperations_SendMessage final
{
public:
	class FString                                 Msg;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ip;                                                // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EditorRuntimeOperations_SendMessage;

}

