#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroFastCollision

#include "Basic.hpp"


namespace SDK::Params
{

// Function KuroFastCollision.KuroFastCollisionAlgorithm.Add
// 0x0008 (0x0008 - 0x0000)
struct KuroFastCollisionAlgorithm_Add final
{
public:
	class UObject*                                Agent;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroFastCollisionAlgorithm_Add;

// Function KuroFastCollision.KuroFastCollisionAlgorithm.GetOverlappingAgents
// 0x0018 (0x0018 - 0x0000)
struct KuroFastCollisionAlgorithm_GetOverlappingAgents final
{
public:
	class UObject*                                Agent;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        OverlappingAgents;                                 // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroFastCollisionAlgorithm_GetOverlappingAgents;

// Function KuroFastCollision.KuroFastCollisionAlgorithm.Remove
// 0x0008 (0x0008 - 0x0000)
struct KuroFastCollisionAlgorithm_Remove final
{
public:
	class UObject*                                Agent;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroFastCollisionAlgorithm_Remove;

// Function KuroFastCollision.KuroFastCollisionSubsystem.Get
// 0x0010 (0x0010 - 0x0000)
struct KuroFastCollisionSubsystem_Get final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroFastCollisionSubsystem*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroFastCollisionSubsystem_Get;

// Function KuroFastCollision.KuroFastCollisionSubsystem.CreateAlgorithm
// 0x0018 (0x0018 - 0x0000)
struct KuroFastCollisionSubsystem_CreateAlgorithm final
{
public:
	TSubclassOf<class UKuroFastCollisionAlgorithm> Class_0;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTickEnabled;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroFastCollisionAlgorithm*            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroFastCollisionSubsystem_CreateAlgorithm;

// Function KuroFastCollision.KuroFastCollisionSubsystem.DestroyAlgorithm
// 0x0008 (0x0008 - 0x0000)
struct KuroFastCollisionSubsystem_DestroyAlgorithm final
{
public:
	class UKuroFastCollisionAlgorithm*            Algorithm;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroFastCollisionSubsystem_DestroyAlgorithm;

// Function KuroFastCollision.KuroFastCollisionSubsystem.GetDefaultAlgorithm
// 0x0008 (0x0008 - 0x0000)
struct KuroFastCollisionSubsystem_GetDefaultAlgorithm final
{
public:
	class UKuroFastCollisionAlgorithm*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroFastCollisionSubsystem_GetDefaultAlgorithm;

}

