#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroVehicle

#include "Basic.hpp"

#include "KuroVehicle_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "KuroAnim_structs.hpp"


namespace SDK::Params
{

// Function KuroVehicle.KuroAnimInstanceVehicle.GetDriver
// 0x0008 (0x0008 - 0x0000)
struct KuroAnimInstanceVehicle_GetDriver final
{
public:
	class ABaseCharacter*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroAnimInstanceVehicle_GetDriver;

// Function KuroVehicle.KuroAnimInstanceVehicle.SetDriver
// 0x0008 (0x0008 - 0x0000)
struct KuroAnimInstanceVehicle_SetDriver final
{
public:
	class ABaseCharacter*                         InDriver;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroAnimInstanceVehicle_SetDriver;

// Function KuroVehicle.KuroBaseVehicle.K2_OnVehicleMovementModeChanged
// 0x0004 (0x0004 - 0x0000)
struct KuroBaseVehicle_K2_OnVehicleMovementModeChanged final
{
public:
	EKuroVehicleMovementMode                      PrevMovementMode;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroVehicleMovementMode                      NewMovementMode;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PrevCustomMode;                                    // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NewCustomMode;                                     // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBaseVehicle_K2_OnVehicleMovementModeChanged;

// Function KuroVehicle.KuroBaseVehicle.K2_UpdateVehicleCustomMovement
// 0x0004 (0x0004 - 0x0000)
struct KuroBaseVehicle_K2_UpdateVehicleCustomMovement final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBaseVehicle_K2_UpdateVehicleCustomMovement;

// Function KuroVehicle.KuroConfigHelper.AddSubConfig
// 0x0028 (0x0028 - 0x0000)
struct KuroConfigHelper_AddSubConfig final
{
public:
	class FName                                   KeyName;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           PropertyNames;                                     // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                InData;                                            // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroConfigHelper_AddSubConfig;

// Function KuroVehicle.KuroConfigHelper.AddSubConfigByNumber
// 0x0028 (0x0028 - 0x0000)
struct KuroConfigHelper_AddSubConfigByNumber final
{
public:
	class FName                                   KeyName;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 PropertyIds;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                InData;                                            // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroConfigHelper_AddSubConfigByNumber;

// Function KuroVehicle.KuroConfigHelper.InitBase
// 0x0010 (0x0010 - 0x0000)
struct KuroConfigHelper_InitBase final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InData;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroConfigHelper_InitBase;

// Function KuroVehicle.KuroConfigHelper.RemoveSubConfig
// 0x000C (0x000C - 0x0000)
struct KuroConfigHelper_RemoveSubConfig final
{
public:
	class FName                                   KeyName;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroConfigHelper_RemoveSubConfig;

// Function KuroVehicle.KuroConfigHelper.SetEnumMapping
// 0x0018 (0x0018 - 0x0000)
struct KuroConfigHelper_SetEnumMapping final
{
public:
	class UEnum*                                  Enumtype;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         PropertyNames;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroConfigHelper_SetEnumMapping;

// Function KuroVehicle.KuroVehicleMovementComponent.BackToRecord
// 0x0004 (0x0004 - 0x0000)
struct KuroVehicleMovementComponent_BackToRecord final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_BackToRecord;

// Function KuroVehicle.KuroVehicleMovementComponent.EnableFixFlyMode
// 0x0002 (0x0002 - 0x0000)
struct KuroVehicleMovementComponent_EnableFixFlyMode final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFixFlyModeType                               Type;                                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_EnableFixFlyMode;

// Function KuroVehicle.KuroVehicleMovementComponent.GetBaseMovement
// 0x0010 (0x0010 - 0x0000)
struct KuroVehicleMovementComponent_GetBaseMovement final
{
public:
	TArray<class UPrimitiveComponent*>            Out;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_GetBaseMovement;

// Function KuroVehicle.KuroVehicleMovementComponent.GetCurrentMotorFrontPulling
// 0x000C (0x000C - 0x0000)
struct KuroVehicleMovementComponent_GetCurrentMotorFrontPulling final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_GetCurrentMotorFrontPulling;

// Function KuroVehicle.KuroVehicleMovementComponent.GetCurrentMotorPower
// 0x0004 (0x0004 - 0x0000)
struct KuroVehicleMovementComponent_GetCurrentMotorPower final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_GetCurrentMotorPower;

// Function KuroVehicle.KuroVehicleMovementComponent.GetCurrentMotorRearPulling
// 0x000C (0x000C - 0x0000)
struct KuroVehicleMovementComponent_GetCurrentMotorRearPulling final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_GetCurrentMotorRearPulling;

// Function KuroVehicle.KuroVehicleMovementComponent.GetMotorInputDirect
// 0x000C (0x000C - 0x0000)
struct KuroVehicleMovementComponent_GetMotorInputDirect final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_GetMotorInputDirect;

// Function KuroVehicle.KuroVehicleMovementComponent.GetMotorNormal
// 0x000C (0x000C - 0x0000)
struct KuroVehicleMovementComponent_GetMotorNormal final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_GetMotorNormal;

// Function KuroVehicle.KuroVehicleMovementComponent.GetRecordDataString
// 0x0018 (0x0018 - 0x0000)
struct KuroVehicleMovementComponent_GetRecordDataString final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_GetRecordDataString;

// Function KuroVehicle.KuroVehicleMovementComponent.GetRecordInfo
// 0x0008 (0x0008 - 0x0000)
struct KuroVehicleMovementComponent_GetRecordInfo final
{
public:
	int32                                         CurrentIndex;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RecordLength;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_GetRecordInfo;

// Function KuroVehicle.KuroVehicleMovementComponent.IgnoreMoveFriction
// 0x0004 (0x0004 - 0x0000)
struct KuroVehicleMovementComponent_IgnoreMoveFriction final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_IgnoreMoveFriction;

// Function KuroVehicle.KuroVehicleMovementComponent.IsValidTransform
// 0x0060 (0x0060 - 0x0000)
struct KuroVehicleMovementComponent_IsValidTransform final
{
public:
	struct FTransformDouble                       Trans;                                             // 0x0000(0x0040)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         IgnoreActors;                                      // 0x0040(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_IsValidTransform;

// Function KuroVehicle.KuroVehicleMovementComponent.Kuro_SetGravityDirect
// 0x000C (0x000C - 0x0000)
struct KuroVehicleMovementComponent_Kuro_SetGravityDirect final
{
public:
	struct FVector                                InGravityDirect;                                   // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_Kuro_SetGravityDirect;

// Function KuroVehicle.KuroVehicleMovementComponent.KuroShipping_HandlePassiveImpact
// 0x00B8 (0x00B8 - 0x0000)
struct KuroVehicleMovementComponent_KuroShipping_HandlePassiveImpact final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0024(0x0094)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_KuroShipping_HandlePassiveImpact;

// Function KuroVehicle.KuroVehicleMovementComponent.MotorAddSubConfig
// 0x0028 (0x0028 - 0x0000)
struct KuroVehicleMovementComponent_MotorAddSubConfig final
{
public:
	class FName                                   KeyName;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           PropertyNames;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UMotorcycleConfigs*                     SubConfig;                                         // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_MotorAddSubConfig;

// Function KuroVehicle.KuroVehicleMovementComponent.MotorInitBaseConfig
// 0x0008 (0x0008 - 0x0000)
struct KuroVehicleMovementComponent_MotorInitBaseConfig final
{
public:
	class UMotorcycleConfigs*                     BaseConfig;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_MotorInitBaseConfig;

// Function KuroVehicle.KuroVehicleMovementComponent.MotorRemoveSubConfig
// 0x000C (0x000C - 0x0000)
struct KuroVehicleMovementComponent_MotorRemoveSubConfig final
{
public:
	class FName                                   KeyName;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_MotorRemoveSubConfig;

// Function KuroVehicle.KuroVehicleMovementComponent.MoveMotorcycle
// 0x0030 (0x0030 - 0x0000)
struct KuroVehicleMovementComponent_MoveMotorcycle final
{
public:
	struct FVector                                LocationDelta;                                     // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  QuatDelta;                                         // 0x0010(0x0010)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_MoveMotorcycle;

// Function KuroVehicle.KuroVehicleMovementComponent.SetMotorInput
// 0x0020 (0x0020 - 0x0000)
struct KuroVehicleMovementComponent_SetMotorInput final
{
public:
	struct FVector                                InputDirect;                                       // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrontBraking;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BackBraking;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AirRotateInput;                                    // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_SetMotorInput;

// Function KuroVehicle.KuroVehicleMovementComponent.SetMotorRotateSpeed
// 0x0010 (0x0010 - 0x0000)
struct KuroVehicleMovementComponent_SetMotorRotateSpeed final
{
public:
	struct FVector                                Axis;                                              // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedRad;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_SetMotorRotateSpeed;

// Function KuroVehicle.KuroVehicleMovementComponent.SetMovementMode
// 0x0002 (0x0002 - 0x0000)
struct KuroVehicleMovementComponent_SetMovementMode final
{
public:
	EKuroVehicleMovementMode                      NewMovementMode;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NewCustomMode;                                     // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_SetMovementMode;

// Function KuroVehicle.KuroVehicleMovementComponent.SetSimulatedMotorWheelInfos
// 0x0010 (0x0010 - 0x0000)
struct KuroVehicleMovementComponent_SetSimulatedMotorWheelInfos final
{
public:
	TArray<struct FMotorWheelDisplayInfo>         In;                                                // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_SetSimulatedMotorWheelInfos;

// Function KuroVehicle.KuroVehicleMovementComponent.TryMotorcyclingOneStep
// 0x0004 (0x0004 - 0x0000)
struct KuroVehicleMovementComponent_TryMotorcyclingOneStep final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_TryMotorcyclingOneStep;

// Function KuroVehicle.KuroVehicleMovementComponent.UpdateMotorRailMoveTransform
// 0x0060 (0x0060 - 0x0000)
struct KuroVehicleMovementComponent_UpdateMotorRailMoveTransform final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       TargetTransform;                                   // 0x0010(0x0040)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bApplyRootMotion;                                  // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x0051(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0xE];                                       // 0x0052(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_UpdateMotorRailMoveTransform;

// Function KuroVehicle.KuroVehicleMovementComponent.GetBackMotorHitResult
// 0x0098 (0x0098 - 0x0000)
struct KuroVehicleMovementComponent_GetBackMotorHitResult final
{
public:
	struct FHitResult                             OutHit;                                            // 0x0000(0x0094)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0094(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_GetBackMotorHitResult;

// Function KuroVehicle.KuroVehicleMovementComponent.GetFrontMotorHitResult
// 0x0098 (0x0098 - 0x0000)
struct KuroVehicleMovementComponent_GetFrontMotorHitResult final
{
public:
	struct FHitResult                             OutHit;                                            // 0x0000(0x0094)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0094(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_GetFrontMotorHitResult;

// Function KuroVehicle.KuroVehicleMovementComponent.GetMaxAcceleration
// 0x0004 (0x0004 - 0x0000)
struct KuroVehicleMovementComponent_GetMaxAcceleration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_GetMaxAcceleration;

// Function KuroVehicle.KuroVehicleMovementComponent.Kuro_GetGravity
// 0x000C (0x000C - 0x0000)
struct KuroVehicleMovementComponent_Kuro_GetGravity final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_Kuro_GetGravity;

// Function KuroVehicle.KuroVehicleMovementComponent.Kuro_GetGravityDirect
// 0x000C (0x000C - 0x0000)
struct KuroVehicleMovementComponent_Kuro_GetGravityDirect final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroVehicleMovementComponent_Kuro_GetGravityDirect;

}

