#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroFastCollision

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "KuroFastCollision_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class KuroFastCollision.KuroFastCollisionAlgorithm
// 0x0048 (0x0078 - 0x0030)
class UKuroFastCollisionAlgorithm : public UObject
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Add(class UObject* Agent);
	void Clear();
	void GetOverlappingAgents(class UObject* Agent, TArray<class UObject*>* OverlappingAgents);
	void Remove(class UObject* Agent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFastCollisionAlgorithm")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFastCollisionAlgorithm")
	}
	static class UKuroFastCollisionAlgorithm* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFastCollisionAlgorithm>();
	}
};
DUMPER7_ASSERTS_UKuroFastCollisionAlgorithm;

// Class KuroFastCollision.KuroFastCollisionAlgorithm_Grid
// 0x01F0 (0x0268 - 0x0078)
class UKuroFastCollisionAlgorithm_Grid final : public UKuroFastCollisionAlgorithm
{
public:
	uint8                                         Pad_78[0x1F0];                                     // 0x0078(0x01F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFastCollisionAlgorithm_Grid")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFastCollisionAlgorithm_Grid")
	}
	static class UKuroFastCollisionAlgorithm_Grid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFastCollisionAlgorithm_Grid>();
	}
};
DUMPER7_ASSERTS_UKuroFastCollisionAlgorithm_Grid;

// Class KuroFastCollision.KuroFastCollisionInterface
// 0x0000 (0x0000 - 0x0000)
class IKuroFastCollisionInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFastCollisionInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFastCollisionInterface")
	}
	static class IKuroFastCollisionInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IKuroFastCollisionInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IKuroFastCollisionInterface;

// Class KuroFastCollision.KuroFastCollisionInterface_Shape
// 0x0000 (0x0000 - 0x0000)
class IKuroFastCollisionInterface_Shape final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFastCollisionInterface_Shape")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFastCollisionInterface_Shape")
	}
	static class IKuroFastCollisionInterface_Shape* GetDefaultObj()
	{
		return GetDefaultObjImpl<IKuroFastCollisionInterface_Shape>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IKuroFastCollisionInterface_Shape;

// Class KuroFastCollision.KuroFastCollisionShapeComponent
// 0x0060 (0x0120 - 0x00C0)
class UKuroFastCollisionShapeComponent final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EKuroFastCollisionCenterSource                CenterSource;                                      // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class USceneComponent>         CenterComponent;                                   // 0x00CC(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionShapeKind                           Kind;                                              // 0x00D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Center_Manual;                                     // 0x00D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCCD;                                        // 0x00E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             Channel;                                           // 0x00E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QueryMask;                                         // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HalfExtent;                                        // 0x00F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  BoxRot;                                            // 0x0100(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Axis;                                              // 0x0110(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfLength;                                        // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFastCollisionShapeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFastCollisionShapeComponent")
	}
	static class UKuroFastCollisionShapeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFastCollisionShapeComponent>();
	}
};
DUMPER7_ASSERTS_UKuroFastCollisionShapeComponent;

// Class KuroFastCollision.KuroFastCollisionSubsystem
// 0x0058 (0x0090 - 0x0038)
class UKuroFastCollisionSubsystem final : public UWorldSubsystem
{
public:
	TSet<class UKuroFastCollisionAlgorithm*>      LiveAlgorithms;                                    // 0x0038(0x0050)(NativeAccessSpecifierPrivate)
	class UKuroFastCollisionAlgorithm*            DefaultAlgorithm;                                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UKuroFastCollisionSubsystem* Get(const class UObject* WorldContextObject);

	class UKuroFastCollisionAlgorithm* CreateAlgorithm(TSubclassOf<class UKuroFastCollisionAlgorithm> Class_0, bool bTickEnabled);
	void DestroyAlgorithm(class UKuroFastCollisionAlgorithm* Algorithm);
	class UKuroFastCollisionAlgorithm* GetDefaultAlgorithm();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFastCollisionSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFastCollisionSubsystem")
	}
	static class UKuroFastCollisionSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFastCollisionSubsystem>();
	}
};
DUMPER7_ASSERTS_UKuroFastCollisionSubsystem;

}

