#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroRenderingRuntimeBPPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "KuroCurve_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// Enum KuroRenderingRuntimeBPPlugin.EKuroClusteredStuffBlendMode
// NumValues: 0x0004
enum class EKuroClusteredStuffBlendMode : uint8
{
	EAdd                                     = 0,
	EOverlay                                 = 1,
	EMax                                     = 2,
	EKuroClusteredStuffBlendMode_MAX         = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroDynamicCloudType
// NumValues: 0x006E
enum class EKuroDynamicCloudType : uint8
{
	Cloud_TianCheng                          = 0,
	Cloud_YiLuoYuanXiang                     = 1,
	Cloud_WuGuangZhiSen                      = 2,
	Cloud_ZhongQuTaiDi                       = 3,
	Cloud_Area05                             = 4,
	Cloud_ChengXiaoShan                      = 5,
	Cloud_HeiHaiAnUP                         = 6,
	Cloud_HeiHaiAnUpper                      = 7,
	Cloud_Area08                             = 8,
	Cloud_Area09                             = 9,
	Cloud_Area10                             = 10,
	Cloud_Area11                             = 11,
	Cloud_WuYinQu01                          = 12,
	Cloud_DengLuJieMian                      = 13,
	Cloud_WuYinQu02                          = 14,
	Cloud_WuYinQu03                          = 15,
	Cloud_WuYinQu04                          = 16,
	Cloud_WuYinQu05                          = 17,
	Cloud_WuYinQuInit                        = 18,
	Cloud_XuanWoYun                          = 19,
	Cloud_MingChaoTianQi                     = 20,
	Cloud_YinTianYiXiang                     = 21,
	Cloud_HuangHunYiXiang                    = 22,
	Cloud_YeWanYiXiang                       = 23,
	Cloud_ChengXiaoShanYiXiang               = 24,
	Cloud_Special01                          = 25,
	Cloud_Special02                          = 26,
	Cloud_FuBen01                            = 27,
	Cloud_FuBen02                            = 28,
	Cloud_HeiHaiAnNight                      = 29,
	Cloud_RogueMoon01                        = 30,
	Cloud_RogueMoon02                        = 31,
	Cloud_RogueMoon03                        = 32,
	Cloud_RogueMoon04                        = 33,
	Cloud_LiNaXiTa                           = 34,
	Cloud_PaErMiLuoMuDi                      = 35,
	Cloud_HuShengBanDao                      = 36,
	Cloud_DiShaLaiHaiJiYongYeJieMiQian       = 37,
	Cloud_DiShaLaiHaiJiYongYeJieMiHou        = 38,
	Cloud_JinKuShangCheng                    = 39,
	Cloud_RogueMoon05                        = 40,
	Cloud_HeiHaiAnTianQiYin                  = 41,
	Cloud_KuangHuanJie                       = 42,
	Cloud_HuShengBanDaoJieMiHou              = 43,
	Cloud_YunHaiQu                           = 44,
	Cloud_LiNaXiTaYin                        = 45,
	Cloud_LuoMuDaoYeWan                      = 46,
	Cloud_JinKuShangJieMiHou                 = 47,
	Cloud_FeiLuoLuoChuChang                  = 48,
	Cloud_ChaiHongTianQi                     = 49,
	Cloud_DianDaoTaBaiTian                   = 50,
	Cloud_DianDaoTaYeWan                     = 51,
	Cloud_DianDaoTaLiuXin                    = 52,
	Cloud_QiQiu                              = 53,
	Cloud_QiQiuYinTian                       = 54,
	Cloud_CanPoJingJiChang                   = 55,
	Cloud_JianCiShan                         = 56,
	Cloud_GuanCeTa                           = 57,
	Cloud_ChuJianQiQiu                       = 58,
	Cloud_QiQiuYeWan                         = 59,
	Cloud_DiSiTaiDiBaiTian                   = 60,
	Cloud_DiSiTaiDiYeWan                     = 61,
	Cloud_DiSiTaiDiRiYueTongHui              = 62,
	Cloud_DiSiTaiDiLieRiTianKong             = 63,
	Cloud_DiSiTaiDiShouShiDi                 = 64,
	Cloud_DiSiTaiDiYueXiang                  = 65,
	Cloud_HeiChaoQinShi                      = 66,
	Cloud_HeiChaoNeiBiaoShiJie               = 67,
	Cloud_HeiChaoNeiLIShiJie                 = 68,
	Cloud_HeiChaoGuangLuHuanJing             = 69,
	Cloud_HeiChaoXunYouTianGuo               = 70,
	Cloud_YinHaiShiYanChang                  = 71,
	Cloud_ShiWangBiAn                        = 72,
	Cloud_HeiChaoTianQi                      = 73,
	Cloud_HeiChaoTianQiJiaQiang              = 74,
	Cloud_LieYiangTianQi                     = 75,
	Cloud_ZongDuRiYueTongHui                 = 76,
	Cloud_SuiBoBaiTian                       = 77,
	Cloud_SuiBoYeWan                         = 78,
	Cloud_SuiBoKuShanShui                    = 79,
	Cloud_SuiBoYinTian                       = 80,
	Cloud_AnQuanDianBaiTian                  = 81,
	Cloud_AnQuanDianYeWan                    = 82,
	Cloud_NotRenderBPCloud                   = 83,
	Cloud_LaHaiLuoBaiTian                    = 84,
	Cloud_LaHaiLuoBaiYeWan                   = 85,
	Cloud_CiBaoQianZhi                       = 86,
	Cloud_CiBaoHouZhi                        = 87,
	Cloud_XingMenBOSS                        = 88,
	Cloud_ZhuiLuoLuXin                       = 89,
	Cloud_LuXinNeiBu                         = 90,
	Cloud_LuXinLingZhu                       = 91,
	Cloud_FuGunagLinBaiTian                  = 92,
	Cloud_FuGuangLinYeWan                    = 93,
	Cloud_LaHaiLuoYinTian                    = 94,
	Cloud_FanGao                             = 95,
	Cloud_LuoYiBaiTian                       = 96,
	Cloud_LuoYiYeWan                         = 97,
	Cloud_LuoYiJiGuang                       = 98,
	Cloud_LuoYiChuJian                       = 99,
	Cloud_LuoYiXingHaiBOSSYiJie              = 100,
	Cloud_LuoYiXingHaiBOSSSanJie             = 101,
	Cloud_LaHaiLuoChuJian                    = 102,
	Cloud_LuoYiHongSeJiGuang                 = 103,
	Cloud_RiLingGuanJieMiQian                = 104,
	Cloud_RiLingGuanJieMiHou                 = 105,
	Cloud_GaoJieBossYiJie                    = 106,
	Cloud_GaoJieBossSanJie                   = 107,
	Cloud_Max                                = 108,
	Cloud_MAX                                = 109,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroRainType
// NumValues: 0x0011
enum class EKuroRainType : uint8
{
	EKuroRainType1                           = 0,
	EKuroRainType2                           = 1,
	EKuroRainType3                           = 2,
	EKuroRainType4                           = 3,
	EKuroRainType5                           = 4,
	EKuroRainType6                           = 5,
	EKuroRainType7                           = 6,
	EKuroRainType8                           = 7,
	EKuroRainType9                           = 8,
	EKuroRainType10                          = 9,
	EKuroRainType11                          = 10,
	EKuroRainType12                          = 11,
	EKuroRainType13                          = 12,
	EKuroRainType14                          = 13,
	EKuroRainType15                          = 14,
	EKuroRainType16                          = 15,
	EKuroRainType_MAX                        = 16,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroThunderType
// NumValues: 0x0012
enum class EKuroThunderType : uint8
{
	EKuroThunderType1                        = 0,
	EKuroThunderType2                        = 1,
	EKuroThunderType3                        = 2,
	EKuroThunderType4                        = 3,
	EKuroThunderType5                        = 4,
	EKuroThunderType6                        = 5,
	EKuroThunderType7                        = 6,
	EKuroThunderType8                        = 7,
	EKuroThunderType9                        = 8,
	EKuroThunderType10                       = 9,
	EKuroThunderType11                       = 10,
	EKuroThunderType12                       = 11,
	EKuroThunderType13                       = 12,
	EKuroThunderType14                       = 13,
	EKuroThunderType15                       = 14,
	EKuroThunderType16                       = 15,
	EKuroThunderType_Max                     = 16,
	EKuroThunderType_MAX                     = 17,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroPPLensflareType
// NumValues: 0x0012
enum class EKuroPPLensflareType : uint8
{
	EKuroPPLensflareType1                    = 0,
	EKuroPPLensflareType2                    = 1,
	EKuroPPLensflareType3                    = 2,
	EKuroPPLensflareType4                    = 3,
	EKuroPPLensflareType5                    = 4,
	EKuroPPLensflareType6                    = 5,
	EKuroPPLensflareType7                    = 6,
	EKuroPPLensflareType8                    = 7,
	EKuroPPLensflareType9                    = 8,
	EKuroPPLensflareType10                   = 9,
	EKuroPPLensflareType11                   = 10,
	EKuroPPLensflareType12                   = 11,
	EKuroPPLensflareType13                   = 12,
	EKuroPPLensflareType14                   = 13,
	EKuroPPLensflareType15                   = 14,
	EKuroPPLensflareType16                   = 15,
	EKuroPPLensflareType_Max                 = 16,
	EKuroPPLensflareType_MAX                 = 17,
};

// Enum KuroRenderingRuntimeBPPlugin.EBillboardMode
// NumValues: 0x0005
enum class EBillboardMode : uint8
{
	Free                                     = 0,
	UpWard                                   = 1,
	Right                                    = 2,
	Max                                      = 3,
	EBillboardMode_MAX                       = 4,
};

// Enum KuroRenderingRuntimeBPPlugin.ECaptureMode
// NumValues: 0x0004
enum class ECaptureMode : uint8
{
	Default                                  = 0,
	VertexColor                              = 1,
	Depth                                    = 2,
	ECaptureMode_MAX                         = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroDebugDrawComponentType
// NumValues: 0x0004
enum class EKuroDebugDrawComponentType : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	Cone                                     = 2,
	EKuroDebugDrawComponentType_MAX          = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.ECurveSourceType
// NumValues: 0x0003
enum class ECurveSourceType : uint8
{
	Function                                 = 0,
	CurveFloat                               = 1,
	ECurveSourceType_MAX                     = 2,
};

// Enum KuroRenderingRuntimeBPPlugin.EFloatLightMovement
// NumValues: 0x0004
enum class EFloatLightMovement : uint8
{
	ENoMovement                              = 0,
	ESwing                                   = 1,
	EJump                                    = 2,
	EFloatLightMovement_MAX                  = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroUI3DState
// NumValues: 0x0004
enum class EKuroUI3DState : uint8
{
	NotLoaded                                = 0,
	Loading                                  = 1,
	Loaded                                   = 2,
	EKuroUI3DState_MAX                       = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharacterControllerApplyType
// NumValues: 0x0005
enum class EKuroCharacterControllerApplyType : uint8
{
	ModifyProperty                           = 0,
	ReplaceMaterial                          = 1,
	ReplaceBaseMaterials                     = 2,
	ECharacterControllerApplyType_Max        = 3,
	EKuroCharacterControllerApplyType_MAX    = 4,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharMeshPart
// NumValues: 0x0013
enum class EKuroCharMeshPart : uint8
{
	Bangs                                    = 0,
	Hair                                     = 1,
	Head                                     = 2,
	Face                                     = 3,
	Eye                                      = 4,
	Body                                     = 5,
	Up                                       = 6,
	Down                                     = 7,
	Leg                                      = 8,
	Cloth                                    = 9,
	Skirt                                    = 10,
	Star                                     = 11,
	Core                                     = 12,
	Hand                                     = 13,
	Wings                                    = 14,
	Prop                                     = 15,
	Weapon                                   = 16,
	ECharacterMeshPart_Max                   = 17,
	EKuroCharMeshPart_MAX                    = 18,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharSlotSpecifiedType
// NumValues: 0x0006
enum class EKuroCharSlotSpecifiedType : uint8
{
	All                                      = 0,
	BodyAndOutline                           = 1,
	Body                                     = 2,
	Outline                                  = 3,
	ECharacterSlotSpecifiedType_Max          = 4,
	EKuroCharSlotSpecifiedType_MAX           = 5,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharSlotType
// NumValues: 0x0007
enum class EKuroCharSlotType : uint8
{
	Body                                     = 0,
	Outline                                  = 1,
	EyeMask                                  = 2,
	HairEyeTransparent                       = 3,
	FaceShadow                               = 4,
	ECharacterSlotType_Max                   = 5,
	EKuroCharSlotType_MAX                    = 6,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharBodySpecifiedType
// NumValues: 0x000A
enum class EKuroCharBodySpecifiedType : uint8
{
	All                                      = 0,
	Body                                     = 1,
	Weapon                                   = 2,
	Hulu                                     = 3,
	WeaponAndHulu                            = 4,
	Other                                    = 5,
	ExtraBody                                = 6,
	External                                 = 7,
	ECharacterBodySpecifiedType_Max          = 8,
	EKuroCharBodySpecifiedType_MAX           = 9,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharBodyType
// NumValues: 0x0007
enum class EKuroCharBodyType : uint8
{
	Body                                     = 0,
	Weapon                                   = 1,
	Hulu                                     = 2,
	Other                                    = 3,
	ExtraBody                                = 4,
	EKuroCharBodyType_Max                    = 5,
	EKuroCharBodyType_MAX                    = 6,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroInterpolateRangeType
// NumValues: 0x0004
enum class EKuroInterpolateRangeType : uint8
{
	Start                                    = 0,
	Loop                                     = 1,
	End                                      = 2,
	EKuroInterpolateRangeType_MAX            = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.ECharacterControllerUVSwitch
// NumValues: 0x0007
enum class KuroRenderingRuntimeBPPlugin::ECharacterControllerUVSwitch : uint8
{
	UV1                                      = 0,
	UV2                                      = 1,
	UV3                                      = 2,
	UV4                                      = 3,
	ScreenUV                                 = 4,
	ECharacterControllerUVSwitch_Max         = 5,
	ECharacterControllerUVSwitch_MAX         = 6,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharacterControllerChannelSwitch
// NumValues: 0x0007
enum class EKuroCharacterControllerChannelSwitch : uint8
{
	RGB                                      = 0,
	R                                        = 1,
	G                                        = 2,
	B                                        = 3,
	A                                        = 4,
	EKuroCharacterControllerChannelSwitch_Max = 5,
	EKuroCharacterControllerChannelSwitch_MAX = 6,
};

// Enum KuroRenderingRuntimeBPPlugin.ESplineShareMode
// NumValues: 0x0004
enum class ESplineShareMode : uint8
{
	Independent                              = 0,
	SharedFirst                              = 1,
	SharedExternal                           = 2,
	ESplineShareMode_MAX                     = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.ESplinePlaneType
// NumValues: 0x0004
enum class ESplinePlaneType : uint8
{
	XY                                       = 0,
	XZ                                       = 1,
	YZ                                       = 2,
	ESplinePlaneType_MAX                     = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroSceneInteractionState
// NumValues: 0x0017
enum class EKuroSceneInteractionState : uint8
{
	State1                                   = 0,
	State2                                   = 1,
	State3                                   = 2,
	State4                                   = 3,
	State5                                   = 4,
	State6                                   = 5,
	State7                                   = 6,
	State8                                   = 7,
	State9                                   = 8,
	State10                                  = 9,
	State11                                  = 10,
	State12                                  = 11,
	State13                                  = 12,
	State14                                  = 13,
	State15                                  = 14,
	State16                                  = 15,
	State17                                  = 16,
	State18                                  = 17,
	State19                                  = 18,
	State20                                  = 19,
	ConcealedState                           = 20,
	Error                                    = 21,
	EKuroSceneInteractionState_MAX           = 22,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroInterpolateRangeType_SI
// NumValues: 0x0004
enum class EKuroInterpolateRangeType_SI : uint8
{
	Start                                    = 0,
	Loop                                     = 1,
	End                                      = 2,
	EKuroInterpolateRangeType_MAX            = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroSceneTransitionState
// NumValues: 0x0006
enum class EKuroSceneTransitionState : uint8
{
	Loading                                  = 0,
	Loaded                                   = 1,
	Unloading                                = 2,
	Unloaded                                 = 3,
	KuroSceneTransitionStateMax              = 4,
	EKuroSceneTransitionState_MAX            = 5,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroPerformanceMode
// NumValues: 0x0003
enum class EKuroPerformanceMode : uint8
{
	EPM_OutPerformanceMode                   = 0,
	EPM_InPerformanceMode                    = 1,
	EPM_MAX                                  = 2,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroSmartLightActorDetectType
// NumValues: 0x0003
enum class EKuroSmartLightActorDetectType : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	EKuroSmartLightActorDetectType_MAX       = 2,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroUiSceneLoadingState
// NumValues: 0x0005
enum class EKuroUiSceneLoadingState : uint8
{
	NotLoaded                                = 0,
	Loading                                  = 1,
	LoadedNotVisible                         = 2,
	LoadedAndVisible                         = 3,
	EKuroUiSceneLoadingState_MAX             = 4,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroWorldRainCustomRandomDriver
// NumValues: 0x0005
enum class EKuroWorldRainCustomRandomDriver : uint8
{
	CustomRandomDriver_None                  = 0,
	CustomRandomDriver_NormalizedAge         = 1,
	CustomRandomDriver_Velocity              = 2,
	CustomRandomDriver_VelocityMultiTimeScale = 3,
	CustomRandomDriver_MAX                   = 4,
};

// Enum KuroRenderingRuntimeBPPlugin.KuroFeatureLevel
// NumValues: 0x0003
enum class EKuroFeatureLevel : uint8
{
	ES3_1                                    = 0,
	SM5                                      = 1,
	KuroFeatureLevel_MAX                     = 2,
};

// Enum KuroRenderingRuntimeBPPlugin.BP_EWorldType
// NumValues: 0x0009
enum class EBP_EWorldType : uint8
{
	None                                     = 0,
	Game                                     = 1,
	Editor                                   = 2,
	PIE                                      = 3,
	EditorPreview                            = 4,
	GamePreview                              = 5,
	GameRPC                                  = 6,
	Inactive                                 = 7,
	BP_MAX                                   = 8,
};

// ScriptStruct KuroRenderingRuntimeBPPlugin.KuroEffectColorGradingSettings
// 0x0018 (0x0018 - 0x0000)
struct FKuroEffectColorGradingSettings final
{
public:
	uint8                                         bOverride_Desaturate : 1;                          // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_Tint : 1;                                // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Desaturate;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Tint;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroEffectColorGradingSettings;

// ScriptStruct KuroRenderingRuntimeBPPlugin.KuroMaterialCurveFloatGroup
// 0x01B0 (0x01B0 - 0x0000)
struct FKuroMaterialCurveFloatGroup final
{
public:
	struct FKuroCurveFloat                        StartCurve;                                        // 0x0000(0x0090)(Edit, BlueprintVisible, Interp, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        LoopCurve;                                         // 0x0090(0x0090)(Edit, BlueprintVisible, Interp, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        EndCurve;                                          // 0x0120(0x0090)(Edit, BlueprintVisible, Interp, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroMaterialCurveFloatGroup;

// ScriptStruct KuroRenderingRuntimeBPPlugin.KuroMountainSetting
// 0x0028 (0x0028 - 0x0000)
struct FKuroMountainSetting final
{
public:
	uint8                                         bOverride_MountainFogColor : 1;                    // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           MountainFogColor;                                  // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_MountainColor : 1;                       // 0x0014(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           MountainColor;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroMountainSetting;

// ScriptStruct KuroRenderingRuntimeBPPlugin.KuroPoseSequence
// 0x0018 (0x0018 - 0x0000)
struct FKuroPoseSequence final
{
public:
	TArray<class UPoseableMeshComponent*>         PoseableMeshComponents;                            // 0x0000(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroPoseSequence;

// ScriptStruct KuroRenderingRuntimeBPPlugin.KuroDestructibleEffect
// 0x0050 (0x0050 - 0x0000)
struct FKuroDestructibleEffect final
{
public:
	class FName                                   EffectModelPath;                                   // 0x0000(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Offset;                                            // 0x0010(0x0030)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   Socket;                                            // 0x0040(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AttachLocation;                                    // 0x004C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AttachRotation;                                    // 0x004D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AttachScale;                                       // 0x004E(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DetachOnEnd;                                       // 0x004F(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroDestructibleEffect;

// ScriptStruct KuroRenderingRuntimeBPPlugin.MountainParameters
// 0x0010 (0x0010 - 0x0000)
struct FMountainParameters final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      OverrideMaterial;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMountainParameters;

// ScriptStruct KuroRenderingRuntimeBPPlugin.DistanceFieldSettings
// 0x0024 (0x0024 - 0x0000)
struct FDistanceFieldSettings final
{
public:
	uint8                                         bOverride_OcclusionMaxDistance : 1;                // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_Contrast : 1;                            // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OcclusionExponent : 1;                   // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MinOcclusion : 1;                        // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OcclusionTint : 1;                       // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OcclusionMaxDistance;                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Contrast;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OcclusionExponent;                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinOcclusion;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OcclusionTint;                                     // 0x0014(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDistanceFieldSettings;

// ScriptStruct KuroRenderingRuntimeBPPlugin.KuroGICustomTag
// 0x001C (0x001C - 0x0000)
struct FKuroGICustomTag final
{
public:
	class FName                                   Property;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroGICustomTag;

// ScriptStruct KuroRenderingRuntimeBPPlugin.KuroCloudLayerSetting
// 0x00D0 (0x00D0 - 0x0000)
struct FKuroCloudLayerSetting final
{
public:
	uint8                                         bOverride_CloudsDensity : 1;                       // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsBlend : 1;                         // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsBloom : 1;                         // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_UVScale : 1;                             // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_WindForceScale : 1;                      // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_BaseLayerSize : 1;                       // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SecondLayerSize : 1;                     // 0x0000(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudLayer1 : 1;                         // 0x0000(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudLayer2 : 1;                         // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsHardness : 1;                      // 0x0001(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsTranslucent : 1;                   // 0x0001(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsVertexDensity : 1;                 // 0x0001(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsFluffy : 1;                        // 0x0001(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsDistotion : 1;                     // 0x0001(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsScattering : 1;                    // 0x0001(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsAmbient : 1;                       // 0x0001(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsShadowSize : 1;                    // 0x0002(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsShadowSoft : 1;                    // 0x0002(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsUpperBrightness : 1;               // 0x0002(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsLowerBrightness : 1;               // 0x0002(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsUpperColor : 1;                    // 0x0002(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsLowerColor : 1;                    // 0x0002(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsBackgroundColor : 1;               // 0x0002(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsBackground : 1;                    // 0x0002(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudsHorizonAlpha : 1;                  // 0x0003(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_WindDynamic : 1;                         // 0x0003(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_WindDispersing : 1;                      // 0x0003(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SecondLayerAlpha : 1;                    // 0x0003(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SecondLayerColor : 1;                    // 0x0003(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SecondLayerScale : 1;                    // 0x0003(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SecondLayerHardness : 1;                 // 0x0003(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SecondLayerWind : 1;                     // 0x0003(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	float                                         CloudsDensity;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsBlend;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsBloom;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UVScale;                                           // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindForceScale;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               BaseLayerSize;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               SecondLayerSize;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             CloudLayer1;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             CloudLayer2;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsHardness;                                    // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsTranslucent;                                 // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsVertexDensity;                               // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsFluffy;                                      // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsDistotion;                                   // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsScattering;                                  // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsAmbient;                                     // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsShadowSize;                                  // 0x006C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsShadowSoft;                                  // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsUpperBrightness;                             // 0x0074(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsLowerBrightness;                             // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           CloudsUpperColor;                                  // 0x007C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           CloudsLowerColor;                                  // 0x008C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           CloudsBackgroundColor;                             // 0x009C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsBackground;                                  // 0x00AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudsHorizonAlpha;                                // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindDynamic;                                       // 0x00B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindDispersing;                                    // 0x00B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondLayerAlpha;                                  // 0x00BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondLayerColor;                                  // 0x00C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondLayerScale;                                  // 0x00C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondLayerHardness;                               // 0x00C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondLayerWind;                                   // 0x00CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroCloudLayerSetting;

// ScriptStruct KuroRenderingRuntimeBPPlugin.CloudCover
// 0x0018 (0x0018 - 0x0000)
struct FCloudCover final
{
public:
	class UMaterialInterface*                     CoverMaterial;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            Mesh;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudAngle;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCloudCover;

// ScriptStruct KuroRenderingRuntimeBPPlugin.MainLightSetting
// 0x0088 (0x0088 - 0x0000)
struct FMainLightSetting final
{
public:
	uint8                                         bOverride_MainLightIntensity : 1;                  // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MainLightTint : 1;                       // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MobileMainLightTintSaturation : 1;       // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MobileMainLightTintValueMut : 1;         // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MainLightTemperature : 1;                // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MainLightSpecularIntensity : 1;          // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DirLightSpecularIntensity : 1;           // 0x0000(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ShadowTintIntensity : 1;                 // 0x0000(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ShadowTintColor : 1;                     // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_NearMainLightColorPC : 1;                // 0x0001(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_NearMainLightDistancePC : 1;             // 0x0001(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_UseSeperateMobileNearMainLight : 1;      // 0x0001(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_NearMainLightColorMobile : 1;            // 0x0001(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_NearMainLightDistanceMobile : 1;         // 0x0001(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RoughnessPowIntensity : 1;               // 0x0001(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RoughnessPowIntensityThreshold : 1;      // 0x0001(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RoughnessIntensity : 1;                  // 0x0002(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MetallicIntensity : 1;                   // 0x0002(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MetallicIntensityThreshold : 1;          // 0x0002(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LightFunctionFadeDistance : 1;           // 0x0002(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MainLightIntensity;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInCave : 1;                                       // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPCInCave : 1;                                     // 0x0008(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           MainLightTint;                                     // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MobileMainLightTintSaturation;                     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MobileMainLightTintValueMut;                       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MainLightTemperature;                              // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MainLightSpecularIntensity;                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirLightSpecularIntensity;                         // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowTintIntensity;                               // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShadowTintColor;                                   // 0x0034(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NearMainLightColorPC;                              // 0x0044(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NearMainLightDistancePC;                           // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseSepMobileNearMainLight;                         // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           NearMainLightColorMobile;                          // 0x005C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NearMainLightDistanceMobile;                       // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoughnessPowIntensity;                             // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoughnessPowIntensityThreshold;                    // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoughnessIntensity;                                // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MetallicIntensity;                                 // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MetallicIntensityThreshold;                        // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightFunctionFadeDistance;                         // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMainLightSetting;

// ScriptStruct KuroRenderingRuntimeBPPlugin.SkyLightSetting
// 0x0160 (0x0160 - 0x0000)
struct alignas(0x10) FSkyLightSetting final
{
public:
	uint8                                         bOverride_SkyLightColor : 1;                       // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MobileSkyLightColorSaturation : 1;       // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MobileSkyLightValueMut : 1;              // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SkyLightIntensity : 1;                   // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SkyLightSpecularIntensity : 1;           // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
