#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroSceneModifier

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct KuroSceneModifier.KuroSceneMatModifyData
// 0x0018 (0x0018 - 0x0000)
struct FKuroSceneMatModifyData final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceConstant*>      MatModifyArray;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FKuroSceneMatModifyData) == 0x000008, "Wrong alignment on FKuroSceneMatModifyData");
static_assert(sizeof(FKuroSceneMatModifyData) == 0x000018, "Wrong size on FKuroSceneMatModifyData");
static_assert(offsetof(FKuroSceneMatModifyData, Mesh) == 0x000000, "Member 'FKuroSceneMatModifyData::Mesh' has a wrong offset!");
static_assert(offsetof(FKuroSceneMatModifyData, MatModifyArray) == 0x000008, "Member 'FKuroSceneMatModifyData::MatModifyArray' has a wrong offset!");

// ScriptStruct KuroSceneModifier.KuroSceneModifierDataState
// 0x0010 (0x0010 - 0x0000)
struct FKuroSceneModifierDataState final
{
public:
	class UKuroSceneMatModifyDataAsset*           MatDataAsset;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroSceneModifierDataState) == 0x000008, "Wrong alignment on FKuroSceneModifierDataState");
static_assert(sizeof(FKuroSceneModifierDataState) == 0x000010, "Wrong size on FKuroSceneModifierDataState");
static_assert(offsetof(FKuroSceneModifierDataState, MatDataAsset) == 0x000000, "Member 'FKuroSceneModifierDataState::MatDataAsset' has a wrong offset!");

// ScriptStruct KuroSceneModifier.KuroSceneModifierComponentBackupEntry
// 0x0020 (0x0020 - 0x0000)
struct FKuroSceneModifierComponentBackupEntry final
{
public:
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroSceneModifierComponentBackupEntry) == 0x000008, "Wrong alignment on FKuroSceneModifierComponentBackupEntry");
static_assert(sizeof(FKuroSceneModifierComponentBackupEntry) == 0x000020, "Wrong size on FKuroSceneModifierComponentBackupEntry");
static_assert(offsetof(FKuroSceneModifierComponentBackupEntry, Materials) == 0x000000, "Member 'FKuroSceneModifierComponentBackupEntry::Materials' has a wrong offset!");

// ScriptStruct KuroSceneModifier.KuroSceneModifierEntry
// 0x0068 (0x0068 - 0x0000)
struct FKuroSceneModifierEntry final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TWeakObjectPtr<class UStaticMeshComponent>, struct FKuroSceneModifierComponentBackupEntry> BackupComponents; // 0x0018(0x0050)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FKuroSceneModifierEntry) == 0x000008, "Wrong alignment on FKuroSceneModifierEntry");
static_assert(sizeof(FKuroSceneModifierEntry) == 0x000068, "Wrong size on FKuroSceneModifierEntry");
static_assert(offsetof(FKuroSceneModifierEntry, BackupComponents) == 0x000018, "Member 'FKuroSceneModifierEntry::BackupComponents' has a wrong offset!");

}

