#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroDynamicAtlas

#include "Basic.hpp"


namespace SDK
{

// Enum KuroDynamicAtlas.ExpandMode
// NumValues: 0x0005
enum class ExpandMode : uint8
{
	None                                     = 0,
	InPlace                                  = 1,
	Horizontal                               = 2,
	Vertical                                 = 3,
	ExpandMode_MAX                           = 4,
};

// ScriptStruct KuroDynamicAtlas.DynamicAtlasSlotManagedHandle
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FDynamicAtlasSlotManagedHandle final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDynamicAtlasSlotManagedHandle;

// ScriptStruct KuroDynamicAtlas.TextureExpandParam
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FTextureExpandParam final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTextureExpandParam;

// ScriptStruct KuroDynamicAtlas.DynamicTextureAtlasSetting
// 0x0038 (0x0038 - 0x0000)
struct FDynamicTextureAtlasSetting final
{
public:
	class FString                                 AtlasTag;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultWidth;                                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultHeight;                                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxAtlasTextures;                                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxUpdateSlotCountInOneFrame;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InitWithTransparent;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ExpandMode                                    ExpandMode;                                        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x16];                                      // 0x0022(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDynamicTextureAtlasSetting;

}

