#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroAudio

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "KuroAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class KuroAudio.KuroAudioStateVolume
// 0x0028 (0x0310 - 0x02E8)
class AKuroAudioStateVolume final : public AVolume
{
public:
	class FString                                 Group;                                             // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 State;                                             // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Priority;                                          // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroAudioStateVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroAudioStateVolume")
	}
	static class AKuroAudioStateVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroAudioStateVolume>();
	}
};
DUMPER7_ASSERTS_AKuroAudioStateVolume;

// Class KuroAudio.KuroAmbientSoundActor
// 0x0008 (0x02B8 - 0x02B0)
class AKuroAmbientSoundActor final : public AActor
{
public:
	class UKuroAmbientSoundComponent*             AmbientSoundComponent;                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroAmbientSoundActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroAmbientSoundActor")
	}
	static class AKuroAmbientSoundActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroAmbientSoundActor>();
	}
};
DUMPER7_ASSERTS_AKuroAmbientSoundActor;

// Class KuroAudio.KuroAudioStatics
// 0x0000 (0x0030 - 0x0030)
class UKuroAudioStatics final : public UBlueprintFunctionLibrary
{
public:
	static void ChangeIosAudioSessionProperties();
	static void ExecuteActionOnEvent(const class UAkAudioEvent* AudioEvent, const EAudioActionType ActionType, const class AActor* Actor, const int32 TransitionDuration, const EAudioFadeCurve TransitionFadeCurve);
	static void ExecuteActionOnEventName(const class FString& EventName, const EAudioActionType ActionType, const class AActor* Actor, const int32 TransitionDuration, const EAudioFadeCurve TransitionFadeCurve);
	static void ExecuteActionOnPlayingId(const int32 PlayingId, const EAudioActionType ActionType, const int32 TransitionDuration, const EAudioFadeCurve TransitionFadeCurve);
	static class UAkComponent* GetAkComponent(class USceneComponent* Parent, const class FName& SocketName, bool* bCreated);
	static class UKuroAudioEnvironmentSubsystem* GetAudioEnvironmentSubsystem(const class UWorld* World);
	static int32 GetSourcePlayPosition(const int32 PlayingId);
	static bool IsAndroidApiUsingOpenSL();
	static bool IsDolbyAtmosGameSupported();
	static void PostNotifyEvent(const class UAkAudioEvent* NotifyEvent, const class AActor* Actor);
	static void SeekOnEventName(const class FString& EventName, const int32 Position, const class AActor* Actor, const int32 PlayingId, const bool bSnapToMarker);
	static void SetIosAuditPackage(bool IsAuditPackage);
	static void SetRtpcValue(const class FString& RtpcName, const float Value, const class AActor* Actor, const int32 TransitionDuration, const EAudioFadeCurve TransitionFadeCurve);
	static void SetState(const class FString& StateGroup, const class FString& State);
	static void SetSwitch(const class FString& SwitchGroup, const class FString& SwitchState, const class AActor* Actor);
	static void StopAll(const class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroAudioStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroAudioStatics")
	}
	static class UKuroAudioStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAudioStatics>();
	}
};
DUMPER7_ASSERTS_UKuroAudioStatics;

// Class KuroAudio.KuroAmbientSoundComponent
// 0x0050 (0x0270 - 0x0220)
class UKuroAmbientSoundComponent final : public USceneComponent
{
public:
	class UAkAudioEvent*                          AudioEvent;                                        // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoPlay;                                         // 0x0220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AttenuationScalingFactor;                          // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     SoundPositions;                                    // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_238[0x38];                                     // 0x0238(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PlaySound();
	void StopSound();

	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroAmbientSoundComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroAmbientSoundComponent")
	}
	static class UKuroAmbientSoundComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAmbientSoundComponent>();
	}
};
DUMPER7_ASSERTS_UKuroAmbientSoundComponent;

// Class KuroAudio.KuroAmbientSoundPositionsProxyComponent
// 0x0000 (0x06B0 - 0x06B0)
class UKuroAmbientSoundPositionsProxyComponent final : public UInstancedStaticMeshComponent
{
public:
	class UKuroAmbientSoundComponent*             TargetComponent;                                   // 0x06A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroAmbientSoundPositionsProxyComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroAmbientSoundPositionsProxyComponent")
	}
	static class UKuroAmbientSoundPositionsProxyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAmbientSoundPositionsProxyComponent>();
	}
};
DUMPER7_ASSERTS_UKuroAmbientSoundPositionsProxyComponent;

// Class KuroAudio.KuroAudioDelegates
// 0x0000 (0x0030 - 0x0030)
class UKuroAudioDelegates final : public UBlueprintFunctionLibrary
{
public:
	static void SetAudioPauseDelegate(const TDelegate<void()>& InDelegate);
	static void SetAudioResumeDelegate(const TDelegate<void()>& InDelegate);
	static void UnbindAudioPauseDelegate();
	static void UnbindAudioResumeDelegate();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroAudioDelegates")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroAudioDelegates")
	}
	static class UKuroAudioDelegates* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAudioDelegates>();
	}
};
DUMPER7_ASSERTS_UKuroAudioDelegates;

// Class KuroAudio.KuroAudioEnvironmentSubsystem
// 0x0748 (0x0780 - 0x0038)
class alignas(0x10) UKuroAudioEnvironmentSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x278];                                     // 0x0038(0x0278)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              EnvironmentUpdatedDelegate;                        // 0x02B0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x4C0];                                    // 0x02C0(0x04C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void D_DynamicReverbTrace(const struct FVectorDouble& Location, const bool bForceUpdate);
	void DynamicReverbApply();
	void DynamicReverbReset();
	void DynamicReverbTrace(const struct FVector& Location, const bool bForceUpdate);

	struct FKuroAudioEnvironmentInfo GetEnvironmentInfo(const struct FVector& Location) const;
	struct FKuroAudioEnvironmentInfo GetEnvironmentInfo_MusicCompatible(const struct FVector& Location) const;
	TMap<class FString, class FString> GetEnvironmentStates(const struct FVector& Location) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroAudioEnvironmentSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroAudioEnvironmentSubsystem")
	}
	static class UKuroAudioEnvironmentSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAudioEnvironmentSubsystem>();
	}
};
DUMPER7_ASSERTS_UKuroAudioEnvironmentSubsystem;

// Class KuroAudio.KuroAudioVolume
// 0x0018 (0x0300 - 0x02E8)
class AKuroAudioVolume final : public AVolume
{
public:
	EKuroAudioVolumeChannel                       Channel;                                           // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Priority;                                          // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          StateEvent;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDynamicReverb;                              // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroAudioVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroAudioVolume")
	}
	static class AKuroAudioVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroAudioVolume>();
	}
};
DUMPER7_ASSERTS_AKuroAudioVolume;

// Class KuroAudio.KuroBgPlayerStatic
// 0x0000 (0x0030 - 0x0030)
class UKuroBgPlayerStatic final : public UBlueprintFunctionLibrary
{
public:
	static void Play();
	static void Stop();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBgPlayerStatic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBgPlayerStatic")
	}
	static class UKuroBgPlayerStatic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroBgPlayerStatic>();
	}
};
DUMPER7_ASSERTS_UKuroBgPlayerStatic;

// Class KuroAudio.MovieSceneKuroAudioEventSection
// 0x0048 (0x0140 - 0x00F8)
class UMovieSceneKuroAudioEventSection final : public UMovieSceneSection
{
public:
	bool                                          bStopAtSectionEnd;                                 // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FadeDuration;                                      // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAudioFadeCurve                               FadeCurve;                                         // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSyncAudio;                                        // 0x0101(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoMatchLength;                                  // 0x0102(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          AudioEvent;                                        // 0x0108(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UAkAudioEvent>           SoftAudioEvent;                                    // 0x0110(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneKuroAudioEventSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneKuroAudioEventSection")
	}
	static class UMovieSceneKuroAudioEventSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneKuroAudioEventSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneKuroAudioEventSection;

// Class KuroAudio.MovieSceneKuroAudioEventTrack
// 0x0018 (0x00B0 - 0x0098)
class UMovieSceneKuroAudioEventTrack final : public UMovieSceneTrack
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneKuroAudioEventTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneKuroAudioEventTrack")
	}
	static class UMovieSceneKuroAudioEventTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneKuroAudioEventTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneKuroAudioEventTrack;

}

