#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroSDK

#include "Basic.hpp"

#include "KuroSDK_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class KuroSDK.KuroSDKManager
// 0x0238 (0x0268 - 0x0030)
class UKuroSDKManager final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool result)>   InitDelegate;                                      // 0x0038(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& result)> LoginSuccessDelegate;                // 0x0048(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FLoginStruct& LoginInfo)> LoginDelegate;              // 0x0058(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              KickDelegate;                                      // 0x0068(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              LogoutDelegate;                                    // 0x0078(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              ExitDelegate;                                      // 0x0088(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(uint8 flagId)>  HasExitDelegate;                                   // 0x0098(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPaymentStruct& PaymentInfo, const class FString& str)> PaymentDelegate; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(uint8 flagId)>  PostRedPointDelegate;                              // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& str)> PostProductDelegate;                    // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool result)>   ProtocolCallBack;                                  // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& data)> GameStateChangeCallBack;               // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool result)>   RequestPhotoPermissionDelegate;                    // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& result)> AnnounceInitDelegate;                // 0x0110(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& result)> AnnounceOpenDelegate;                // 0x0120(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& result)> AnnounceRedPointDelegate;            // 0x0130(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& result)> CustomerServiceResultDelegate;       // 0x0140(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& source, const class FString& result)> GetParamsDelegate; // 0x0150(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& result)> OnLoginDelegate;                     // 0x0160(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& result)> DeepLinkDelegate;                    // 0x0170(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& source, const class FString& result)> GetAdsValueDelegate; // 0x0180(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 code, const class FString& value, const class FString& msg)> GetSharePlatformDelegate; // 0x0190(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 code, const class FString& platform, const class FString& msg)> ShareResultDelegate; // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& log)> LogDelegate;                            // 0x01B0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              WebViewCloseDelegate;                              // 0x01C0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool result, const class FString& data)> ExternalLoginCallBack;    // 0x01D0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool result, const TArray<struct FAchievementStruct>& data)> ExternalQueryAchievementsDelegate; // 0x01E0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool result, const TArray<class FString>& data)> ExternalWriteAchievementsDelegate; // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Host, const class FString& DeepValue, const class FString& Source)> OnActivatedByApplinksDelegate; // 0x0200(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_210[0x58];                                     // 0x0210(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void BindAccount();
	static class FString CallPlugin(const class FString& data);
	static bool CallPluginAsync(const class FString& data, const TDelegate<void(const class FString& Result)>& callback);
	static void CheckApplinksActivation();
	static bool CheckPhotoPermission();
	static void ClearLoginInfo();
	static void ClosePostWebView();
	static void CloseWebView(const class FString& identifier);
	static void DoEngineExit();
	static bool DoInitSdkProcedure();
	static void ExitGame();
	static void FreePlugin(const class FString& data);
	static class UKuroSDKManager* Get();
	static void GetAdsValue(const class FString& income, const class FString& data);
	static class FString GetAgreementUrl();
	static class FString GetAppChannelId();
	static struct FBasicInfo GetBasicInfo();
	static class FString GetChannelId();
	static class FString GetChannelName();
	static struct FLoginStruct GetCurrentLoginInfo();
	static class FString GetDeepLinkStr();
	static bool GetIsAgreeProtocol();
	static class FString GetPackageId();
	static bool GetPostWebViewInitState();
	static class FString GetProjectId();
	static bool GetSdkInitState();
	static bool GetSdkIsQRScan();
	static bool GetSdkIsShowQuitTips();
	static class FString GetSdkLoginInfo();
	static class FString GetSdkParams(const class FString& data);
	static void GetSharePlatform();
	static void Initialize();
	static bool IsCustomerServiceEnable();
	static bool IsLogin();
	static bool IsUserCenterEnable();
	static void KuroSDKEvent(const EUKuroSDKEventType& iKuroSDKEvent, const class FString& sKuroSDKEventParameter);
	static void LogMarketingEvent(const class FString& data);
	static void OpenCustomerService(const class FString& data);
	static void OpenDefaultWebView(const class FString& url);
	static void OpenSdkQRScan();
	static void OpenWebView(const class FString& title, const class FString& url, bool isLandscape, bool transparent, bool webAccelerated, const class FString& identifier, const class FString& data);
	static void PostSplashScreenEndSuccess();
	static void QueryExternalAchievements();
	static void QueryProductInfo(const class FString& data);
	static void RequestPhotoPermission();
	static void RequestReviewApp(const class FString& data);
	static void SetCursor(const class FString& data);
	static void SetFont(const class FString& data);
	static void SetGamePadMode(bool mode);
	static void SetIfGlobalSdk(bool ifGlobal);
	static void SetWindowsMode(bool mode);
	static void Share(const TArray<uint8>& imageData, const class FString& sKuroSDKEventParameter);
	static void ShowExitGameDialog();
	static void ShowExternalLogin();
	static void ShowVirtualKeyboard(bool state);
	static void Start();
	static void UpdateChannelEvent(const class FString& data);
	static void WriteExternalAchievements(const class FString& data);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroSDKManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroSDKManager")
	}
	static class UKuroSDKManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroSDKManager>();
	}
};
DUMPER7_ASSERTS_UKuroSDKManager;

// Class KuroSDK.KuroSDKStaticLibrary
// 0x0000 (0x0030 - 0x0030)
class UKuroSDKStaticLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearSdkInstance();
	static class UKuroSDKManager* Get();
	static void GetAdsValue(const class FString& income, const class FString& data);
	static void GetAgreementUrl();
	static class FString GetAndroidGalleryExternalFilePath();
	static void GetAppChannelId();
	static void GetBaseDeviceInfo();
	static class FString GetChannelId();
	static void GetChannelName();
	static struct FLoginStruct GetCurrentLoginInfo();
	static bool GetIsAgreeProtocol();
	static bool GetPostWebViewInitState();
	static void GetProjectId();
	static void GetSdkParams(const class FString& data);
	static void Initialize();
	static void IsCanQRScan();
	static void IsShowQuitTips();
	static void KuroSDKEvent(const EUKuroSDKEventType& iKuroSDKEvent, const class FString& sKuroSDKEventParameter);
	static void LogMarketingEvent(const class FString& data);
	static void OpenCustomerService(const class FString& data);
	static void OpenDefaultWebView(const class FString& url);
	static void OpenQRScan();
	static void OpenWebView(const class FString& title, const class FString& url, bool isLandScape, bool transparent, bool webAccelerated, const class FString& identifier, const class FString& data);
	static void PostSplashSuccess();
	static void SetIfGlobalSdk(bool ifGlobal);
	static void Share(const class FString& imagePath, const class FString& sKuroSDKEventParameter);
	static void ShareTexture(const class FString& texturePath, const class FString& sKuroSDKEventParameter);
	static void ShowExitGameDialog();
	static void ShowVirtualKeyboard(bool state);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroSDKStaticLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroSDKStaticLibrary")
	}
	static class UKuroSDKStaticLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroSDKStaticLibrary>();
	}
};
DUMPER7_ASSERTS_UKuroSDKStaticLibrary;

}

