#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroInput

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KuroInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class KuroInput.BasePlayerController
// 0x0060 (0x06D0 - 0x0670)
class ABasePlayerController : public APlayerController
{
public:
	uint8                                         Pad_670[0x60];                                     // 0x0670(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void SetKuroForceFeedbackConfig(EGlobalKuroForceFeedbackType FeedbackConfig, int32 GlobalFeedbackCoef);
	static void SetUseSonyGamepadState(bool value);

	void AddActionBinding(const class FName& ActionName, const EInputEvent KeyEvent, class UObject* Object, const class FName& FuncName);
	void AddAxisBinding(const class FName& AxisName, class UObject* Object, const class FName& FuncName);
	void AddKeyBinding(const struct FInputChord& Chord, const EInputEvent KeyEvent, class UObject* Object, const class FName& FuncName);
	void AddTouchBinding(const EInputEvent KeyEvent, class UObject* Object, const class FName& FuncName);
	void ClearActionBindings();
	void ClearAxisBindings();
	void ClearKeyBindings();
	void ClearTouchBindings();
	void FlushPressedKeys();
	void OnReceivedPlayer();
	void PlayKuroForceFeedback(class UKuroForceFeedbackEffect* ForceFeedbackEffect, class FName Tag, bool bLooping, bool bIgnoreTimeDilation, bool bPlayWhilePaused);
	void ReceiveOnDeviceChanged();
	void ReceivePostProcessInput(const float DeltaTime, const bool bGamePaused);
	void ReceivePreProcessInput(const float DeltaTime, const bool bGamePaused);
	void ReceiveSetupInputComponent();
	void StopKuroForceFeedback(class UKuroForceFeedbackEffect* ForceFeedbackEffect, class FName Tag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BasePlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BasePlayerController")
	}
	static class ABasePlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABasePlayerController>();
	}
};
DUMPER7_ASSERTS_ABasePlayerController;

// Class KuroInput.KuroForceFeedbackEffect
// 0x0020 (0x0078 - 0x0058)
class UKuroForceFeedbackEffect final : public UForceFeedbackEffect
{
public:
	float                                         ColdDowm;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroForceFeedbackType                        Type;                                              // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Priority;                                          // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  KuroGuid;                                          // 0x0064(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroForceFeedbackEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroForceFeedbackEffect")
	}
	static class UKuroForceFeedbackEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroForceFeedbackEffect>();
	}
};
DUMPER7_ASSERTS_UKuroForceFeedbackEffect;

// Class KuroInput.KuroInputFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UKuroInputFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ApplyInputMode(class APlayerController* InPlayerController);
	static void ClearInputModeReply();
	static bool HasInputModeReply(const struct FInputModeReply& InputModeReply);
	static void ReplyInputMode(class APlayerController* InPlayerController, const struct FInputModeReply& InputModeReply);
	static void ResetInputMode(class APlayerController* InPlayerController);
	static struct FInputModeReply SetGameAndUIInputMode(class APlayerController* InPlayerController, const class FString& Reason, bool bLockMouseToViewport, bool bHideCursorDuringCapture);
	static struct FInputModeReply SetGameOnlyInputMode(class APlayerController* InPlayerController, const class FString& Reason);
	static struct FInputModeReply SetUIOnlyInputMode(class APlayerController* InPlayerController, const class FString& Reason, bool bLockMouseToViewport);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroInputFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroInputFunctionLibrary")
	}
	static class UKuroInputFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroInputFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UKuroInputFunctionLibrary;

// Class KuroInput.KuroInputSetting
// 0x0010 (0x0040 - 0x0030)
class UKuroInputSetting final : public UObject
{
public:
	EGlobalKuroForceFeedbackType                  FeedbackConfig;                                    // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GlobalFeedbackSize;                                // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUseSonyFeedback;                                 // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputMode                                    DefaultInputMode;                                  // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDefaultLockMouseToViewport;                      // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDefaultHideCursorDuringCapture;                  // 0x003B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPrintDebugLog;                                   // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroInputSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroInputSetting")
	}
	static class UKuroInputSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroInputSetting>();
	}
};
DUMPER7_ASSERTS_UKuroInputSetting;

}

