#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroSDK

#include "Basic.hpp"

#include "KuroSDK_structs.hpp"


namespace SDK::Params
{

// Function KuroSDK.KuroSDKManager.CallPlugin
// 0x0020 (0x0020 - 0x0000)
struct KuroSDKManager_CallPlugin final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_CallPlugin;

// Function KuroSDK.KuroSDKManager.CallPluginAsync
// 0x0040 (0x0040 - 0x0000)
struct KuroSDKManager_CallPluginAsync final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& Result)>  callback;                                          // 0x0010(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSDKManager_CallPluginAsync;

// Function KuroSDK.KuroSDKManager.CheckPhotoPermission
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_CheckPhotoPermission final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_CheckPhotoPermission;

// Function KuroSDK.KuroSDKManager.CloseWebView
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_CloseWebView final
{
public:
	class FString                                 identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_CloseWebView;

// Function KuroSDK.KuroSDKManager.DoInitSdkProcedure
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_DoInitSdkProcedure final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_DoInitSdkProcedure;

// Function KuroSDK.KuroSDKManager.FreePlugin
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_FreePlugin final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_FreePlugin;

// Function KuroSDK.KuroSDKManager.Get
// 0x0008 (0x0008 - 0x0000)
struct KuroSDKManager_Get final
{
public:
	class UKuroSDKManager*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_Get;

// Function KuroSDK.KuroSDKManager.GetAdsValue
// 0x0020 (0x0020 - 0x0000)
struct KuroSDKManager_GetAdsValue final
{
public:
	class FString                                 income;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 data;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetAdsValue;

// Function KuroSDK.KuroSDKManager.GetAgreementUrl
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_GetAgreementUrl final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetAgreementUrl;

// Function KuroSDK.KuroSDKManager.GetAppChannelId
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_GetAppChannelId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetAppChannelId;

// Function KuroSDK.KuroSDKManager.GetBasicInfo
// 0x0048 (0x0048 - 0x0000)
struct KuroSDKManager_GetBasicInfo final
{
public:
	struct FBasicInfo                             ReturnValue;                                       // 0x0000(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetBasicInfo;

// Function KuroSDK.KuroSDKManager.GetChannelId
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_GetChannelId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetChannelId;

// Function KuroSDK.KuroSDKManager.GetChannelName
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_GetChannelName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetChannelName;

// Function KuroSDK.KuroSDKManager.GetCurrentLoginInfo
// 0x0058 (0x0058 - 0x0000)
struct KuroSDKManager_GetCurrentLoginInfo final
{
public:
	struct FLoginStruct                           ReturnValue;                                       // 0x0000(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetCurrentLoginInfo;

// Function KuroSDK.KuroSDKManager.GetDeepLinkStr
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_GetDeepLinkStr final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetDeepLinkStr;

// Function KuroSDK.KuroSDKManager.GetIsAgreeProtocol
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_GetIsAgreeProtocol final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetIsAgreeProtocol;

// Function KuroSDK.KuroSDKManager.GetPackageId
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_GetPackageId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetPackageId;

// Function KuroSDK.KuroSDKManager.GetPostWebViewInitState
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_GetPostWebViewInitState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetPostWebViewInitState;

// Function KuroSDK.KuroSDKManager.GetProjectId
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_GetProjectId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetProjectId;

// Function KuroSDK.KuroSDKManager.GetSdkInitState
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_GetSdkInitState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetSdkInitState;

// Function KuroSDK.KuroSDKManager.GetSdkIsQRScan
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_GetSdkIsQRScan final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetSdkIsQRScan;

// Function KuroSDK.KuroSDKManager.GetSdkIsShowQuitTips
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_GetSdkIsShowQuitTips final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetSdkIsShowQuitTips;

// Function KuroSDK.KuroSDKManager.GetSdkLoginInfo
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_GetSdkLoginInfo final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetSdkLoginInfo;

// Function KuroSDK.KuroSDKManager.GetSdkParams
// 0x0020 (0x0020 - 0x0000)
struct KuroSDKManager_GetSdkParams final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_GetSdkParams;

// Function KuroSDK.KuroSDKManager.IsCustomerServiceEnable
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_IsCustomerServiceEnable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_IsCustomerServiceEnable;

// Function KuroSDK.KuroSDKManager.IsLogin
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_IsLogin final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_IsLogin;

// Function KuroSDK.KuroSDKManager.IsUserCenterEnable
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_IsUserCenterEnable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_IsUserCenterEnable;

// Function KuroSDK.KuroSDKManager.KuroSDKEvent
// 0x0018 (0x0018 - 0x0000)
struct KuroSDKManager_KuroSDKEvent final
{
public:
	EUKuroSDKEventType                            iKuroSDKEvent;                                     // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 sKuroSDKEventParameter;                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_KuroSDKEvent;

// Function KuroSDK.KuroSDKManager.LogMarketingEvent
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_LogMarketingEvent final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_LogMarketingEvent;

// Function KuroSDK.KuroSDKManager.OpenCustomerService
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_OpenCustomerService final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_OpenCustomerService;

// Function KuroSDK.KuroSDKManager.OpenDefaultWebView
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_OpenDefaultWebView final
{
public:
	class FString                                 url;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_OpenDefaultWebView;

// Function KuroSDK.KuroSDKManager.OpenWebView
// 0x0048 (0x0048 - 0x0000)
struct KuroSDKManager_OpenWebView final
{
public:
	class FString                                 title;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 url;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isLandscape;                                       // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          transparent;                                       // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          webAccelerated;                                    // 0x0022(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 identifier;                                        // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 data;                                              // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_OpenWebView;

// Function KuroSDK.KuroSDKManager.QueryProductInfo
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_QueryProductInfo final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_QueryProductInfo;

// Function KuroSDK.KuroSDKManager.RequestReviewApp
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_RequestReviewApp final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_RequestReviewApp;

// Function KuroSDK.KuroSDKManager.SetCursor
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_SetCursor final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_SetCursor;

// Function KuroSDK.KuroSDKManager.SetFont
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_SetFont final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_SetFont;

// Function KuroSDK.KuroSDKManager.SetGamePadMode
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_SetGamePadMode final
{
public:
	bool                                          mode;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_SetGamePadMode;

// Function KuroSDK.KuroSDKManager.SetIfGlobalSdk
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_SetIfGlobalSdk final
{
public:
	bool                                          ifGlobal;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_SetIfGlobalSdk;

// Function KuroSDK.KuroSDKManager.SetWindowsMode
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_SetWindowsMode final
{
public:
	bool                                          mode;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_SetWindowsMode;

// Function KuroSDK.KuroSDKManager.Share
// 0x0020 (0x0020 - 0x0000)
struct KuroSDKManager_Share final
{
public:
	TArray<uint8>                                 imageData;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 sKuroSDKEventParameter;                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_Share;

// Function KuroSDK.KuroSDKManager.ShowVirtualKeyboard
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKManager_ShowVirtualKeyboard final
{
public:
	bool                                          state;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_ShowVirtualKeyboard;

// Function KuroSDK.KuroSDKManager.UpdateChannelEvent
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_UpdateChannelEvent final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_UpdateChannelEvent;

// Function KuroSDK.KuroSDKManager.WriteExternalAchievements
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKManager_WriteExternalAchievements final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKManager_WriteExternalAchievements;

// Function KuroSDK.KuroSDKStaticLibrary.Get
// 0x0008 (0x0008 - 0x0000)
struct KuroSDKStaticLibrary_Get final
{
public:
	class UKuroSDKManager*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_Get;

// Function KuroSDK.KuroSDKStaticLibrary.GetAdsValue
// 0x0020 (0x0020 - 0x0000)
struct KuroSDKStaticLibrary_GetAdsValue final
{
public:
	class FString                                 income;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 data;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_GetAdsValue;

// Function KuroSDK.KuroSDKStaticLibrary.GetAndroidGalleryExternalFilePath
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKStaticLibrary_GetAndroidGalleryExternalFilePath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_GetAndroidGalleryExternalFilePath;

// Function KuroSDK.KuroSDKStaticLibrary.GetChannelId
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKStaticLibrary_GetChannelId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_GetChannelId;

// Function KuroSDK.KuroSDKStaticLibrary.GetCurrentLoginInfo
// 0x0058 (0x0058 - 0x0000)
struct KuroSDKStaticLibrary_GetCurrentLoginInfo final
{
public:
	struct FLoginStruct                           ReturnValue;                                       // 0x0000(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_GetCurrentLoginInfo;

// Function KuroSDK.KuroSDKStaticLibrary.GetIsAgreeProtocol
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKStaticLibrary_GetIsAgreeProtocol final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_GetIsAgreeProtocol;

// Function KuroSDK.KuroSDKStaticLibrary.GetPostWebViewInitState
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKStaticLibrary_GetPostWebViewInitState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_GetPostWebViewInitState;

// Function KuroSDK.KuroSDKStaticLibrary.GetSdkParams
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKStaticLibrary_GetSdkParams final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_GetSdkParams;

// Function KuroSDK.KuroSDKStaticLibrary.KuroSDKEvent
// 0x0018 (0x0018 - 0x0000)
struct KuroSDKStaticLibrary_KuroSDKEvent final
{
public:
	EUKuroSDKEventType                            iKuroSDKEvent;                                     // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 sKuroSDKEventParameter;                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_KuroSDKEvent;

// Function KuroSDK.KuroSDKStaticLibrary.LogMarketingEvent
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKStaticLibrary_LogMarketingEvent final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_LogMarketingEvent;

// Function KuroSDK.KuroSDKStaticLibrary.OpenCustomerService
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKStaticLibrary_OpenCustomerService final
{
public:
	class FString                                 data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_OpenCustomerService;

// Function KuroSDK.KuroSDKStaticLibrary.OpenDefaultWebView
// 0x0010 (0x0010 - 0x0000)
struct KuroSDKStaticLibrary_OpenDefaultWebView final
{
public:
	class FString                                 url;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_OpenDefaultWebView;

// Function KuroSDK.KuroSDKStaticLibrary.OpenWebView
// 0x0048 (0x0048 - 0x0000)
struct KuroSDKStaticLibrary_OpenWebView final
{
public:
	class FString                                 title;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 url;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isLandScape;                                       // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          transparent;                                       // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          webAccelerated;                                    // 0x0022(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 identifier;                                        // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 data;                                              // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_OpenWebView;

// Function KuroSDK.KuroSDKStaticLibrary.SetIfGlobalSdk
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKStaticLibrary_SetIfGlobalSdk final
{
public:
	bool                                          ifGlobal;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_SetIfGlobalSdk;

// Function KuroSDK.KuroSDKStaticLibrary.Share
// 0x0020 (0x0020 - 0x0000)
struct KuroSDKStaticLibrary_Share final
{
public:
	class FString                                 imagePath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 sKuroSDKEventParameter;                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_Share;

// Function KuroSDK.KuroSDKStaticLibrary.ShareTexture
// 0x0020 (0x0020 - 0x0000)
struct KuroSDKStaticLibrary_ShareTexture final
{
public:
	class FString                                 texturePath;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 sKuroSDKEventParameter;                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_ShareTexture;

// Function KuroSDK.KuroSDKStaticLibrary.ShowVirtualKeyboard
// 0x0001 (0x0001 - 0x0000)
struct KuroSDKStaticLibrary_ShowVirtualKeyboard final
{
public:
	bool                                          state;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSDKStaticLibrary_ShowVirtualKeyboard;

}

