#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroNavMeshCookData

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class KuroNavMeshCookData.NavMeshCookDataSubsystem
// 0x0050 (0x0088 - 0x0038)
class UNavMeshCookDataSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool D_MultiQueryNavBoundaryEdges(const TArray<struct FBox>& QueryBoundsArr);
	bool D_QueryNavBoundaryEdges(const struct FBox& QueryBounds, TArray<struct FVectorDouble>* OutBoundaryEdgesDouble);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavMeshCookDataSubsystem">();
	}
	static class UNavMeshCookDataSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavMeshCookDataSubsystem>();
	}
};
static_assert(alignof(UNavMeshCookDataSubsystem) == 0x000008, "Wrong alignment on UNavMeshCookDataSubsystem");
static_assert(sizeof(UNavMeshCookDataSubsystem) == 0x000088, "Wrong size on UNavMeshCookDataSubsystem");

// Class KuroNavMeshCookData.NavEdgesExportVolume
// 0x0000 (0x02E8 - 0x02E8)
class ANavEdgesExportVolume final : public AVolume
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavEdgesExportVolume">();
	}
	static class ANavEdgesExportVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANavEdgesExportVolume>();
	}
};
static_assert(alignof(ANavEdgesExportVolume) == 0x000008, "Wrong alignment on ANavEdgesExportVolume");
static_assert(sizeof(ANavEdgesExportVolume) == 0x0002E8, "Wrong size on ANavEdgesExportVolume");

// Class KuroNavMeshCookData.NavMeshEdgesActor
// 0x0000 (0x02B0 - 0x02B0)
class ANavMeshEdgesActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavMeshEdgesActor">();
	}
	static class ANavMeshEdgesActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANavMeshEdgesActor>();
	}
};
static_assert(alignof(ANavMeshEdgesActor) == 0x000008, "Wrong alignment on ANavMeshEdgesActor");
static_assert(sizeof(ANavMeshEdgesActor) == 0x0002B0, "Wrong size on ANavMeshEdgesActor");

// Class KuroNavMeshCookData.NavMeshEdgesComponent
// 0x0060 (0x0120 - 0x00C0)
class UNavMeshEdgesComponent final : public UActorComponent
{
public:
	float                                         TileSizeUU;                                        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NavMeshOrig;                                       // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x50];                                      // 0x00D0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavMeshEdgesComponent">();
	}
	static class UNavMeshEdgesComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavMeshEdgesComponent>();
	}
};
static_assert(alignof(UNavMeshEdgesComponent) == 0x000008, "Wrong alignment on UNavMeshEdgesComponent");
static_assert(sizeof(UNavMeshEdgesComponent) == 0x000120, "Wrong size on UNavMeshEdgesComponent");
static_assert(offsetof(UNavMeshEdgesComponent, TileSizeUU) == 0x0000C0, "Member 'UNavMeshEdgesComponent::TileSizeUU' has a wrong offset!");
static_assert(offsetof(UNavMeshEdgesComponent, NavMeshOrig) == 0x0000C4, "Member 'UNavMeshEdgesComponent::NavMeshOrig' has a wrong offset!");

}

