#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroSceneModifier

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "KuroSceneModifier_structs.hpp"


namespace SDK
{

// Class KuroSceneModifier.KuroSceneMatModifyDataAsset
// 0x0060 (0x0098 - 0x0038)
class UKuroSceneMatModifyDataAsset final : public UPrimaryDataAsset
{
public:
	TArray<struct FKuroSceneMatModifyData>        MatModifyData;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x50];                                      // 0x0048(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroSceneMatModifyDataAsset">();
	}
	static class UKuroSceneMatModifyDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroSceneMatModifyDataAsset>();
	}
};
static_assert(alignof(UKuroSceneMatModifyDataAsset) == 0x000008, "Wrong alignment on UKuroSceneMatModifyDataAsset");
static_assert(sizeof(UKuroSceneMatModifyDataAsset) == 0x000098, "Wrong size on UKuroSceneMatModifyDataAsset");
static_assert(offsetof(UKuroSceneMatModifyDataAsset, MatModifyData) == 0x000038, "Member 'UKuroSceneMatModifyDataAsset::MatModifyData' has a wrong offset!");

// Class KuroSceneModifier.KuroSceneModifierSubsystem
// 0x0118 (0x0150 - 0x0038)
class alignas(0x10) UKuroSceneModifierSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FKuroSceneModifierDataState> ConsideredDataLayers;                      // 0x0040(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x50];                                      // 0x0090(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FKuroSceneModifierEntry> AllModifiedLevels;                             // 0x00E0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_130[0x20];                                     // 0x0130(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ModifyMaterialsByDataLayer(const TSet<class FName>& InDataLayers, const class UKuroSceneMatModifyDataAsset* InMatDataAsset, bool bVisibleBeforeModify);
	void ResetMaterialsByDataLayer(const TSet<class FName>& InDataLayers);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroSceneModifierSubsystem">();
	}
	static class UKuroSceneModifierSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroSceneModifierSubsystem>();
	}
};
static_assert(alignof(UKuroSceneModifierSubsystem) == 0x000010, "Wrong alignment on UKuroSceneModifierSubsystem");
static_assert(sizeof(UKuroSceneModifierSubsystem) == 0x000150, "Wrong size on UKuroSceneModifierSubsystem");
static_assert(offsetof(UKuroSceneModifierSubsystem, ConsideredDataLayers) == 0x000040, "Member 'UKuroSceneModifierSubsystem::ConsideredDataLayers' has a wrong offset!");
static_assert(offsetof(UKuroSceneModifierSubsystem, AllModifiedLevels) == 0x0000E0, "Member 'UKuroSceneModifierSubsystem::AllModifiedLevels' has a wrong offset!");

}

