#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// Enum KuroAnim.ECombineCurveMode
// NumValues: 0x0005
enum class ECombineCurveMode : uint8
{
	Replenish                                = 0,
	Accumulate                               = 1,
	Override                                 = 2,
	CleanAndOverride                         = 3,
	ECombineCurveMode_MAX                    = 4,
};

// Enum KuroAnim.ECollisionType
// NumValues: 0x0006
enum class ECollisionType : uint8
{
	None                                     = 0,
	Spherical                                = 1,
	Cylinder                                 = 2,
	Capsule                                  = 3,
	Planar                                   = 4,
	ECollisionType_MAX                       = 5,
};

// Enum KuroAnim.EClothType
// NumValues: 0x0004
enum class EClothType : uint8
{
	Line                                     = 0,
	Cloth                                    = 1,
	Dress                                    = 2,
	EClothType_MAX                           = 3,
};

// Enum KuroAnim.EAdjustBoxType
// NumValues: 0x0003
enum class EAdjustBoxType : uint8
{
	OpenMode                                 = 0,
	AlwaysVertical                           = 1,
	EAdjustBoxType_MAX                       = 2,
};

// Enum KuroAnim.EAdjustCapsuleType
// NumValues: 0x0004
enum class EAdjustCapsuleType : uint8
{
	OpenMode                                 = 0,
	ThreeDimension                           = 1,
	AlwaysVertical                           = 2,
	EAdjustCapsuleType_MAX                   = 3,
};

// Enum KuroAnim.EIKPartType
// NumValues: 0x0006
enum class EIKPartType : uint8
{
	None                                     = 0,
	LeftLeg                                  = 1,
	RightLeg                                 = 2,
	LeftArm                                  = 3,
	RightArm                                 = 4,
	EIKPartType_MAX                          = 5,
};

// Enum KuroAnim.EStandTurnType
// NumValues: 0x0004
enum class EStandTurnType : uint8
{
	None                                     = 0,
	Left                                     = 1,
	Right                                    = 2,
	EStandTurnType_MAX                       = 3,
};

// Enum KuroAnim.EBeHitAnim
// NumValues: 0x000D
enum class EBeHitAnim : uint8
{
	LightLeft                                = 0,
	LightRight                               = 1,
	HeavyLeft                                = 2,
	HeavyRight                               = 3,
	KnockUp                                  = 4,
	KnockDown                                = 5,
	Suppress                                 = 6,
	Rebound                                  = 7,
	LightFront                               = 8,
	LightBack                                = 9,
	HeavyFront                               = 10,
	HeavyBack                                = 11,
	EBeHitAnim_MAX                           = 12,
};

// Enum KuroAnim.EWalkPosture
// NumValues: 0x0003
enum class EWalkPosture : uint8
{
	Walk                                     = 0,
	Run                                      = 1,
	EWalkPosture_MAX                         = 2,
};

// Enum KuroAnim.EMoveDirection
// NumValues: 0x0006
enum class EMoveDirection : uint8
{
	Forward                                  = 0,
	Backward                                 = 1,
	Left                                     = 2,
	Right                                    = 3,
	Stop                                     = 4,
	EMoveDirection_MAX                       = 5,
};

// Enum KuroAnim.EExitClimbType
// NumValues: 0x000C
enum class EExitClimbType : uint8
{
	Leave                                    = 0,
	Water                                    = 1,
	Top                                      = 2,
	Bottom                                   = 3,
	Jump                                     = 4,
	Unknown                                  = 5,
	Sprint                                   = 6,
	Vault                                    = 7,
	SprintVaultFar                           = 8,
	SprintVaultNear                          = 9,
	BlockUp                                  = 10,
	EExitClimbType_MAX                       = 11,
};

// Enum KuroAnim.EEnterClimbType
// NumValues: 0x0006
enum class EEnterClimbType : uint8
{
	Air                                      = 0,
	Water                                    = 1,
	Ground                                   = 2,
	Down                                     = 3,
	Skill                                    = 4,
	EEnterClimbType_MAX                      = 5,
};

// Enum KuroAnim.EClimbStateType
// NumValues: 0x0005
enum class EClimbStateType : uint8
{
	None                                     = 0,
	EnterClimb                               = 1,
	Climbing                                 = 2,
	ExitClimb                                = 3,
	EClimbStateType_MAX                      = 4,
};

// Enum KuroAnim.ESwingStateType
// NumValues: 0x0006
enum class ESwingStateType : uint8
{
	None                                     = 0,
	EnterSwing                               = 1,
	LoopSwing                                = 2,
	LeftLoopSwing                            = 3,
	ExitSwing                                = 4,
	ESwingStateType_MAX                      = 5,
};

// Enum KuroAnim.ECharViewDirectionStateType
// NumValues: 0x0006
enum class ECharViewDirectionStateType : uint8
{
	LockDirection                            = 0,
	AimDirection                             = 1,
	FaceDirection                            = 2,
	LookAtDirection                          = 3,
	CameraDirection                          = 4,
	ECharViewDirectionStateType_MAX          = 5,
};

// Enum KuroAnim.ECharMoveStateType
// NumValues: 0x0022
enum class ECharMoveStateType : uint8
{
	Other                                    = 0,
	Stand                                    = 1,
	Walk                                     = 2,
	WalkStop                                 = 3,
	Run                                      = 4,
	RunStop                                  = 5,
	Sprint                                   = 6,
	SprintStop                               = 7,
	Dodge                                    = 8,
	LandRoll                                 = 9,
	KnockDown                                = 10,
	Parry                                    = 11,
	SoftKnock                                = 12,
	HeavyKnock                               = 13,
	NormalClimb                              = 14,
	FastClimb                                = 15,
	Glide                                    = 16,
	KnockUp                                  = 17,
	FastSwim                                 = 18,
	NormalSwim                               = 19,
	Swing                                    = 20,
	Captured                                 = 21,
	Slide                                    = 22,
	Flying                                   = 23,
	EnterClimb                               = 24,
	ExitClimb                                = 25,
	NormalSki                                = 26,
	StandUp                                  = 27,
	Soar                                     = 28,
	Roll                                     = 29,
	Kite                                     = 30,
	Gongduola                                = 31,
	NpcVehicle                               = 32,
	ECharMoveStateType_MAX                   = 33,
};

// Enum KuroAnim.ECharPositionStateType
// NumValues: 0x0007
enum class ECharPositionStateType : uint8
{
	Ground                                   = 0,
	Climb                                    = 1,
	Air                                      = 2,
	Water                                    = 3,
	Ski                                      = 4,
	Ride                                     = 5,
	ECharPositionStateType_MAX               = 6,
};

// Enum KuroAnim.EUpdateInfoFunction
// NumValues: 0x0004
enum class EUpdateInfoFunction : uint8
{
	Default                                  = 0,
	Monster                                  = 1,
	Npc                                      = 2,
	EUpdateInfoFunction_MAX                  = 3,
};

// Enum KuroAnim.SightLockTurnMode
// NumValues: 0x0003
enum class ESightLockTurnMode : uint8
{
	ZFirst                                   = 0,
	XFirst                                   = 1,
	SightLockTurnMode_MAX                    = 2,
};

// Enum KuroAnim.SightLockMode
// NumValues: 0x0005
enum class ESightLockMode : uint8
{
	None                                     = 0,
	SightBoneFirst                           = 1,
	Ratio                                    = 2,
	Shooting                                 = 3,
	SightLockMode_MAX                        = 4,
};

// Enum KuroAnim.EndBoneIKMode
// NumValues: 0x0005
enum class EndBoneIKMode : uint8
{
	None                                     = 0,
	AxisModeLockX                            = 1,
	AxisModeLockY                            = 2,
	FullRotationMode                         = 3,
	EndBoneIKMode_MAX                        = 4,
};

// Enum KuroAnim.KuroAnimIKMode
// NumValues: 0x0004
enum class EKuroAnimIKMode : uint8
{
	DeltaPositionMode                        = 0,
	LocalPositionMode                        = 1,
	DeltaPositionFromCurveMode               = 2,
	KuroAnimIKMode_MAX                       = 3,
};

// Enum KuroAnim.KuroHumanIKMode
// NumValues: 0x0006
enum class EKuroHumanIKMode : uint8
{
	None                                     = 0,
	GroundMode                               = 1,
	ClimbMode                                = 2,
	SlideMode                                = 3,
	RideMode                                 = 4,
	KuroHumanIKMode_MAX                      = 5,
};

// ScriptStruct KuroAnim.BoneBlock
// 0x0060 (0x0060 - 0x0000)
struct FBoneBlock final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int32, float>                            Link;                                              // 0x0010(0x0050)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBoneBlock) == 0x000008, "Wrong alignment on FBoneBlock");
static_assert(sizeof(FBoneBlock) == 0x000060, "Wrong size on FBoneBlock");
static_assert(offsetof(FBoneBlock, Groups) == 0x000000, "Member 'FBoneBlock::Groups' has a wrong offset!");
static_assert(offsetof(FBoneBlock, Link) == 0x000010, "Member 'FBoneBlock::Link' has a wrong offset!");

// ScriptStruct KuroAnim.SpecialBoneShakeData
// 0x0018 (0x0018 - 0x0000)
struct FSpecialBoneShakeData final
{
public:
	TArray<class FName>                           Groups;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Influence;                                         // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShakeTime;                                         // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSpecialBoneShakeData) == 0x000008, "Wrong alignment on FSpecialBoneShakeData");
static_assert(sizeof(FSpecialBoneShakeData) == 0x000018, "Wrong size on FSpecialBoneShakeData");
static_assert(offsetof(FSpecialBoneShakeData, Groups) == 0x000000, "Member 'FSpecialBoneShakeData::Groups' has a wrong offset!");
static_assert(offsetof(FSpecialBoneShakeData, Influence) == 0x000010, "Member 'FSpecialBoneShakeData::Influence' has a wrong offset!");
static_assert(offsetof(FSpecialBoneShakeData, ShakeTime) == 0x000014, "Member 'FSpecialBoneShakeData::ShakeTime' has a wrong offset!");

// ScriptStruct KuroAnim.SkeletonGroup
// 0x0020 (0x0020 - 0x0000)
struct FSkeletonGroup final
{
public:
	TArray<struct FBoneBlock>                     Blocks;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSpecialBoneShakeData>          SpeicalBoneShakeData;                              // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSkeletonGroup) == 0x000008, "Wrong alignment on FSkeletonGroup");
static_assert(sizeof(FSkeletonGroup) == 0x000020, "Wrong size on FSkeletonGroup");
static_assert(offsetof(FSkeletonGroup, Blocks) == 0x000000, "Member 'FSkeletonGroup::Blocks' has a wrong offset!");
static_assert(offsetof(FSkeletonGroup, SpeicalBoneShakeData) == 0x000010, "Member 'FSkeletonGroup::SpeicalBoneShakeData' has a wrong offset!");

// ScriptStruct KuroAnim.HitBones
// 0x0010 (0x0010 - 0x0000)
struct FHitBones final
{
public:
	TArray<class FName>                           Bones;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHitBones) == 0x000008, "Wrong alignment on FHitBones");
static_assert(sizeof(FHitBones) == 0x000010, "Wrong size on FHitBones");
static_assert(offsetof(FHitBones, Bones) == 0x000000, "Member 'FHitBones::Bones' has a wrong offset!");

// ScriptStruct KuroAnim.AnimNode_Feedback
// 0x0190 (0x0278 - 0x00E8)
struct FAnimNode_Feedback final : public FAnimNode_SkeletalControlBase
{
public:
	struct FSkeletonGroup                         SkeletonBlockInfo;                                 // 0x00E8(0x0020)(Edit, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnitTime;                                          // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Hit;                                               // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NotEffectToChild;                                  // 0x0111(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShakeRate;                                         // 0x0114(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitBones                              HitBoneNames;                                      // 0x0118(0x0010)(Edit, NativeAccessSpecifierPublic)
	class UCurveFloat*                            Curve;                                             // 0x0128(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0130(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x147];                                    // 0x0131(0x0147)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_Feedback) == 0x000008, "Wrong alignment on FAnimNode_Feedback");
static_assert(sizeof(FAnimNode_Feedback) == 0x000278, "Wrong size on FAnimNode_Feedback");
static_assert(offsetof(FAnimNode_Feedback, SkeletonBlockInfo) == 0x0000E8, "Member 'FAnimNode_Feedback::SkeletonBlockInfo' has a wrong offset!");
static_assert(offsetof(FAnimNode_Feedback, DeltaTime) == 0x000108, "Member 'FAnimNode_Feedback::DeltaTime' has a wrong offset!");
static_assert(offsetof(FAnimNode_Feedback, UnitTime) == 0x00010C, "Member 'FAnimNode_Feedback::UnitTime' has a wrong offset!");
static_assert(offsetof(FAnimNode_Feedback, Hit) == 0x000110, "Member 'FAnimNode_Feedback::Hit' has a wrong offset!");
static_assert(offsetof(FAnimNode_Feedback, NotEffectToChild) == 0x000111, "Member 'FAnimNode_Feedback::NotEffectToChild' has a wrong offset!");
static_assert(offsetof(FAnimNode_Feedback, ShakeRate) == 0x000114, "Member 'FAnimNode_Feedback::ShakeRate' has a wrong offset!");
static_assert(offsetof(FAnimNode_Feedback, HitBoneNames) == 0x000118, "Member 'FAnimNode_Feedback::HitBoneNames' has a wrong offset!");
static_assert(offsetof(FAnimNode_Feedback, Curve) == 0x000128, "Member 'FAnimNode_Feedback::Curve' has a wrong offset!");
static_assert(offsetof(FAnimNode_Feedback, bDebug) == 0x000130, "Member 'FAnimNode_Feedback::bDebug' has a wrong offset!");

// ScriptStruct KuroAnim.AdditiveBlendAlpha
// 0x000C (0x000C - 0x0000)
struct FAdditiveBlendAlpha final
{
public:
	float                                         MeshSpaceAlpha;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AdditiveAlpha;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverlayAlpha;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAdditiveBlendAlpha) == 0x000004, "Wrong alignment on FAdditiveBlendAlpha");
static_assert(sizeof(FAdditiveBlendAlpha) == 0x00000C, "Wrong size on FAdditiveBlendAlpha");
static_assert(offsetof(FAdditiveBlendAlpha, MeshSpaceAlpha) == 0x000000, "Member 'FAdditiveBlendAlpha::MeshSpaceAlpha' has a wrong offset!");
static_assert(offsetof(FAdditiveBlendAlpha, AdditiveAlpha) == 0x000004, "Member 'FAdditiveBlendAlpha::AdditiveAlpha' has a wrong offset!");
static_assert(offsetof(FAdditiveBlendAlpha, OverlayAlpha) == 0x000008, "Member 'FAdditiveBlendAlpha::OverlayAlpha' has a wrong offset!");

// ScriptStruct KuroAnim.BranchBlendFilter
// 0x0018 (0x0018 - 0x0000)
struct FBranchBlendFilter final
{
public:
	struct FBoneReference                         BoneConfig;                                        // 0x0000(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         BlendDepth;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBranchBlendFilter) == 0x000004, "Wrong alignment on FBranchBlendFilter");
static_assert(sizeof(FBranchBlendFilter) == 0x000018, "Wrong size on FBranchBlendFilter");
static_assert(offsetof(FBranchBlendFilter, BoneConfig) == 0x000000, "Member 'FBranchBlendFilter::BoneConfig' has a wrong offset!");
static_assert(offsetof(FBranchBlendFilter, BlendDepth) == 0x000014, "Member 'FBranchBlendFilter::BlendDepth' has a wrong offset!");

// ScriptStruct KuroAnim.MaskLayer
// 0x0010 (0x0010 - 0x0000)
struct FMaskLayer final
{
public:
	TArray<struct FBranchBlendFilter>             MaskLayer;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMaskLayer) == 0x000008, "Wrong alignment on FMaskLayer");
static_assert(sizeof(FMaskLayer) == 0x000010, "Wrong size on FMaskLayer");
static_assert(offsetof(FMaskLayer, MaskLayer) == 0x000000, "Member 'FMaskLayer::MaskLayer' has a wrong offset!");

// ScriptStruct KuroAnim.AnimNode_AdditiveBoneBlend
// 0x01A8 (0x01B8 - 0x0010)
struct FAnimNode_AdditiveBoneBlend final : public FAnimNode_Base
{
public:
	struct FPoseLink                              BaseLayer;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              OverlayLayer;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              AdditiveBasePose;                                  // 0x0030(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FAdditiveBlendAlpha>            AdditiveBlendAlpha;                                // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bMeshSpaceAdd;                                     // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMaskLayer>                     LayerSetup;                                        // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChestBlendDepth;                                   // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBoneReference>                 SupperotBoneConfigs;                               // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, int32>                      SpecialCurves;                                     // 0x0088(0x0050)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0xE0];                                      // 0x00D8(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_AdditiveBoneBlend) == 0x000008, "Wrong alignment on FAnimNode_AdditiveBoneBlend");
static_assert(sizeof(FAnimNode_AdditiveBoneBlend) == 0x0001B8, "Wrong size on FAnimNode_AdditiveBoneBlend");
static_assert(offsetof(FAnimNode_AdditiveBoneBlend, BaseLayer) == 0x000010, "Member 'FAnimNode_AdditiveBoneBlend::BaseLayer' has a wrong offset!");
static_assert(offsetof(FAnimNode_AdditiveBoneBlend, OverlayLayer) == 0x000020, "Member 'FAnimNode_AdditiveBoneBlend::OverlayLayer' has a wrong offset!");
static_assert(offsetof(FAnimNode_AdditiveBoneBlend, AdditiveBasePose) == 0x000030, "Member 'FAnimNode_AdditiveBoneBlend::AdditiveBasePose' has a wrong offset!");
static_assert(offsetof(FAnimNode_AdditiveBoneBlend, AdditiveBlendAlpha) == 0x000040, "Member 'FAnimNode_AdditiveBoneBlend::AdditiveBlendAlpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_AdditiveBoneBlend, bMeshSpaceAdd) == 0x000050, "Member 'FAnimNode_AdditiveBoneBlend::bMeshSpaceAdd' has a wrong offset!");
static_assert(offsetof(FAnimNode_AdditiveBoneBlend, LayerSetup) == 0x000058, "Member 'FAnimNode_AdditiveBoneBlend::LayerSetup' has a wrong offset!");
static_assert(offsetof(FAnimNode_AdditiveBoneBlend, Alpha) == 0x000068, "Member 'FAnimNode_AdditiveBoneBlend::Alpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_AdditiveBoneBlend, ChestBlendDepth) == 0x00006C, "Member 'FAnimNode_AdditiveBoneBlend::ChestBlendDepth' has a wrong offset!");
static_assert(offsetof(FAnimNode_AdditiveBoneBlend, bDebug) == 0x000070, "Member 'FAnimNode_AdditiveBoneBlend::bDebug' has a wrong offset!");
static_assert(offsetof(FAnimNode_AdditiveBoneBlend, SupperotBoneConfigs) == 0x000078, "Member 'FAnimNode_AdditiveBoneBlend::SupperotBoneConfigs' has a wrong offset!");
static_assert(offsetof(FAnimNode_AdditiveBoneBlend, SpecialCurves) == 0x000088, "Member 'FAnimNode_AdditiveBoneBlend::SpecialCurves' has a wrong offset!");

// ScriptStruct KuroAnim.AnimNode_BoneRotateToLocation
// 0x0050 (0x0138 - 0x00E8)
struct FAnimNode_BoneRotateToLocation final : public FAnimNode_SkeletalControlBase
{
public:
	class FName                                   BoneName;                                          // 0x00E8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnAngle;                                         // 0x00F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookUpAngle;                                       // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ForwardLocation;                                   // 0x00FC(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TurnLimit;                                         // 0x0108(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LookUpLimit;                                       // 0x0110(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookUpOffset;                                      // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnUpOffset;                                      // 0x011C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRollBackToOrigin;                                 // 0x0120(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopRoll;                                         // 0x0121(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0122(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_123[0x15];                                     // 0x0123(0x0015)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_BoneRotateToLocation) == 0x000008, "Wrong alignment on FAnimNode_BoneRotateToLocation");
static_assert(sizeof(FAnimNode_BoneRotateToLocation) == 0x000138, "Wrong size on FAnimNode_BoneRotateToLocation");
static_assert(offsetof(FAnimNode_BoneRotateToLocation, BoneName) == 0x0000E8, "Member 'FAnimNode_BoneRotateToLocation::BoneName' has a wrong offset!");
static_assert(offsetof(FAnimNode_BoneRotateToLocation, TurnAngle) == 0x0000F4, "Member 'FAnimNode_BoneRotateToLocation::TurnAngle' has a wrong offset!");
static_assert(offsetof(FAnimNode_BoneRotateToLocation, LookUpAngle) == 0x0000F8, "Member 'FAnimNode_BoneRotateToLocation::LookUpAngle' has a wrong offset!");
static_assert(offsetof(FAnimNode_BoneRotateToLocation, ForwardLocation) == 0x0000FC, "Member 'FAnimNode_BoneRotateToLocation::ForwardLocation' has a wrong offset!");
static_assert(offsetof(FAnimNode_BoneRotateToLocation, TurnLimit) == 0x000108, "Member 'FAnimNode_BoneRotateToLocation::TurnLimit' has a wrong offset!");
static_assert(offsetof(FAnimNode_BoneRotateToLocation, LookUpLimit) == 0x000110, "Member 'FAnimNode_BoneRotateToLocation::LookUpLimit' has a wrong offset!");
static_assert(offsetof(FAnimNode_BoneRotateToLocation, LookUpOffset) == 0x000118, "Member 'FAnimNode_BoneRotateToLocation::LookUpOffset' has a wrong offset!");
static_assert(offsetof(FAnimNode_BoneRotateToLocation, TurnUpOffset) == 0x00011C, "Member 'FAnimNode_BoneRotateToLocation::TurnUpOffset' has a wrong offset!");
static_assert(offsetof(FAnimNode_BoneRotateToLocation, bRollBackToOrigin) == 0x000120, "Member 'FAnimNode_BoneRotateToLocation::bRollBackToOrigin' has a wrong offset!");
static_assert(offsetof(FAnimNode_BoneRotateToLocation, bStopRoll) == 0x000121, "Member 'FAnimNode_BoneRotateToLocation::bStopRoll' has a wrong offset!");
static_assert(offsetof(FAnimNode_BoneRotateToLocation, bDebug) == 0x000122, "Member 'FAnimNode_BoneRotateToLocation::bDebug' has a wrong offset!");

// ScriptStruct KuroAnim.AnimNode_CombineCurves
// 0x0050 (0x0060 - 0x0010)
struct FAnimNode_CombineCurves final : public FAnimNode_Base
{
public:
	struct FPoseLink                              Base;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FPoseLink                              CurveAnim;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	ECombineCurveMode                             CombineMode;                                       // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Alpha;                                             // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   CleanAlphaCurveName;                               // 0x0038(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CleanCurves;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_CombineCurves) == 0x000008, "Wrong alignment on FAnimNode_CombineCurves");
static_assert(sizeof(FAnimNode_CombineCurves) == 0x000060, "Wrong size on FAnimNode_CombineCurves");
static_assert(offsetof(FAnimNode_CombineCurves, Base) == 0x000010, "Member 'FAnimNode_CombineCurves::Base' has a wrong offset!");
static_assert(offsetof(FAnimNode_CombineCurves, CurveAnim) == 0x000020, "Member 'FAnimNode_CombineCurves::CurveAnim' has a wrong offset!");
static_assert(offsetof(FAnimNode_CombineCurves, CombineMode) == 0x000030, "Member 'FAnimNode_CombineCurves::CombineMode' has a wrong offset!");
static_assert(offsetof(FAnimNode_CombineCurves, Alpha) == 0x000034, "Member 'FAnimNode_CombineCurves::Alpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_CombineCurves, CleanAlphaCurveName) == 0x000038, "Member 'FAnimNode_CombineCurves::CleanAlphaCurveName' has a wrong offset!");
static_assert(offsetof(FAnimNode_CombineCurves, CleanCurves) == 0x000048, "Member 'FAnimNode_CombineCurves::CleanCurves' has a wrong offset!");

// ScriptStruct KuroAnim.AnimNode_ExtraFollowAnims
// 0x0D50 (0x0D60 - 0x0010)
struct alignas(0x10) FAnimNode_ExtraFollowAnims final : public FAnimNode_Base
{
public:
	class FName                                   DefaultSequenceName;                               // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InternalTimeAccumulator;                           // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAllAnims;                                      // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0xD3F];                                     // 0x0021(0x0D3F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_ExtraFollowAnims) == 0x000010, "Wrong alignment on FAnimNode_ExtraFollowAnims");
static_assert(sizeof(FAnimNode_ExtraFollowAnims) == 0x000D60, "Wrong size on FAnimNode_ExtraFollowAnims");
static_assert(offsetof(FAnimNode_ExtraFollowAnims, DefaultSequenceName) == 0x000010, "Member 'FAnimNode_ExtraFollowAnims::DefaultSequenceName' has a wrong offset!");
static_assert(offsetof(FAnimNode_ExtraFollowAnims, InternalTimeAccumulator) == 0x00001C, "Member 'FAnimNode_ExtraFollowAnims::InternalTimeAccumulator' has a wrong offset!");
static_assert(offsetof(FAnimNode_ExtraFollowAnims, bUseAllAnims) == 0x000020, "Member 'FAnimNode_ExtraFollowAnims::bUseAllAnims' has a wrong offset!");

// ScriptStruct KuroAnim.AnimNode_FeedbackRotate
// 0x0238 (0x0320 - 0x00E8)
struct FAnimNode_FeedbackRotate final : public FAnimNode_SkeletalControlBase
{
public:
	TArray<struct FBoneReference>                 BeginBones;                                        // 0x00E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 EndBones;                                          // 0x00F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 WeakenBones;                                       // 0x0108(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         RootBone;                                          // 0x0118(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MaxTurnAngle;                                      // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weaken;                                            // 0x0130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RecoveryWeaken;                                    // 0x0134(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDistance;                                       // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x013C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimChangeOptizimeParameter;                       // 0x0140(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NewHit;                                            // 0x0144(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitPos;                                            // 0x0148(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitVector;                                         // 0x0154(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FeedbackTimeLength;                                // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Curve;                                             // 0x0168(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_170[0x1B0];                                    // 0x0170(0x01B0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_FeedbackRotate) == 0x000008, "Wrong alignment on FAnimNode_FeedbackRotate");
static_assert(sizeof(FAnimNode_FeedbackRotate) == 0x000320, "Wrong size on FAnimNode_FeedbackRotate");
static_assert(offsetof(FAnimNode_FeedbackRotate, BeginBones) == 0x0000E8, "Member 'FAnimNode_FeedbackRotate::BeginBones' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, EndBones) == 0x0000F8, "Member 'FAnimNode_FeedbackRotate::EndBones' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, WeakenBones) == 0x000108, "Member 'FAnimNode_FeedbackRotate::WeakenBones' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, RootBone) == 0x000118, "Member 'FAnimNode_FeedbackRotate::RootBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, MaxTurnAngle) == 0x00012C, "Member 'FAnimNode_FeedbackRotate::MaxTurnAngle' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, Weaken) == 0x000130, "Member 'FAnimNode_FeedbackRotate::Weaken' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, RecoveryWeaken) == 0x000134, "Member 'FAnimNode_FeedbackRotate::RecoveryWeaken' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, MinDistance) == 0x000138, "Member 'FAnimNode_FeedbackRotate::MinDistance' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, MaxDistance) == 0x00013C, "Member 'FAnimNode_FeedbackRotate::MaxDistance' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, AnimChangeOptizimeParameter) == 0x000140, "Member 'FAnimNode_FeedbackRotate::AnimChangeOptizimeParameter' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, NewHit) == 0x000144, "Member 'FAnimNode_FeedbackRotate::NewHit' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, HitPos) == 0x000148, "Member 'FAnimNode_FeedbackRotate::HitPos' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, HitVector) == 0x000154, "Member 'FAnimNode_FeedbackRotate::HitVector' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, FeedbackTimeLength) == 0x000160, "Member 'FAnimNode_FeedbackRotate::FeedbackTimeLength' has a wrong offset!");
static_assert(offsetof(FAnimNode_FeedbackRotate, Curve) == 0x000168, "Member 'FAnimNode_FeedbackRotate::Curve' has a wrong offset!");

// ScriptStruct KuroAnim.AnimNode_FollowAnims
// 0x0118 (0x0128 - 0x0010)
struct FAnimNode_FollowAnims final : public FAnimNode_Base
{
public:
	struct FPoseLink                              Base;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMap<class FString, class UAnimSequenceBase*> AnimMap;                                           // 0x0020(0x0050)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	TSet<class FName>                             Slots;                                             // 0x0070(0x0050)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x68];                                      // 0x00C0(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_FollowAnims) == 0x000008, "Wrong alignment on FAnimNode_FollowAnims");
static_assert(sizeof(FAnimNode_FollowAnims) == 0x000128, "Wrong size on FAnimNode_FollowAnims");
static_assert(offsetof(FAnimNode_FollowAnims, Base) == 0x000010, "Member 'FAnimNode_FollowAnims::Base' has a wrong offset!");
static_assert(offsetof(FAnimNode_FollowAnims, AnimMap) == 0x000020, "Member 'FAnimNode_FollowAnims::AnimMap' has a wrong offset!");
static_assert(offsetof(FAnimNode_FollowAnims, Slots) == 0x000070, "Member 'FAnimNode_FollowAnims::Slots' has a wrong offset!");

// ScriptStruct KuroAnim.AnimNode_HumanTwoBoneIK
// 0x00E8 (0x01D0 - 0x00E8)
struct FAnimNode_HumanTwoBoneIK final : public FAnimNode_SkeletalControlBase
{
public:
	struct FBoneReference                         IKBone;                                            // 0x00E8(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EKuroAnimIKMode                               bMode;                                             // 0x00FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BaseAngleCurveName;                                // 0x0100(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LocationCurveName;                                 // 0x0110(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                IKLocalPos;                                        // 0x0120(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowerLimit[0x2];                                   // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OffsetOrTargetPosition;                            // 0x0134(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EndBoneIKMode                                 bEndBoneMode;                                      // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                EndBoneBaseAxis;                                   // 0x0144(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndBoneTargetAxis;                                 // 0x0150(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  EndBoneTargetRotation;                             // 0x0160(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         EndBoneLimit[0x6];                                 // 0x0170(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_188[0x48];                                     // 0x0188(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_HumanTwoBoneIK) == 0x000010, "Wrong alignment on FAnimNode_HumanTwoBoneIK");
static_assert(sizeof(FAnimNode_HumanTwoBoneIK) == 0x0001D0, "Wrong size on FAnimNode_HumanTwoBoneIK");
static_assert(offsetof(FAnimNode_HumanTwoBoneIK, IKBone) == 0x0000E8, "Member 'FAnimNode_HumanTwoBoneIK::IKBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_HumanTwoBoneIK, bMode) == 0x0000FC, "Member 'FAnimNode_HumanTwoBoneIK::bMode' has a wrong offset!");
static_assert(offsetof(FAnimNode_HumanTwoBoneIK, BaseAngleCurveName) == 0x000100, "Member 'FAnimNode_HumanTwoBoneIK::BaseAngleCurveName' has a wrong offset!");
static_assert(offsetof(FAnimNode_HumanTwoBoneIK, LocationCurveName) == 0x000110, "Member 'FAnimNode_HumanTwoBoneIK::LocationCurveName' has a wrong offset!");
static_assert(offsetof(FAnimNode_HumanTwoBoneIK, IKLocalPos) == 0x000120, "Member 'FAnimNode_HumanTwoBoneIK::IKLocalPos' has a wrong offset!");
static_assert(offsetof(FAnimNode_HumanTwoBoneIK, LowerLimit) == 0x00012C, "Member 'FAnimNode_HumanTwoBoneIK::LowerLimit' has a wrong offset!");
static_assert(offsetof(FAnimNode_HumanTwoBoneIK, OffsetOrTargetPosition) == 0x000134, "Member 'FAnimNode_HumanTwoBoneIK::OffsetOrTargetPosition' has a wrong offset!");
static_assert(offsetof(FAnimNode_HumanTwoBoneIK, bEndBoneMode) == 0x000140, "Member 'FAnimNode_HumanTwoBoneIK::bEndBoneMode' has a wrong offset!");
static_assert(offsetof(FAnimNode_HumanTwoBoneIK, EndBoneBaseAxis) == 0x000144, "Member 'FAnimNode_HumanTwoBoneIK::EndBoneBaseAxis' has a wrong offset!");
static_assert(offsetof(FAnimNode_HumanTwoBoneIK, EndBoneTargetAxis) == 0x000150, "Member 'FAnimNode_HumanTwoBoneIK::EndBoneTargetAxis' has a wrong offset!");
static_assert(offsetof(FAnimNode_HumanTwoBoneIK, EndBoneTargetRotation) == 0x000160, "Member 'FAnimNode_HumanTwoBoneIK::EndBoneTargetRotation' has a wrong offset!");
static_assert(offsetof(FAnimNode_HumanTwoBoneIK, EndBoneLimit) == 0x000170, "Member 'FAnimNode_HumanTwoBoneIK::EndBoneLimit' has a wrong offset!");

// ScriptStruct KuroAnim.AnimNode_KuroCacheBones
// 0x0060 (0x0148 - 0x00E8)
struct FAnimNode_KuroCacheBones final : public FAnimNode_SkeletalControlBase
{
public:
	TArray<class FName>                           BoneNames;                                         // 0x00E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8[0x50];                                      // 0x00F8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_KuroCacheBones) == 0x000008, "Wrong alignment on FAnimNode_KuroCacheBones");
static_assert(sizeof(FAnimNode_KuroCacheBones) == 0x000148, "Wrong size on FAnimNode_KuroCacheBones");
static_assert(offsetof(FAnimNode_KuroCacheBones, BoneNames) == 0x0000E8, "Member 'FAnimNode_KuroCacheBones::BoneNames' has a wrong offset!");

// ScriptStruct KuroAnim.KuroHumanIKPart
// 0x0098 (0x0098 - 0x0000)
struct FKuroHumanIKPart final
{
public:
	EIKPartType                                   PartType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         IKBone;                                            // 0x0004(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         TipBone;                                           // 0x0018(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         TipEndOffset;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCurve;                                         // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BaseAngleCurveName;                                // 0x0034(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LocationCurveName;                                 // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AlphaCurveName;                                    // 0x0050(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LandingTimeCurveName;                              // 0x005C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxIkDist;                                         // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowerLimits[0x2];                                  // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndBoneLimits[0x6];                                // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TipAngleLimit[0x2];                                // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EndBoneIKMode                                 EndBoneIKMode;                                     // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugPrint;                                       // 0x0095(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroHumanIKPart) == 0x000008, "Wrong alignment on FKuroHumanIKPart");
static_assert(sizeof(FKuroHumanIKPart) == 0x000098, "Wrong size on FKuroHumanIKPart");
static_assert(offsetof(FKuroHumanIKPart, PartType) == 0x000000, "Member 'FKuroHumanIKPart::PartType' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, IKBone) == 0x000004, "Member 'FKuroHumanIKPart::IKBone' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, TipBone) == 0x000018, "Member 'FKuroHumanIKPart::TipBone' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, TipEndOffset) == 0x00002C, "Member 'FKuroHumanIKPart::TipEndOffset' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, bUseCurve) == 0x000030, "Member 'FKuroHumanIKPart::bUseCurve' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, BaseAngleCurveName) == 0x000034, "Member 'FKuroHumanIKPart::BaseAngleCurveName' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, LocationCurveName) == 0x000040, "Member 'FKuroHumanIKPart::LocationCurveName' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, AlphaCurveName) == 0x000050, "Member 'FKuroHumanIKPart::AlphaCurveName' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, LandingTimeCurveName) == 0x00005C, "Member 'FKuroHumanIKPart::LandingTimeCurveName' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, MaxIkDist) == 0x000068, "Member 'FKuroHumanIKPart::MaxIkDist' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, LowerLimits) == 0x00006C, "Member 'FKuroHumanIKPart::LowerLimits' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, EndBoneLimits) == 0x000074, "Member 'FKuroHumanIKPart::EndBoneLimits' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, TipAngleLimit) == 0x00008C, "Member 'FKuroHumanIKPart::TipAngleLimit' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, EndBoneIKMode) == 0x000094, "Member 'FKuroHumanIKPart::EndBoneIKMode' has a wrong offset!");
static_assert(offsetof(FKuroHumanIKPart, bDebugPrint) == 0x000095, "Member 'FKuroHumanIKPart::bDebugPrint' has a wrong offset!");

// ScriptStruct KuroAnim.IKTarget
// 0x0030 (0x0030 - 0x0000)
struct FIKTarget final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FIKTarget) == 0x000010, "Wrong alignment on FIKTarget");
static_assert(sizeof(FIKTarget) == 0x000030, "Wrong size on FIKTarget");
static_assert(offsetof(FIKTarget, Location) == 0x000000, "Member 'FIKTarget::Location' has a wrong offset!");
static_assert(offsetof(FIKTarget, Rotation) == 0x000010, "Member 'FIKTarget::Rotation' has a wrong offset!");
static_assert(offsetof(FIKTarget, Alpha) == 0x000020, "Member 'FIKTarget::Alpha' has a wrong offset!");

// ScriptStruct KuroAnim.AnimNode_KuroHumanIK
// 0x0208 (0x02F0 - 0x00E8)
struct FAnimNode_KuroHumanIK final : public FAnimNode_SkeletalControlBase
{
public:
	TArray<struct FKuroHumanIKPart>               FootParts;                                         // 0x00E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FKuroHumanIKPart>               HandParts;                                         // 0x00F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EKuroHumanIKMode                              Mode;                                              // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CapsuleRadius;                                     // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMoving;                                         // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsComplexIk;                                      // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaSeconds;                                      // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForbiddenCurvePosition;                           // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoLerp;                                           // 0x0119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RootLerpSpeed;                                     // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootLerpSpeed;                                     // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandLerpSpeed;                                     // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandTurnSpeed;                                     // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundDepth;                                       // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
