#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroLevelStateMachine

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "KuroLevelStateMachine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class KuroLevelStateMachine.KuroLevelStateAction
// 0x0010 (0x0040 - 0x0030)
class UKuroLevelStateAction : public UObject
{
public:
	class UKuroLevelStateMachineComponent*        Owner;                                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroLevelStateAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroLevelStateAction")
	}
	static class UKuroLevelStateAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroLevelStateAction>();
	}
};
DUMPER7_ASSERTS_UKuroLevelStateAction;

// Class KuroLevelStateMachine.KuroLevelPlayMontage
// 0x0018 (0x0058 - 0x0040)
class UKuroLevelPlayMontage final : public UKuroLevelStateAction
{
public:
	class ASkeletalMeshActor*                     TargetActor;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Montage;                                           // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLooping;                                          // 0x0050(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroLevelPlayMontage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroLevelPlayMontage")
	}
	static class UKuroLevelPlayMontage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroLevelPlayMontage>();
	}
};
DUMPER7_ASSERTS_UKuroLevelPlayMontage;

// Class KuroLevelStateMachine.KuroLevelPlaySequence
// 0x0080 (0x00C0 - 0x0040)
class UKuroLevelPlaySequence final : public UKuroLevelStateAction
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         LevelSequence;                                     // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLoop;                                           // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKuroLevelPlaySequenceOverrideData> OverrideData;                                  // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x50];                                      // 0x0070(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroLevelPlaySequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroLevelPlaySequence")
	}
	static class UKuroLevelPlaySequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroLevelPlaySequence>();
	}
};
DUMPER7_ASSERTS_UKuroLevelPlaySequence;

// Class KuroLevelStateMachine.KuroLevelStateMachine
// 0x0008 (0x02B8 - 0x02B0)
class AKuroLevelStateMachine final : public AActor
{
public:
	class UKuroLevelStateMachineComponent*        LevelStateMachineComponent;                        // 0x02B0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroLevelStateMachine")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroLevelStateMachine")
	}
	static class AKuroLevelStateMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroLevelStateMachine>();
	}
};
DUMPER7_ASSERTS_AKuroLevelStateMachine;

// Class KuroLevelStateMachine.KuroLevelStateMachineComponent
// 0x0090 (0x02B0 - 0x0220)
class UKuroLevelStateMachineComponent final : public USceneComponent
{
public:
	uint8                                         bStartOnBeginPlay : 1;                             // 0x0218(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKuroLevelStateLayer>           Layers;                                            // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class ULevelSequencePlayer*                   SequencePlayer;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ALevelSequenceActor*                    SequenceActor;                                     // 0x0238(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_240[0x70];                                     // 0x0240(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool HasState(class FName StateName);
	void SetState(class FName StateName, float PlayRate);
	void Start();
	void Stop();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroLevelStateMachineComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroLevelStateMachineComponent")
	}
	static class UKuroLevelStateMachineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroLevelStateMachineComponent>();
	}
};
DUMPER7_ASSERTS_UKuroLevelStateMachineComponent;

// Class KuroLevelStateMachine.KuroLevelSwitchCollision
// 0x0060 (0x00A0 - 0x0040)
class UKuroLevelSwitchCollision final : public UKuroLevelStateAction
{
public:
	TArray<struct FKuroLevelSwitchCollisionData>  Collisions;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x50];                                      // 0x0050(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroLevelSwitchCollision")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroLevelSwitchCollision")
	}
	static class UKuroLevelSwitchCollision* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroLevelSwitchCollision>();
	}
};
DUMPER7_ASSERTS_UKuroLevelSwitchCollision;

// Class KuroLevelStateMachine.KuroLevelToggleActive
// 0x0060 (0x00A0 - 0x0040)
class UKuroLevelToggleActive final : public UKuroLevelStateAction
{
public:
	TArray<struct FKuroLevelToggleActiveData>     Actives;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x50];                                      // 0x0050(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroLevelToggleActive")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroLevelToggleActive")
	}
	static class UKuroLevelToggleActive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroLevelToggleActive>();
	}
};
DUMPER7_ASSERTS_UKuroLevelToggleActive;

}

