#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroGameScreenshot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KuroGameScreenshot.GameScreenshotTask.OnIOSPhotoLibraryAuthorizationCompleted
// 0x0001 (0x0001 - 0x0000)
struct GameScreenshotTask_OnIOSPhotoLibraryAuthorizationCompleted final
{
public:
	bool                                          IsGranted;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameScreenshotTask_OnIOSPhotoLibraryAuthorizationCompleted;

// Function KuroGameScreenshot.GameScreenshotTask.OnScreenshotCaptured
// 0x0018 (0x0018 - 0x0000)
struct GameScreenshotTask_OnScreenshotCaptured final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FColor>                         Colors;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameScreenshotTask_OnScreenshotCaptured;

// Function KuroGameScreenshot.GameScreenshotTask.OnScreenshotCompressed
// 0x0010 (0x0010 - 0x0000)
struct GameScreenshotTask_OnScreenshotCompressed final
{
public:
	TArray<uint8>                                 CompressedBitMap;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameScreenshotTask_OnScreenshotCompressed;

// Function KuroGameScreenshot.GameScreenshotTask.TakeScreenshot
// 0x0001 (0x0001 - 0x0000)
struct GameScreenshotTask_TakeScreenshot final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameScreenshotTask_TakeScreenshot;

// Function KuroGameScreenshot.KuroGameScreenshotBPLibrary.CompressConvertColorsToBitmap
// 0x0028 (0x0028 - 0x0000)
struct KuroGameScreenshotBPLibrary_CompressConvertColorsToBitmap final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FColor>                         Colors;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 BitMap;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroGameScreenshotBPLibrary_CompressConvertColorsToBitmap;

// Function KuroGameScreenshot.KuroGameScreenshotBPLibrary.ConvertColorsToBitmap
// 0x0028 (0x0028 - 0x0000)
struct KuroGameScreenshotBPLibrary_ConvertColorsToBitmap final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FColor>                         Colors;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 BitMap;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroGameScreenshotBPLibrary_ConvertColorsToBitmap;

// Function KuroGameScreenshot.KuroGameScreenshotBPLibrary.IsPhotoLibraryAuthorized
// 0x0001 (0x0001 - 0x0000)
struct KuroGameScreenshotBPLibrary_IsPhotoLibraryAuthorized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroGameScreenshotBPLibrary_IsPhotoLibraryAuthorized;

// Function KuroGameScreenshot.KuroGameScreenshotBPLibrary.PrepareTakeScreenshot
// 0x0040 (0x0040 - 0x0000)
struct KuroGameScreenshotBPLibrary_PrepareTakeScreenshot final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InFilename;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MinCaptureRegion;                                  // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MaxCaptureRegion;                                  // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenshotResolutionX;                             // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenshotResolutionY;                             // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SaveFile;                                          // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameScreenshotTask*                    ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroGameScreenshotBPLibrary_PrepareTakeScreenshot;

// Function KuroGameScreenshot.KuroGameScreenshotBPLibrary.SaveColorArrayToAndroidAlbum
// 0x0018 (0x0018 - 0x0000)
struct KuroGameScreenshotBPLibrary_SaveColorArrayToAndroidAlbum final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 BitMap;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroGameScreenshotBPLibrary_SaveColorArrayToAndroidAlbum;

// Function KuroGameScreenshot.KuroGameScreenshotBPLibrary.SaveColorArrayToIosAlbum
// 0x0018 (0x0018 - 0x0000)
struct KuroGameScreenshotBPLibrary_SaveColorArrayToIosAlbum final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FColor>                         Colors;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroGameScreenshotBPLibrary_SaveColorArrayToIosAlbum;

// Function KuroGameScreenshot.KuroGameScreenshotBPLibrary.SaveScreenshot
// 0x0028 (0x0028 - 0x0000)
struct KuroGameScreenshotBPLibrary_SaveScreenshot final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FColor>                         Colors;                                            // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroGameScreenshotBPLibrary_SaveScreenshot;

}

