#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroSoHotPatch

#include "Basic.hpp"


namespace SDK::Params
{

// Function KuroSoHotPatch.KuroAndroidModelTools.GetAndroidVersion
// 0x0010 (0x0010 - 0x0000)
struct KuroAndroidModelTools_GetAndroidVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroAndroidModelTools_GetAndroidVersion;

// Function KuroSoHotPatch.KuroAndroidModelTools.GetAppParallel
// 0x0010 (0x0010 - 0x0000)
struct KuroAndroidModelTools_GetAppParallel final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroAndroidModelTools_GetAppParallel;

// Function KuroSoHotPatch.KuroAndroidModelTools.GetBrand
// 0x0010 (0x0010 - 0x0000)
struct KuroAndroidModelTools_GetBrand final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroAndroidModelTools_GetBrand;

// Function KuroSoHotPatch.KuroAndroidModelTools.GetManufacturer
// 0x0010 (0x0010 - 0x0000)
struct KuroAndroidModelTools_GetManufacturer final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroAndroidModelTools_GetManufacturer;

// Function KuroSoHotPatch.KuroAndroidModelTools.GetModel
// 0x0010 (0x0010 - 0x0000)
struct KuroAndroidModelTools_GetModel final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroAndroidModelTools_GetModel;

// Function KuroSoHotPatch.KuroOnPatchCallback.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct KuroOnPatchCallback_GetInstance final
{
public:
	class UKuroOnPatchCallback*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroOnPatchCallback_GetInstance;

// Function KuroSoHotPatch.KuroSPTools.GetSoVersionUpdateTime
// 0x0004 (0x0004 - 0x0000)
struct KuroSPTools_GetSoVersionUpdateTime final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSPTools_GetSoVersionUpdateTime;

// Function KuroSoHotPatch.KuroSPTools.SetCDNConfig
// 0x0020 (0x0020 - 0x0000)
struct KuroSPTools_SetCDNConfig final
{
public:
	class FString                                 CDNPrefix;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CDNPath;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSPTools_SetCDNConfig;

// Function KuroSoHotPatch.KuroSPTools.SetChannelId
// 0x0010 (0x0010 - 0x0000)
struct KuroSPTools_SetChannelId final
{
public:
	class FString                                 ChannelID;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSPTools_SetChannelId;

// Function KuroSoHotPatch.KuroSPTools.SetSoVersionUpdateTime
// 0x0004 (0x0004 - 0x0000)
struct KuroSPTools_SetSoVersionUpdateTime final
{
public:
	int32                                         UpdateTime;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSPTools_SetSoVersionUpdateTime;

// Function KuroSoHotPatch.KuroTinkerTools.GetCurApplyingVersion
// 0x0010 (0x0010 - 0x0000)
struct KuroTinkerTools_GetCurApplyingVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroTinkerTools_GetCurApplyingVersion;

// Function KuroSoHotPatch.KuroTinkerTools.GetCurLoadingVersion
// 0x0010 (0x0010 - 0x0000)
struct KuroTinkerTools_GetCurLoadingVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroTinkerTools_GetCurLoadingVersion;

// Function KuroSoHotPatch.KuroTinkerTools.GetCurUsingVersion
// 0x0010 (0x0010 - 0x0000)
struct KuroTinkerTools_GetCurUsingVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroTinkerTools_GetCurUsingVersion;

// Function KuroSoHotPatch.KuroTinkerTools.IsTinkerPackaged
// 0x0001 (0x0001 - 0x0000)
struct KuroTinkerTools_IsTinkerPackaged final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroTinkerTools_IsTinkerPackaged;

// Function KuroSoHotPatch.KuroTinkerTools.LoadPatch
// 0x0010 (0x0010 - 0x0000)
struct KuroTinkerTools_LoadPatch final
{
public:
	class FString                                 PatchPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroTinkerTools_LoadPatch;

// Function KuroSoHotPatch.KuroTinkerTools.SetCurLoadingVersion
// 0x0010 (0x0010 - 0x0000)
struct KuroTinkerTools_SetCurLoadingVersion final
{
public:
	class FString                                 Version;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroTinkerTools_SetCurLoadingVersion;

}

