#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroSimpleCombat

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "KuroSimpleCombat_structs.hpp"


namespace SDK
{

// Class KuroSimpleCombat.InstanceCapsuleComponent
// 0x0020 (0x0550 - 0x0530)
class UInstanceCapsuleComponent final : public UPrimitiveComponent
{
public:
	float                                         CapsuleHalfHeight;                                 // 0x0528(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CapsuleRadius;                                     // 0x052C(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBodySetup*                             ShapeBodySetup;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_538[0x18];                                     // 0x0538(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 AddNewInstanceData(const struct FTransform& WorldSpaceInstanceTransform);
	void ClearAllInstanceBodies();
	void UpdateInstanceBodyTransform(int32 InstanceIndex, const struct FTransform& WorldSpaceInstanceTransform);
	void UpdateInstanceTransforms(const TArray<int32>& InstanceIndices, const TArray<struct FTransform>& InTransforms);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstanceCapsuleComponent">();
	}
	static class UInstanceCapsuleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstanceCapsuleComponent>();
	}
};
static_assert(alignof(UInstanceCapsuleComponent) == 0x000010, "Wrong alignment on UInstanceCapsuleComponent");
static_assert(sizeof(UInstanceCapsuleComponent) == 0x000550, "Wrong size on UInstanceCapsuleComponent");
static_assert(offsetof(UInstanceCapsuleComponent, CapsuleHalfHeight) == 0x000528, "Member 'UInstanceCapsuleComponent::CapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(UInstanceCapsuleComponent, CapsuleRadius) == 0x00052C, "Member 'UInstanceCapsuleComponent::CapsuleRadius' has a wrong offset!");
static_assert(offsetof(UInstanceCapsuleComponent, ShapeBodySetup) == 0x000530, "Member 'UInstanceCapsuleComponent::ShapeBodySetup' has a wrong offset!");

// Class KuroSimpleCombat.KSC_BaseObject
// 0x0008 (0x0038 - 0x0030)
class UKSC_BaseObject : public UObject
{
public:
	class UKSC_World*                             KscWorld;                                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_BaseObject">();
	}
	static class UKSC_BaseObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_BaseObject>();
	}
};
static_assert(alignof(UKSC_BaseObject) == 0x000008, "Wrong alignment on UKSC_BaseObject");
static_assert(sizeof(UKSC_BaseObject) == 0x000038, "Wrong size on UKSC_BaseObject");
static_assert(offsetof(UKSC_BaseObject, KscWorld) == 0x000030, "Member 'UKSC_BaseObject::KscWorld' has a wrong offset!");

// Class KuroSimpleCombat.KSC_AttrSet
// 0x02A8 (0x02E0 - 0x0038)
class UKSC_AttrSet final : public UKSC_BaseObject
{
public:
	class UKSC_SkillComp*                         Owner_;                                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EKSC_AttrType, int32>                    Attrs_;                                            // 0x0040(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<class UObject*, int32>                   MoveReduceAttrs;                                   // 0x0090(0x0050)(Protected, NativeAccessSpecifierProtected)
	class UObject*                                CurMoveReduceObject;                               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x50];                                      // 0x00E8(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EKSC_AttrType, int32>                    AttrsLockLowerBound;                               // 0x0138(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<int32, struct FKSC_AttrBoundLocker>      LowerBoundLockerMap;                               // 0x0188(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D8[0x108];                                    // 0x01D8(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AssignAttrListen(EKSC_AttrType Id, const TDelegate<void(EKSC_AttrType AttrType, int32 Value)>& InDelegate);
	void RemoveAttrListen(EKSC_AttrType Id, const TDelegate<void(EKSC_AttrType AttrType, int32 Value)>& InDelegate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_AttrSet">();
	}
	static class UKSC_AttrSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_AttrSet>();
	}
};
static_assert(alignof(UKSC_AttrSet) == 0x000008, "Wrong alignment on UKSC_AttrSet");
static_assert(sizeof(UKSC_AttrSet) == 0x0002E0, "Wrong size on UKSC_AttrSet");
static_assert(offsetof(UKSC_AttrSet, Owner_) == 0x000038, "Member 'UKSC_AttrSet::Owner_' has a wrong offset!");
static_assert(offsetof(UKSC_AttrSet, Attrs_) == 0x000040, "Member 'UKSC_AttrSet::Attrs_' has a wrong offset!");
static_assert(offsetof(UKSC_AttrSet, MoveReduceAttrs) == 0x000090, "Member 'UKSC_AttrSet::MoveReduceAttrs' has a wrong offset!");
static_assert(offsetof(UKSC_AttrSet, CurMoveReduceObject) == 0x0000E0, "Member 'UKSC_AttrSet::CurMoveReduceObject' has a wrong offset!");
static_assert(offsetof(UKSC_AttrSet, AttrsLockLowerBound) == 0x000138, "Member 'UKSC_AttrSet::AttrsLockLowerBound' has a wrong offset!");
static_assert(offsetof(UKSC_AttrSet, LowerBoundLockerMap) == 0x000188, "Member 'UKSC_AttrSet::LowerBoundLockerMap' has a wrong offset!");

// Class KuroSimpleCombat.KSC_BaseActor
// 0x0008 (0x02B8 - 0x02B0)
class AKSC_BaseActor : public AActor
{
public:
	class UKSC_World*                             KscWorld;                                          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_BaseActor">();
	}
	static class AKSC_BaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKSC_BaseActor>();
	}
};
static_assert(alignof(AKSC_BaseActor) == 0x000008, "Wrong alignment on AKSC_BaseActor");
static_assert(sizeof(AKSC_BaseActor) == 0x0002B8, "Wrong size on AKSC_BaseActor");
static_assert(offsetof(AKSC_BaseActor, KscWorld) == 0x0002B0, "Member 'AKSC_BaseActor::KscWorld' has a wrong offset!");

// Class KuroSimpleCombat.KSC_BossHeadUiHandle
// 0x0010 (0x0048 - 0x0038)
class UKSC_BossHeadUiHandle final : public UKSC_BaseObject
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_BossHeadUiHandle">();
	}
	static class UKSC_BossHeadUiHandle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_BossHeadUiHandle>();
	}
};
static_assert(alignof(UKSC_BossHeadUiHandle) == 0x000008, "Wrong alignment on UKSC_BossHeadUiHandle");
static_assert(sizeof(UKSC_BossHeadUiHandle) == 0x000048, "Wrong size on UKSC_BossHeadUiHandle");

// Class KuroSimpleCombat.KSC_Buff
// 0x0028 (0x0060 - 0x0038)
class UKSC_Buff : public UKSC_BaseObject
{
public:
	class UKSC_SkillComp*                         Caster_;                                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKSC_SkillComp*                         Owner_;                                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKSC_DA_Buff*                           DaBuff_;                                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff">();
	}
	static class UKSC_Buff* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff>();
	}
};
static_assert(alignof(UKSC_Buff) == 0x000008, "Wrong alignment on UKSC_Buff");
static_assert(sizeof(UKSC_Buff) == 0x000060, "Wrong size on UKSC_Buff");
static_assert(offsetof(UKSC_Buff, Caster_) == 0x000038, "Member 'UKSC_Buff::Caster_' has a wrong offset!");
static_assert(offsetof(UKSC_Buff, Owner_) == 0x000040, "Member 'UKSC_Buff::Owner_' has a wrong offset!");
static_assert(offsetof(UKSC_Buff, DaBuff_) == 0x000048, "Member 'UKSC_Buff::DaBuff_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_AddSkill
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_AddSkill final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_AddSkill*                  DaBuffAddSkill_;                                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_AddSkill">();
	}
	static class UKSC_Buff_AddSkill* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_AddSkill>();
	}
};
static_assert(alignof(UKSC_Buff_AddSkill) == 0x000008, "Wrong alignment on UKSC_Buff_AddSkill");
static_assert(sizeof(UKSC_Buff_AddSkill) == 0x000068, "Wrong size on UKSC_Buff_AddSkill");
static_assert(offsetof(UKSC_Buff_AddSkill, DaBuffAddSkill_) == 0x000060, "Member 'UKSC_Buff_AddSkill::DaBuffAddSkill_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_AddTargetFaction
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_AddTargetFaction final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_AddTargetFaction*          DaBuffAddTarget_;                                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_AddTargetFaction">();
	}
	static class UKSC_Buff_AddTargetFaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_AddTargetFaction>();
	}
};
static_assert(alignof(UKSC_Buff_AddTargetFaction) == 0x000008, "Wrong alignment on UKSC_Buff_AddTargetFaction");
static_assert(sizeof(UKSC_Buff_AddTargetFaction) == 0x000068, "Wrong size on UKSC_Buff_AddTargetFaction");
static_assert(offsetof(UKSC_Buff_AddTargetFaction, DaBuffAddTarget_) == 0x000060, "Member 'UKSC_Buff_AddTargetFaction::DaBuffAddTarget_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_AttrLockLowerBound
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_AttrLockLowerBound final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_AttrLockLowerBound*        DaBuffAttrLockLowerBound_;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_AttrLockLowerBound">();
	}
	static class UKSC_Buff_AttrLockLowerBound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_AttrLockLowerBound>();
	}
};
static_assert(alignof(UKSC_Buff_AttrLockLowerBound) == 0x000008, "Wrong alignment on UKSC_Buff_AttrLockLowerBound");
static_assert(sizeof(UKSC_Buff_AttrLockLowerBound) == 0x000070, "Wrong size on UKSC_Buff_AttrLockLowerBound");
static_assert(offsetof(UKSC_Buff_AttrLockLowerBound, DaBuffAttrLockLowerBound_) == 0x000060, "Member 'UKSC_Buff_AttrLockLowerBound::DaBuffAttrLockLowerBound_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_Aura
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_Aura final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Aura*                      DaBuffAura_;                                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_Aura">();
	}
	static class UKSC_Buff_Aura* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Aura>();
	}
};
static_assert(alignof(UKSC_Buff_Aura) == 0x000008, "Wrong alignment on UKSC_Buff_Aura");
static_assert(sizeof(UKSC_Buff_Aura) == 0x000070, "Wrong size on UKSC_Buff_Aura");
static_assert(offsetof(UKSC_Buff_Aura, DaBuffAura_) == 0x000060, "Member 'UKSC_Buff_Aura::DaBuffAura_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_Stack
// 0x0080 (0x00E0 - 0x0060)
class UKSC_Buff_Stack : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Stack*                     DaBuffStack_;                                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x78];                                      // 0x0068(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_Stack">();
	}
	static class UKSC_Buff_Stack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Stack>();
	}
};
static_assert(alignof(UKSC_Buff_Stack) == 0x000008, "Wrong alignment on UKSC_Buff_Stack");
static_assert(sizeof(UKSC_Buff_Stack) == 0x0000E0, "Wrong size on UKSC_Buff_Stack");
static_assert(offsetof(UKSC_Buff_Stack, DaBuffStack_) == 0x000060, "Member 'UKSC_Buff_Stack::DaBuffStack_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_AuraWithStack
// 0x0018 (0x00F8 - 0x00E0)
class UKSC_Buff_AuraWithStack final : public UKSC_Buff_Stack
{
public:
	class UKSC_DA_Buff_AuraWithStack*             DaBuffAuraWithStack;                               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x10];                                      // 0x00E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_AuraWithStack">();
	}
	static class UKSC_Buff_AuraWithStack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_AuraWithStack>();
	}
};
static_assert(alignof(UKSC_Buff_AuraWithStack) == 0x000008, "Wrong alignment on UKSC_Buff_AuraWithStack");
static_assert(sizeof(UKSC_Buff_AuraWithStack) == 0x0000F8, "Wrong size on UKSC_Buff_AuraWithStack");
static_assert(offsetof(UKSC_Buff_AuraWithStack, DaBuffAuraWithStack) == 0x0000E0, "Member 'UKSC_Buff_AuraWithStack::DaBuffAuraWithStack' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_ChainLightning
// 0x0058 (0x00B8 - 0x0060)
class UKSC_Buff_ChainLightning final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ChainLightning*            DaBuff_ChainLightning_;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x50];                                      // 0x0068(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_ChainLightning">();
	}
	static class UKSC_Buff_ChainLightning* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ChainLightning>();
	}
};
static_assert(alignof(UKSC_Buff_ChainLightning) == 0x000008, "Wrong alignment on UKSC_Buff_ChainLightning");
static_assert(sizeof(UKSC_Buff_ChainLightning) == 0x0000B8, "Wrong size on UKSC_Buff_ChainLightning");
static_assert(offsetof(UKSC_Buff_ChainLightning, DaBuff_ChainLightning_) == 0x000060, "Member 'UKSC_Buff_ChainLightning::DaBuff_ChainLightning_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_Damage
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_Damage final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Damage*                    DaBuffDamage_;                                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_Damage">();
	}
	static class UKSC_Buff_Damage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Damage>();
	}
};
static_assert(alignof(UKSC_Buff_Damage) == 0x000008, "Wrong alignment on UKSC_Buff_Damage");
static_assert(sizeof(UKSC_Buff_Damage) == 0x000068, "Wrong size on UKSC_Buff_Damage");
static_assert(offsetof(UKSC_Buff_Damage, DaBuffDamage_) == 0x000060, "Member 'UKSC_Buff_Damage::DaBuffDamage_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_DamageAllEnemy
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_DamageAllEnemy final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_DamageAllEnemy*            DaBuffDamageAllEnemy_;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_DamageAllEnemy">();
	}
	static class UKSC_Buff_DamageAllEnemy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_DamageAllEnemy>();
	}
};
static_assert(alignof(UKSC_Buff_DamageAllEnemy) == 0x000008, "Wrong alignment on UKSC_Buff_DamageAllEnemy");
static_assert(sizeof(UKSC_Buff_DamageAllEnemy) == 0x000068, "Wrong size on UKSC_Buff_DamageAllEnemy");
static_assert(offsetof(UKSC_Buff_DamageAllEnemy, DaBuffDamageAllEnemy_) == 0x000060, "Member 'UKSC_Buff_DamageAllEnemy::DaBuffDamageAllEnemy_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_DiffTransferAddAttr
// 0x0080 (0x0160 - 0x00E0)
class UKSC_Buff_DiffTransferAddAttr final : public UKSC_Buff_Stack
{
public:
	uint8                                         Pad_E0[0x78];                                      // 0x00E0(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_DA_Buff_DiffTransferAddAttr*       TransferAddAttr;                                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAttrChange(EKSC_AttrType AttrType, int32 Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_DiffTransferAddAttr">();
	}
	static class UKSC_Buff_DiffTransferAddAttr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_DiffTransferAddAttr>();
	}
};
static_assert(alignof(UKSC_Buff_DiffTransferAddAttr) == 0x000008, "Wrong alignment on UKSC_Buff_DiffTransferAddAttr");
static_assert(sizeof(UKSC_Buff_DiffTransferAddAttr) == 0x000160, "Wrong size on UKSC_Buff_DiffTransferAddAttr");
static_assert(offsetof(UKSC_Buff_DiffTransferAddAttr, TransferAddAttr) == 0x000158, "Member 'UKSC_Buff_DiffTransferAddAttr::TransferAddAttr' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_ImmuneBuff
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_ImmuneBuff final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ImmuneBuff*                DaBuffImmuneBuff_;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_ImmuneBuff">();
	}
	static class UKSC_Buff_ImmuneBuff* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ImmuneBuff>();
	}
};
static_assert(alignof(UKSC_Buff_ImmuneBuff) == 0x000008, "Wrong alignment on UKSC_Buff_ImmuneBuff");
static_assert(sizeof(UKSC_Buff_ImmuneBuff) == 0x000068, "Wrong size on UKSC_Buff_ImmuneBuff");
static_assert(offsetof(UKSC_Buff_ImmuneBuff, DaBuffImmuneBuff_) == 0x000060, "Member 'UKSC_Buff_ImmuneBuff::DaBuffImmuneBuff_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_Invisible
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_Invisible final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Invisible*                 DaBuffInvisible_;                                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_Invisible">();
	}
	static class UKSC_Buff_Invisible* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Invisible>();
	}
};
static_assert(alignof(UKSC_Buff_Invisible) == 0x000008, "Wrong alignment on UKSC_Buff_Invisible");
static_assert(sizeof(UKSC_Buff_Invisible) == 0x000068, "Wrong size on UKSC_Buff_Invisible");
static_assert(offsetof(UKSC_Buff_Invisible, DaBuffInvisible_) == 0x000060, "Member 'UKSC_Buff_Invisible::DaBuffInvisible_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_LandFireSpawner
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_LandFireSpawner final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_LandFireSpawner*           DaBuffLandFireSpawner_;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_LandFireSpawner">();
	}
	static class UKSC_Buff_LandFireSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_LandFireSpawner>();
	}
};
static_assert(alignof(UKSC_Buff_LandFireSpawner) == 0x000008, "Wrong alignment on UKSC_Buff_LandFireSpawner");
static_assert(sizeof(UKSC_Buff_LandFireSpawner) == 0x000068, "Wrong size on UKSC_Buff_LandFireSpawner");
static_assert(offsetof(UKSC_Buff_LandFireSpawner, DaBuffLandFireSpawner_) == 0x000060, "Member 'UKSC_Buff_LandFireSpawner::DaBuffLandFireSpawner_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_ListenEvent
// 0x00B0 (0x0110 - 0x0060)
class UKSC_Buff_ListenEvent final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ListenEvent*               DaBuffListenEvent_;                                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EKSC_Buff_ListenEvent_ListenType              ListenEvent;                                       // 0x0068(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EKSC_Buff_ListenEvent_Response                ListenEvent_Response;                              // 0x0069(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKSC_TagFilter                         ResponseCheckTagFilter;                            // 0x0070(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FKSC_DamageTypeFilter                  DamageTypeFilter;                                  // 0x0098(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EKSC_Event_HitTarget                          CheckTarget;                                       // 0x00B0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ResponseTag;                                       // 0x00B8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ListenTag;                                         // 0x00D8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ListenTagCount;                                    // 0x00E4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ClearListenTag;                                    // 0x00E8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CheckTagOnBeginBuff;                               // 0x00E9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_DA_Buff*                           AddOrRemoveBuff;                                   // 0x00F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BuffStackNum;                                      // 0x00F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_DA_AdditionalAttack*               AdditionalAttack;                                  // 0x0100(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_ListenEvent">();
	}
	static class UKSC_Buff_ListenEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ListenEvent>();
	}
};
static_assert(alignof(UKSC_Buff_ListenEvent) == 0x000008, "Wrong alignment on UKSC_Buff_ListenEvent");
static_assert(sizeof(UKSC_Buff_ListenEvent) == 0x000110, "Wrong size on UKSC_Buff_ListenEvent");
static_assert(offsetof(UKSC_Buff_ListenEvent, DaBuffListenEvent_) == 0x000060, "Member 'UKSC_Buff_ListenEvent::DaBuffListenEvent_' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ListenEvent, ListenEvent) == 0x000068, "Member 'UKSC_Buff_ListenEvent::ListenEvent' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ListenEvent, ListenEvent_Response) == 0x000069, "Member 'UKSC_Buff_ListenEvent::ListenEvent_Response' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ListenEvent, ResponseCheckTagFilter) == 0x000070, "Member 'UKSC_Buff_ListenEvent::ResponseCheckTagFilter' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ListenEvent, DamageTypeFilter) == 0x000098, "Member 'UKSC_Buff_ListenEvent::DamageTypeFilter' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ListenEvent, CheckTarget) == 0x0000B0, "Member 'UKSC_Buff_ListenEvent::CheckTarget' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ListenEvent, ResponseTag) == 0x0000B8, "Member 'UKSC_Buff_ListenEvent::ResponseTag' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ListenEvent, ListenTag) == 0x0000D8, "Member 'UKSC_Buff_ListenEvent::ListenTag' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ListenEvent, ListenTagCount) == 0x0000E4, "Member 'UKSC_Buff_ListenEvent::ListenTagCount' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ListenEvent, ClearListenTag) == 0x0000E8, "Member 'UKSC_Buff_ListenEvent::ClearListenTag' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ListenEvent, CheckTagOnBeginBuff) == 0x0000E9, "Member 'UKSC_Buff_ListenEvent::CheckTagOnBeginBuff' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ListenEvent, AddOrRemoveBuff) == 0x0000F0, "Member 'UKSC_Buff_ListenEvent::AddOrRemoveBuff' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ListenEvent, BuffStackNum) == 0x0000F8, "Member 'UKSC_Buff_ListenEvent::BuffStackNum' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ListenEvent, AdditionalAttack) == 0x000100, "Member 'UKSC_Buff_ListenEvent::AdditionalAttack' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_ModifyAttr
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_ModifyAttr final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ModifyAttr*                DaBuffModifyAttr_;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_ModifyAttr">();
	}
	static class UKSC_Buff_ModifyAttr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyAttr>();
	}
};
static_assert(alignof(UKSC_Buff_ModifyAttr) == 0x000008, "Wrong alignment on UKSC_Buff_ModifyAttr");
static_assert(sizeof(UKSC_Buff_ModifyAttr) == 0x000068, "Wrong size on UKSC_Buff_ModifyAttr");
static_assert(offsetof(UKSC_Buff_ModifyAttr, DaBuffModifyAttr_) == 0x000060, "Member 'UKSC_Buff_ModifyAttr::DaBuffModifyAttr_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_ModifyAttr_BeforeAfterApplyBuff
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_ModifyAttr_BeforeAfterApplyBuff final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ModifyAttr_BeforeAfterApplyBuff* DaBuffModifyAttr_;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_ModifyAttr_BeforeAfterApplyBuff">();
	}
	static class UKSC_Buff_ModifyAttr_BeforeAfterApplyBuff* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyAttr_BeforeAfterApplyBuff>();
	}
};
static_assert(alignof(UKSC_Buff_ModifyAttr_BeforeAfterApplyBuff) == 0x000008, "Wrong alignment on UKSC_Buff_ModifyAttr_BeforeAfterApplyBuff");
static_assert(sizeof(UKSC_Buff_ModifyAttr_BeforeAfterApplyBuff) == 0x000070, "Wrong size on UKSC_Buff_ModifyAttr_BeforeAfterApplyBuff");
static_assert(offsetof(UKSC_Buff_ModifyAttr_BeforeAfterApplyBuff, DaBuffModifyAttr_) == 0x000060, "Member 'UKSC_Buff_ModifyAttr_BeforeAfterApplyBuff::DaBuffModifyAttr_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_ModifyAttr_BeforeAfterHit
// 0x00C0 (0x0120 - 0x0060)
class UKSC_Buff_ModifyAttr_BeforeAfterHit final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ModifyAttr_BeforeAfterHit* DaBuffModifyAttr_;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EKSC_Buff_ModifyAttr_BeforeAfterHit_CheckType CheckType;                                         // 0x0068(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKSC_DamageTypeFilter                  DamageTypeFilter;                                  // 0x0070(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EKSC_Event_HitTarget                          CheckTarget;                                       // 0x0088(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EKSC_Event_HitTarget                          ModifyTarget;                                      // 0x0089(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKSC_TagFilter                         CheckTagFilter;                                    // 0x0090(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CheckCountTag;                                     // 0x00B8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TagCount;                                          // 0x00C4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EKSC_AttrType, int32>                    ModifyMap;                                         // 0x00C8(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_ModifyAttr_BeforeAfterHit">();
	}
	static class UKSC_Buff_ModifyAttr_BeforeAfterHit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyAttr_BeforeAfterHit>();
	}
};
static_assert(alignof(UKSC_Buff_ModifyAttr_BeforeAfterHit) == 0x000008, "Wrong alignment on UKSC_Buff_ModifyAttr_BeforeAfterHit");
static_assert(sizeof(UKSC_Buff_ModifyAttr_BeforeAfterHit) == 0x000120, "Wrong size on UKSC_Buff_ModifyAttr_BeforeAfterHit");
static_assert(offsetof(UKSC_Buff_ModifyAttr_BeforeAfterHit, DaBuffModifyAttr_) == 0x000060, "Member 'UKSC_Buff_ModifyAttr_BeforeAfterHit::DaBuffModifyAttr_' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ModifyAttr_BeforeAfterHit, CheckType) == 0x000068, "Member 'UKSC_Buff_ModifyAttr_BeforeAfterHit::CheckType' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ModifyAttr_BeforeAfterHit, DamageTypeFilter) == 0x000070, "Member 'UKSC_Buff_ModifyAttr_BeforeAfterHit::DamageTypeFilter' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ModifyAttr_BeforeAfterHit, CheckTarget) == 0x000088, "Member 'UKSC_Buff_ModifyAttr_BeforeAfterHit::CheckTarget' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ModifyAttr_BeforeAfterHit, ModifyTarget) == 0x000089, "Member 'UKSC_Buff_ModifyAttr_BeforeAfterHit::ModifyTarget' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ModifyAttr_BeforeAfterHit, CheckTagFilter) == 0x000090, "Member 'UKSC_Buff_ModifyAttr_BeforeAfterHit::CheckTagFilter' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ModifyAttr_BeforeAfterHit, CheckCountTag) == 0x0000B8, "Member 'UKSC_Buff_ModifyAttr_BeforeAfterHit::CheckCountTag' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ModifyAttr_BeforeAfterHit, TagCount) == 0x0000C4, "Member 'UKSC_Buff_ModifyAttr_BeforeAfterHit::TagCount' has a wrong offset!");
static_assert(offsetof(UKSC_Buff_ModifyAttr_BeforeAfterHit, ModifyMap) == 0x0000C8, "Member 'UKSC_Buff_ModifyAttr_BeforeAfterHit::ModifyMap' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_ModifyAttr_ByWorldAttr
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_ModifyAttr_ByWorldAttr final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ModifyAttr_ByWorldAttr*    DaBuffModifyAttr_;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_ModifyAttr_ByWorldAttr">();
	}
	static class UKSC_Buff_ModifyAttr_ByWorldAttr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyAttr_ByWorldAttr>();
	}
};
static_assert(alignof(UKSC_Buff_ModifyAttr_ByWorldAttr) == 0x000008, "Wrong alignment on UKSC_Buff_ModifyAttr_ByWorldAttr");
static_assert(sizeof(UKSC_Buff_ModifyAttr_ByWorldAttr) == 0x000070, "Wrong size on UKSC_Buff_ModifyAttr_ByWorldAttr");
static_assert(offsetof(UKSC_Buff_ModifyAttr_ByWorldAttr, DaBuffModifyAttr_) == 0x000060, "Member 'UKSC_Buff_ModifyAttr_ByWorldAttr::DaBuffModifyAttr_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_ModifyAttrRatio
// 0x0058 (0x00B8 - 0x0060)
class UKSC_Buff_ModifyAttrRatio final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ModifyAttrRatio*           DaBuffModifyAttrRatio_;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x50];                                      // 0x0068(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_ModifyAttrRatio">();
	}
	static class UKSC_Buff_ModifyAttrRatio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyAttrRatio>();
	}
};
static_assert(alignof(UKSC_Buff_ModifyAttrRatio) == 0x000008, "Wrong alignment on UKSC_Buff_ModifyAttrRatio");
static_assert(sizeof(UKSC_Buff_ModifyAttrRatio) == 0x0000B8, "Wrong size on UKSC_Buff_ModifyAttrRatio");
static_assert(offsetof(UKSC_Buff_ModifyAttrRatio, DaBuffModifyAttrRatio_) == 0x000060, "Member 'UKSC_Buff_ModifyAttrRatio::DaBuffModifyAttrRatio_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_ModifyHitDamage
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_ModifyHitDamage final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ModifyHitDamage*           DaBuffModifyHitDamage_;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_ModifyHitDamage">();
	}
	static class UKSC_Buff_ModifyHitDamage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyHitDamage>();
	}
};
static_assert(alignof(UKSC_Buff_ModifyHitDamage) == 0x000008, "Wrong alignment on UKSC_Buff_ModifyHitDamage");
static_assert(sizeof(UKSC_Buff_ModifyHitDamage) == 0x000068, "Wrong size on UKSC_Buff_ModifyHitDamage");
static_assert(offsetof(UKSC_Buff_ModifyHitDamage, DaBuffModifyHitDamage_) == 0x000060, "Member 'UKSC_Buff_ModifyHitDamage::DaBuffModifyHitDamage_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_ModifyLifeRatio
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_ModifyLifeRatio final : public UKSC_Buff
{
public:
	class UKsc_Da_Buff_ModifyLifeRatio*           DaBuffModifyHpPercent_;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_ModifyLifeRatio">();
	}
	static class UKSC_Buff_ModifyLifeRatio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyLifeRatio>();
	}
};
static_assert(alignof(UKSC_Buff_ModifyLifeRatio) == 0x000008, "Wrong alignment on UKSC_Buff_ModifyLifeRatio");
static_assert(sizeof(UKSC_Buff_ModifyLifeRatio) == 0x000070, "Wrong size on UKSC_Buff_ModifyLifeRatio");
static_assert(offsetof(UKSC_Buff_ModifyLifeRatio, DaBuffModifyHpPercent_) == 0x000060, "Member 'UKSC_Buff_ModifyLifeRatio::DaBuffModifyHpPercent_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_Period
// 0x0018 (0x0078 - 0x0060)
class UKSC_Buff_Period : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Period*                    DaBuffPeriod_;                                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x10];                                      // 0x0068(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_Period">();
	}
	static class UKSC_Buff_Period* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Period>();
	}
};
static_assert(alignof(UKSC_Buff_Period) == 0x000008, "Wrong alignment on UKSC_Buff_Period");
static_assert(sizeof(UKSC_Buff_Period) == 0x000078, "Wrong size on UKSC_Buff_Period");
static_assert(offsetof(UKSC_Buff_Period, DaBuffPeriod_) == 0x000060, "Member 'UKSC_Buff_Period::DaBuffPeriod_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_Period_Action
// 0x0008 (0x0080 - 0x0078)
class UKSC_Buff_Period_Action final : public UKSC_Buff_Period
{
public:
	class UKSC_DA_Buff_Period_Action*             DaBuffPeriodAction_;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_Period_Action">();
	}
	static class UKSC_Buff_Period_Action* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Period_Action>();
	}
};
static_assert(alignof(UKSC_Buff_Period_Action) == 0x000008, "Wrong alignment on UKSC_Buff_Period_Action");
static_assert(sizeof(UKSC_Buff_Period_Action) == 0x000080, "Wrong size on UKSC_Buff_Period_Action");
static_assert(offsetof(UKSC_Buff_Period_Action, DaBuffPeriodAction_) == 0x000078, "Member 'UKSC_Buff_Period_Action::DaBuffPeriodAction_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_Pull
// 0x0090 (0x00F0 - 0x0060)
class alignas(0x10) UKSC_Buff_Pull final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Pull*                      DaBuffPull_;                                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x88];                                      // 0x0068(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_Pull">();
	}
	static class UKSC_Buff_Pull* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Pull>();
	}
};
static_assert(alignof(UKSC_Buff_Pull) == 0x000010, "Wrong alignment on UKSC_Buff_Pull");
static_assert(sizeof(UKSC_Buff_Pull) == 0x0000F0, "Wrong size on UKSC_Buff_Pull");
static_assert(offsetof(UKSC_Buff_Pull, DaBuffPull_) == 0x000060, "Member 'UKSC_Buff_Pull::DaBuffPull_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_Push
// 0x0038 (0x0098 - 0x0060)
class UKSC_Buff_Push final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Push*                      DaBuffPush_;                                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x30];                                      // 0x0068(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_Push">();
	}
	static class UKSC_Buff_Push* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Push>();
	}
};
static_assert(alignof(UKSC_Buff_Push) == 0x000008, "Wrong alignment on UKSC_Buff_Push");
static_assert(sizeof(UKSC_Buff_Push) == 0x000098, "Wrong size on UKSC_Buff_Push");
static_assert(offsetof(UKSC_Buff_Push, DaBuffPush_) == 0x000060, "Member 'UKSC_Buff_Push::DaBuffPush_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_RemoveBuffByTags
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_RemoveBuffByTags final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_RemoveBuffByTags*          DaBuff_RemoveBuffByTag_;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_RemoveBuffByTags">();
	}
	static class UKSC_Buff_RemoveBuffByTags* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_RemoveBuffByTags>();
	}
};
static_assert(alignof(UKSC_Buff_RemoveBuffByTags) == 0x000008, "Wrong alignment on UKSC_Buff_RemoveBuffByTags");
static_assert(sizeof(UKSC_Buff_RemoveBuffByTags) == 0x000068, "Wrong size on UKSC_Buff_RemoveBuffByTags");
static_assert(offsetof(UKSC_Buff_RemoveBuffByTags, DaBuff_RemoveBuffByTag_) == 0x000060, "Member 'UKSC_Buff_RemoveBuffByTags::DaBuff_RemoveBuffByTag_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_ShieldEffect
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_ShieldEffect final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ShieldEffect*              DaBuffShield_;                                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_ShieldEffect">();
	}
	static class UKSC_Buff_ShieldEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ShieldEffect>();
	}
};
static_assert(alignof(UKSC_Buff_ShieldEffect) == 0x000008, "Wrong alignment on UKSC_Buff_ShieldEffect");
static_assert(sizeof(UKSC_Buff_ShieldEffect) == 0x000068, "Wrong size on UKSC_Buff_ShieldEffect");
static_assert(offsetof(UKSC_Buff_ShieldEffect, DaBuffShield_) == 0x000060, "Member 'UKSC_Buff_ShieldEffect::DaBuffShield_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_Stack_ModifyAttr
// 0x0010 (0x00F0 - 0x00E0)
class UKSC_Buff_Stack_ModifyAttr final : public UKSC_Buff_Stack
{
public:
	class UKSC_DA_Buff_Stack_ModifyAttr*          DaBuffStackModifyAttr_;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_Stack_ModifyAttr">();
	}
	static class UKSC_Buff_Stack_ModifyAttr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Stack_ModifyAttr>();
	}
};
static_assert(alignof(UKSC_Buff_Stack_ModifyAttr) == 0x000008, "Wrong alignment on UKSC_Buff_Stack_ModifyAttr");
static_assert(sizeof(UKSC_Buff_Stack_ModifyAttr) == 0x0000F0, "Wrong size on UKSC_Buff_Stack_ModifyAttr");
static_assert(offsetof(UKSC_Buff_Stack_ModifyAttr, DaBuffStackModifyAttr_) == 0x0000E0, "Member 'UKSC_Buff_Stack_ModifyAttr::DaBuffStackModifyAttr_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_Stack_ModifyLifeRatio
// 0x0010 (0x00F0 - 0x00E0)
class UKSC_Buff_Stack_ModifyLifeRatio final : public UKSC_Buff_Stack
{
public:
	class UKSC_DA_Buff_Stack_ModifyLifeRatio*     DaBuffStackModifyLifeRatio_;                       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_Stack_ModifyLifeRatio">();
	}
	static class UKSC_Buff_Stack_ModifyLifeRatio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Stack_ModifyLifeRatio>();
	}
};
static_assert(alignof(UKSC_Buff_Stack_ModifyLifeRatio) == 0x000008, "Wrong alignment on UKSC_Buff_Stack_ModifyLifeRatio");
static_assert(sizeof(UKSC_Buff_Stack_ModifyLifeRatio) == 0x0000F0, "Wrong size on UKSC_Buff_Stack_ModifyLifeRatio");
static_assert(offsetof(UKSC_Buff_Stack_ModifyLifeRatio, DaBuffStackModifyLifeRatio_) == 0x0000E0, "Member 'UKSC_Buff_Stack_ModifyLifeRatio::DaBuffStackModifyLifeRatio_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_StopAction
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_StopAction final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_StopAction*                DaBuffMoveStop_;                                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_StopAction">();
	}
	static class UKSC_Buff_StopAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_StopAction>();
	}
};
static_assert(alignof(UKSC_Buff_StopAction) == 0x000008, "Wrong alignment on UKSC_Buff_StopAction");
static_assert(sizeof(UKSC_Buff_StopAction) == 0x000070, "Wrong size on UKSC_Buff_StopAction");
static_assert(offsetof(UKSC_Buff_StopAction, DaBuffMoveStop_) == 0x000060, "Member 'UKSC_Buff_StopAction::DaBuffMoveStop_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_TransferAddAttr
// 0x0080 (0x0160 - 0x00E0)
class UKSC_Buff_TransferAddAttr final : public UKSC_Buff_Stack
{
public:
	uint8                                         Pad_E0[0x78];                                      // 0x00E0(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_DA_Buff_TransferAddAttr*           TransferAddAttr;                                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAttrChange(EKSC_AttrType AttrType, int32 Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_TransferAddAttr">();
	}
	static class UKSC_Buff_TransferAddAttr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_TransferAddAttr>();
	}
};
static_assert(alignof(UKSC_Buff_TransferAddAttr) == 0x000008, "Wrong alignment on UKSC_Buff_TransferAddAttr");
static_assert(sizeof(UKSC_Buff_TransferAddAttr) == 0x000160, "Wrong size on UKSC_Buff_TransferAddAttr");
static_assert(offsetof(UKSC_Buff_TransferAddAttr, TransferAddAttr) == 0x000158, "Member 'UKSC_Buff_TransferAddAttr::TransferAddAttr' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Buff_Unattackable_Spline
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_Unattackable_Spline final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Unattackable_Spline*       DaBuffUnattackable_;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_Unattackable_Spline">();
	}
	static class UKSC_Buff_Unattackable_Spline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Unattackable_Spline>();
	}
};
static_assert(alignof(UKSC_Buff_Unattackable_Spline) == 0x000008, "Wrong alignment on UKSC_Buff_Unattackable_Spline");
static_assert(sizeof(UKSC_Buff_Unattackable_Spline) == 0x000068, "Wrong size on UKSC_Buff_Unattackable_Spline");
static_assert(offsetof(UKSC_Buff_Unattackable_Spline, DaBuffUnattackable_) == 0x000060, "Member 'UKSC_Buff_Unattackable_Spline::DaBuffUnattackable_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_BuffId
// 0x0050 (0x0080 - 0x0030)
class UKSC_BuffId final : public UObject
{
public:
	TMap<int32, class UKSC_DA_Buff*>              BuffDa;                                            // 0x0030(0x0050)(NativeAccessSpecifierPrivate)

public:
	void AddBuffDA(const int64 BuffId, class UKSC_DA_Buff* Data);
	void ClearBuffDA();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_BuffId">();
	}
	static class UKSC_BuffId* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_BuffId>();
	}
};
static_assert(alignof(UKSC_BuffId) == 0x000008, "Wrong alignment on UKSC_BuffId");
static_assert(sizeof(UKSC_BuffId) == 0x000080, "Wrong size on UKSC_BuffId");
static_assert(offsetof(UKSC_BuffId, BuffDa) == 0x000030, "Member 'UKSC_BuffId::BuffDa' has a wrong offset!");

// Class KuroSimpleCombat.KSC_Bullet
// 0x00E8 (0x0120 - 0x0038)
#pragma pack(push, 0x1)
class alignas(0x10) UKSC_Bullet : public UKSC_BaseObject
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_SkillComp*                         Owner_;                                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      Niagara;                                           // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKSC_SkillComp*                         TargetEntity;                                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKSC_BulletTargetContext               TargetContext;                                     // 0x0060(0x0040)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0x78];                                      // 0x00A0(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Bullet">();
	}
	static class UKSC_Bullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Bullet>();
	}
};
#pragma pack(pop)
static_assert(alignof(UKSC_Bullet) == 0x000010, "Wrong alignment on UKSC_Bullet");
static_assert(sizeof(UKSC_Bullet) == 0x000120, "Wrong size on UKSC_Bullet");
static_assert(offsetof(UKSC_Bullet, Owner_) == 0x000040, "Member 'UKSC_Bullet::Owner_' has a wrong offset!");
static_assert(offsetof(UKSC_Bullet, Niagara) == 0x000048, "Member 'UKSC_Bullet::Niagara' has a wrong offset!");
static_assert(offsetof(UKSC_Bullet, TargetEntity) == 0x000050, "Member 'UKSC_Bullet::TargetEntity' has a wrong offset!");
static_assert(offsetof(UKSC_Bullet, TargetContext) == 0x000060, "Member 'UKSC_Bullet::TargetContext' has a wrong offset!");

// Class KuroSimpleCombat.KSC_BulletPierce
// 0x0030 (0x0150 - 0x0120)
class UKSC_BulletPierce final : public UKSC_Bullet
{
public:
	TArray<class UKSC_SkillComp*>                 Targets_;                                          // 0x0118(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_128[0x28];                                     // 0x0128(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_BulletPierce">();
	}
	static class UKSC_BulletPierce* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_BulletPierce>();
	}
};
static_assert(alignof(UKSC_BulletPierce) == 0x000010, "Wrong alignment on UKSC_BulletPierce");
static_assert(sizeof(UKSC_BulletPierce) == 0x000150, "Wrong size on UKSC_BulletPierce");
static_assert(offsetof(UKSC_BulletPierce, Targets_) == 0x000118, "Member 'UKSC_BulletPierce::Targets_' has a wrong offset!");

// Class KuroSimpleCombat.KSC_CompBase
// 0x0018 (0x0050 - 0x0038)
class UKSC_CompBase : public UKSC_BaseObject
{
public:
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_CompBase">();
	}
	static class UKSC_CompBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_CompBase>();
	}
};
static_assert(alignof(UKSC_CompBase) == 0x000008, "Wrong alignment on UKSC_CompBase");
static_assert(sizeof(UKSC_CompBase) == 0x000050, "Wrong size on UKSC_CompBase");

// Class KuroSimpleCombat.KSC_DA_Entity
// 0x00C0 (0x00F8 - 0x0038)
class UKSC_DA_Entity : public UDataAsset
{
public:
	TSubclassOf<class AKSC_Entity>                RuntimeClass;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     EntityClass;                                       // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_Faction                                  Default_Faction;                                   // 0x0048(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EKSC_Faction>                          Default_IgnoreFactions;                            // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UKSC_DA_SceneComp*                      SceneComp;                                         // 0x0060(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKSC_DA_SkillComp*                      SkillComp;                                         // 0x0068(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKSC_DA_EntityRender*                   Render;                                            // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
