#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroGamePartition

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "KuroGamePartition_structs.hpp"


namespace SDK
{

// Class KuroGamePartition.GamePartition
// 0x0298 (0x02C8 - 0x0030)
class UGamePartition : public UObject
{
public:
	uint8                                         Pad_30[0x298];                                     // 0x0030(0x0298)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 AllocateNewID();
	int32 Insert(class AActor* Actor, int32 Type);
	void K2_Insert(int32 ID, class AActor* Actor, int32 Type, int32 SubType, bool bUseActorBounds);
	const TArray<struct FGamePartitionObject> K2_RangeQueryWithBounds(const struct FBox& QueryBounds, int32 QueryType, int32 QuerySubType, bool bConsiderObjectPosition);
	void K2_Remove(int32 ID);
	const TArray<struct FGamePartitionObject> RangeQuery(const struct FVectorDouble& QueryOrigin, double QuerySphereRadius, int32 QueryType, int32 QuerySubType, bool bConsiderObjectPosition);
	void Remove(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GamePartition">();
	}
	static class UGamePartition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamePartition>();
	}
};
static_assert(alignof(UGamePartition) == 0x000008, "Wrong alignment on UGamePartition");
static_assert(sizeof(UGamePartition) == 0x0002C8, "Wrong size on UGamePartition");

// Class KuroGamePartition.GamePartitionMedium
// 0x0000 (0x02C8 - 0x02C8)
class UGamePartitionMedium final : public UGamePartition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GamePartitionMedium">();
	}
	static class UGamePartitionMedium* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamePartitionMedium>();
	}
};
static_assert(alignof(UGamePartitionMedium) == 0x000008, "Wrong alignment on UGamePartitionMedium");
static_assert(sizeof(UGamePartitionMedium) == 0x0002C8, "Wrong size on UGamePartitionMedium");

// Class KuroGamePartition.GamePartitionManager
// 0x0000 (0x0030 - 0x0030)
class UGamePartitionManager final : public UBlueprintFunctionLibrary
{
public:
	static class UGamePartition* GetGamePartition(EGamePartitionCellSizeType CellSizeType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GamePartitionManager">();
	}
	static class UGamePartitionManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamePartitionManager>();
	}
};
static_assert(alignof(UGamePartitionManager) == 0x000008, "Wrong alignment on UGamePartitionManager");
static_assert(sizeof(UGamePartitionManager) == 0x000030, "Wrong size on UGamePartitionManager");

// Class KuroGamePartition.GamePartitionSubsystem
// 0x0010 (0x0048 - 0x0038)
class UGamePartitionSubsystem final : public UWorldSubsystem
{
public:
	class UGamePartition*                         GamePartition[0x2];                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UGamePartition* GetGamePartition(EGamePartitionCellSizeType CellSizeType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GamePartitionSubsystem">();
	}
	static class UGamePartitionSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamePartitionSubsystem>();
	}
};
static_assert(alignof(UGamePartitionSubsystem) == 0x000008, "Wrong alignment on UGamePartitionSubsystem");
static_assert(sizeof(UGamePartitionSubsystem) == 0x000048, "Wrong size on UGamePartitionSubsystem");
static_assert(offsetof(UGamePartitionSubsystem, GamePartition) == 0x000038, "Member 'UGamePartitionSubsystem::GamePartition' has a wrong offset!");

}

