#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroBullet

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum KuroBullet.EKuroBulletChildrenType
// NumValues: 0x0004
enum class EKuroBulletChildrenType : uint8
{
	Normal                                   = 0,
	OnHitCharacter                           = 1,
	OnHitObstacle                            = 2,
	EKuroBulletChildrenType_MAX              = 3,
};

// Enum KuroBullet.EKuroBulletHitEffect
// NumValues: 0x0004
enum class EKuroBulletHitEffect : uint8
{
	OnTimeEnd                                = 0,
	OnHitObstacle                            = 2,
	OnHitCharacter                           = 4,
	EKuroBulletHitEffect_MAX                 = 5,
};

// Enum KuroBullet.EKuroBulletEffectParam
// NumValues: 0x0005
enum class EKuroBulletEffectParam : uint8
{
	None                                     = 0,
	RelativeLocation                         = 2,
	RelativeRotation                         = 3,
	Scale                                    = 4,
	EKuroBulletEffectParam_MAX               = 5,
};

// Enum KuroBullet.EKuroBulletMoveTrajectory
// NumValues: 0x0003
enum class EKuroBulletMoveTrajectory : uint8
{
	Default                                  = 0,
	SurroundCenter                           = 3,
	EKuroBulletMoveTrajectory_MAX            = 4,
};

// Enum KuroBullet.EKuroBulletTarget
// NumValues: 0x0004
enum class EKuroBulletTarget : uint8
{
	None                                     = 0,
	CurrentRole                              = 1,
	SkillTarget                              = 2,
	EKuroBulletTarget_MAX                    = 3,
};

// Enum KuroBullet.EKuroBulletInitVelocityDirection
// NumValues: 0x0005
enum class EKuroBulletInitVelocityDirection : uint8
{
	Default                                  = 0,
	ToTarget                                 = 1,
	ToOwner                                  = 2,
	Parent                                   = 3,
	EKuroBulletInitVelocityDirection_MAX     = 4,
};

// Enum KuroBullet.EKuroBulletFollowType
// NumValues: 0x0003
enum class EKuroBulletFollowType : uint8
{
	StaticPosition                           = 0,
	FollowSkeleton                           = 1,
	EKuroBulletFollowType_MAX                = 2,
};

// Enum KuroBullet.EKuroBulletHitType
// NumValues: 0x0005
enum class EKuroBulletHitType : uint8
{
	Self                                     = 0,
	Friend                                   = 1,
	Enemy                                    = 2,
	Team                                     = 3,
	EKuroBulletHitType_MAX                   = 4,
};

// Enum KuroBullet.EKuroBulletPositionStandard
// NumValues: 0x0004
enum class EKuroBulletPositionStandard : uint8
{
	Owner                                    = 0,
	SkillTarget                              = 1,
	Parent                                   = 3,
	EKuroBulletPositionStandard_MAX          = 4,
};

// Enum KuroBullet.EKuroBulletShape
// NumValues: 0x0006
enum class EKuroBulletShape : uint8
{
	None                                     = 0,
	Box                                      = 1,
	Sphere                                   = 2,
	Sector                                   = 3,
	Cylinder                                 = 4,
	EKuroBulletShape_MAX                     = 5,
};

// Enum KuroBullet.EBulletHitActorType
// NumValues: 0x0004
enum class EBulletHitActorType : uint8
{
	Ignore                                   = 0,
	KSCEntity                                = 1,
	Obstacles                                = 2,
	EBulletHitActorType_MAX                  = 3,
};

// Enum KuroBullet.EBulletOwnerType
// NumValues: 0x0003
enum class EBulletOwnerType : uint8
{
	KSCEntity                                = 0,
	TsEntity                                 = 1,
	EBulletOwnerType_MAX                     = 2,
};

// Enum KuroBullet.EKuroBulletSkillDirection
// NumValues: 0x0003
enum class EKuroBulletSkillDirection : uint8
{
	SkillTarget                              = 0,
	Self                                     = 2,
	EKuroBulletSkillDirection_MAX            = 3,
};

// Enum KuroBullet.EKSC_BulletTarget
// NumValues: 0x0003
enum class EKSC_BulletTarget : uint8
{
	None                                     = 0,
	NearestEnemy                             = 1,
	EKSC_MAX                                 = 2,
};

// ScriptStruct KuroBullet.KuroBulletDataBase
// 0x0080 (0x0088 - 0x0008)
struct FKuroBulletDataBase final : public FTableRowBase
{
public:
	EKuroBulletShape                              Shape;                                             // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Size;                                              // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EKuroBulletPositionStandard                   BornPositionStandard;                              // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BornPosition;                                      // 0x0028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CenterOffset;                                      // 0x0034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BornPositionRandom;                                // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CollisionActiveDuration;                           // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CollisionActiveDelay;                              // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroBulletHitType                            HitType;                                           // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           BanHitTag;                                         // 0x005C(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HitCountMax;                                       // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HitCountPerVictim;                                 // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Interval;                                          // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         DamageId;                                          // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StickGround;                                       // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HitObstacle;                                       // 0x0081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroBulletDataBase) == 0x000008, "Wrong alignment on FKuroBulletDataBase");
static_assert(sizeof(FKuroBulletDataBase) == 0x000088, "Wrong size on FKuroBulletDataBase");
static_assert(offsetof(FKuroBulletDataBase, Shape) == 0x000008, "Member 'FKuroBulletDataBase::Shape' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, Size) == 0x00000C, "Member 'FKuroBulletDataBase::Size' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, Rotation) == 0x000018, "Member 'FKuroBulletDataBase::Rotation' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, BornPositionStandard) == 0x000024, "Member 'FKuroBulletDataBase::BornPositionStandard' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, BornPosition) == 0x000028, "Member 'FKuroBulletDataBase::BornPosition' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, CenterOffset) == 0x000034, "Member 'FKuroBulletDataBase::CenterOffset' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, BornPositionRandom) == 0x000040, "Member 'FKuroBulletDataBase::BornPositionRandom' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, Duration) == 0x00004C, "Member 'FKuroBulletDataBase::Duration' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, CollisionActiveDuration) == 0x000050, "Member 'FKuroBulletDataBase::CollisionActiveDuration' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, CollisionActiveDelay) == 0x000054, "Member 'FKuroBulletDataBase::CollisionActiveDelay' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, HitType) == 0x000058, "Member 'FKuroBulletDataBase::HitType' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, BanHitTag) == 0x00005C, "Member 'FKuroBulletDataBase::BanHitTag' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, HitCountMax) == 0x000068, "Member 'FKuroBulletDataBase::HitCountMax' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, HitCountPerVictim) == 0x00006C, "Member 'FKuroBulletDataBase::HitCountPerVictim' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, Interval) == 0x000070, "Member 'FKuroBulletDataBase::Interval' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, DamageId) == 0x000078, "Member 'FKuroBulletDataBase::DamageId' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, StickGround) == 0x000080, "Member 'FKuroBulletDataBase::StickGround' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataBase, HitObstacle) == 0x000081, "Member 'FKuroBulletDataBase::HitObstacle' has a wrong offset!");

// ScriptStruct KuroBullet.KuroBulletDataRender
// 0x00E0 (0x00E8 - 0x0008)
struct FKuroBulletDataRender final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UEffectModelBase>        EffectBullet;                                      // 0x0008(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EKuroBulletEffectParam, class FString>   EffectBulletParams;                                // 0x0038(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bNotDestroyEffectImmediately;                      // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EKuroBulletHitEffect, TSoftObjectPtr<class UObject>> EffectOnHit;                           // 0x0090(0x0050)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bApplyHitMaterial;                                 // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroBulletDataRender) == 0x000008, "Wrong alignment on FKuroBulletDataRender");
static_assert(sizeof(FKuroBulletDataRender) == 0x0000E8, "Wrong size on FKuroBulletDataRender");
static_assert(offsetof(FKuroBulletDataRender, EffectBullet) == 0x000008, "Member 'FKuroBulletDataRender::EffectBullet' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataRender, EffectBulletParams) == 0x000038, "Member 'FKuroBulletDataRender::EffectBulletParams' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataRender, bNotDestroyEffectImmediately) == 0x000088, "Member 'FKuroBulletDataRender::bNotDestroyEffectImmediately' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataRender, EffectOnHit) == 0x000090, "Member 'FKuroBulletDataRender::EffectOnHit' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataRender, bApplyHitMaterial) == 0x0000E0, "Member 'FKuroBulletDataRender::bApplyHitMaterial' has a wrong offset!");

// ScriptStruct KuroBullet.KuroBulletDataMove
// 0x0040 (0x0048 - 0x0008)
struct FKuroBulletDataMove final : public FTableRowBase
{
public:
	EKuroBulletFollowType                         FollowType;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroBulletInitVelocityDirection              InitVelocityDirStandard;                           // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               InitVelocityRot;                                   // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                InitVelocityDirRandom;                             // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroBulletTarget                             TrackTarget;                                       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroBulletMoveTrajectory                     Trajectory;                                        // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        TrackParams;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          InitVelocityKeepUp;                                // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroBulletDataMove) == 0x000008, "Wrong alignment on FKuroBulletDataMove");
static_assert(sizeof(FKuroBulletDataMove) == 0x000048, "Wrong size on FKuroBulletDataMove");
static_assert(offsetof(FKuroBulletDataMove, FollowType) == 0x000008, "Member 'FKuroBulletDataMove::FollowType' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataMove, InitVelocityDirStandard) == 0x000009, "Member 'FKuroBulletDataMove::InitVelocityDirStandard' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataMove, InitVelocityRot) == 0x00000C, "Member 'FKuroBulletDataMove::InitVelocityRot' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataMove, InitVelocityDirRandom) == 0x000018, "Member 'FKuroBulletDataMove::InitVelocityDirRandom' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataMove, Speed) == 0x000024, "Member 'FKuroBulletDataMove::Speed' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataMove, TrackTarget) == 0x000028, "Member 'FKuroBulletDataMove::TrackTarget' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataMove, Trajectory) == 0x000029, "Member 'FKuroBulletDataMove::Trajectory' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataMove, TrackParams) == 0x000030, "Member 'FKuroBulletDataMove::TrackParams' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataMove, InitVelocityKeepUp) == 0x000040, "Member 'FKuroBulletDataMove::InitVelocityKeepUp' has a wrong offset!");

// ScriptStruct KuroBullet.KuroBulletDataLogic
// 0x0028 (0x0030 - 0x0008)
struct FKuroBulletDataLogic final : public FTableRowBase
{
public:
	bool                                          DestroyOnHitCharacter;                             // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DestroyOnHitObstacle;                              // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int64>                                 BuffIdToAttacker;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int64>                                 BuffIdToVictim;                                    // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FKuroBulletDataLogic) == 0x000008, "Wrong alignment on FKuroBulletDataLogic");
static_assert(sizeof(FKuroBulletDataLogic) == 0x000030, "Wrong size on FKuroBulletDataLogic");
static_assert(offsetof(FKuroBulletDataLogic, DestroyOnHitCharacter) == 0x000008, "Member 'FKuroBulletDataLogic::DestroyOnHitCharacter' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataLogic, DestroyOnHitObstacle) == 0x000009, "Member 'FKuroBulletDataLogic::DestroyOnHitObstacle' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataLogic, BuffIdToAttacker) == 0x000010, "Member 'FKuroBulletDataLogic::BuffIdToAttacker' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataLogic, BuffIdToVictim) == 0x000020, "Member 'FKuroBulletDataLogic::BuffIdToVictim' has a wrong offset!");

// ScriptStruct KuroBullet.KuroBulletDataChild
// 0x0018 (0x0020 - 0x0008)
struct FKuroBulletDataChild final : public FTableRowBase
{
public:
	int64                                         BulletConfigId;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Num;                                               // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Interval;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroBulletChildrenType                       Condition;                                         // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroBulletDataChild) == 0x000008, "Wrong alignment on FKuroBulletDataChild");
static_assert(sizeof(FKuroBulletDataChild) == 0x000020, "Wrong size on FKuroBulletDataChild");
static_assert(offsetof(FKuroBulletDataChild, BulletConfigId) == 0x000008, "Member 'FKuroBulletDataChild::BulletConfigId' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataChild, Delay) == 0x000010, "Member 'FKuroBulletDataChild::Delay' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataChild, Num) == 0x000014, "Member 'FKuroBulletDataChild::Num' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataChild, Interval) == 0x000018, "Member 'FKuroBulletDataChild::Interval' has a wrong offset!");
static_assert(offsetof(FKuroBulletDataChild, Condition) == 0x00001C, "Member 'FKuroBulletDataChild::Condition' has a wrong offset!");

// ScriptStruct KuroBullet.KuroBulletData
// 0x0208 (0x0210 - 0x0008)
struct FKuroBulletData final : public FTableRowBase
{
public:
	class FName                                   Name;                                              // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroBulletDataBase                    Base;                                              // 0x0018(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroBulletDataMove                    Move;                                              // 0x00A0(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroBulletDataRender                  Render;                                            // 0x00E8(0x00E8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroBulletDataLogic                   Logic;                                             // 0x01D0(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FKuroBulletDataChild>           Children;                                          // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FKuroBulletData) == 0x000008, "Wrong alignment on FKuroBulletData");
static_assert(sizeof(FKuroBulletData) == 0x000210, "Wrong size on FKuroBulletData");
static_assert(offsetof(FKuroBulletData, Name) == 0x000008, "Member 'FKuroBulletData::Name' has a wrong offset!");
static_assert(offsetof(FKuroBulletData, Base) == 0x000018, "Member 'FKuroBulletData::Base' has a wrong offset!");
static_assert(offsetof(FKuroBulletData, Move) == 0x0000A0, "Member 'FKuroBulletData::Move' has a wrong offset!");
static_assert(offsetof(FKuroBulletData, Render) == 0x0000E8, "Member 'FKuroBulletData::Render' has a wrong offset!");
static_assert(offsetof(FKuroBulletData, Logic) == 0x0001D0, "Member 'FKuroBulletData::Logic' has a wrong offset!");
static_assert(offsetof(FKuroBulletData, Children) == 0x000200, "Member 'FKuroBulletData::Children' has a wrong offset!");

// ScriptStruct KuroBullet.KSC_SkillKuroBullet
// 0x0010 (0x0010 - 0x0000)
struct FKSC_SkillKuroBullet final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         BulletId;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FKSC_SkillKuroBullet) == 0x000008, "Wrong alignment on FKSC_SkillKuroBullet");
static_assert(sizeof(FKSC_SkillKuroBullet) == 0x000010, "Wrong size on FKSC_SkillKuroBullet");
static_assert(offsetof(FKSC_SkillKuroBullet, Time) == 0x000000, "Member 'FKSC_SkillKuroBullet::Time' has a wrong offset!");
static_assert(offsetof(FKSC_SkillKuroBullet, BulletId) == 0x000008, "Member 'FKSC_SkillKuroBullet::BulletId' has a wrong offset!");

}

