#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KuroAnim_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class KuroAnim.KuroAnimInstance
// 0x00F0 (0x0820 - 0x0730)
#pragma pack(push, 0x1)
class alignas(0x10) UKuroAnimInstance : public UAnimInstance
{
public:
	uint8                                         Pad_730[0x68];                                     // 0x0730(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              TurnLimitForBoneRotateAnimNode;                    // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LookUpLimitForBoneRotateAnimNode;                  // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRollBackToOriginForBoneRotateAnimNode;            // 0x07A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopForBoneRotateAnimNode;                        // 0x07A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7AA[0x2];                                      // 0x07AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TurnAngleForBoneRotateAnimNode;                    // 0x07AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookUpAngleForBoneRotateAnimNode;                  // 0x07B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnOffsetForBoneRotateAnimNode;                   // 0x07B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookUpOffsetForBoneRotateAnimNode;                 // 0x07B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UAnimSequence*>       ExtraRibbonAnims;                                  // 0x07C0(0x0050)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_810[0x8];                                      // 0x0810(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float AngleConversion(const float& Angle);
	void BindBooleanVarToActorTag(bool& BooleanVarRef, class FName Tag);
	void BindBooleanVarToTag(bool& BooleanVarRef, const struct FGameplayTag& Tag);
	void BindComponentVarToAnimInstance(class UObject* Component, const class FString& ComponentVarName, const class FString& InstanceVarName);
	void BindEnumToRoleAnimInstance(class UObject* Component);
	void BindVarToCharacter(struct FVector& VelocityRef, struct FVector& ActorForwardVectorRef, struct FRotator& ActorRotationRef, struct FRotator& ControlRotationRef, struct FVector& CurrentAccelerationRef, bool& bMoveBlockRef);
	struct FVector2D CalculateAimMixed(const struct FVector& Speed, const struct FRotator& RoleRotator, class ACharacter* Character);
	struct FVector CalculateRelativeAcceleration(const struct FVector& Speed, const struct FVector& Acceleration, const struct FRotator& RoleRotator, class ACharacter* Character);
	void CalculateSpeedMixed(const struct FRotator& RoleRotator, const struct FRotator& AdditiveRotator, const struct FVector& Speed, class ACharacter* Character, class UCurveFloat*& Curve, const float& DeltaTime, float& CachedPercentFB, float& CachedPercentLR, struct FVeloctiyBlend& VelocityBlend);
	float CalculateStandRate(class UCurveFloat*& AngleToStepFrequency, const float& Slop, const float& Speed, const float& AnimWalkSpeed, const float& AnimRunSpeed, const float& SprintSpeed, const float& StepLengthMix);
	float CalculateStepLengthMixed(class UCurveFloat*& AngleToStepLength, class UCurveFloat*& WalkCurve, class UCurveFloat*& RunCurve, const float& Speed, const float& Slop);
	float CalculateWalkRunMixed(const int32& MoveState);
	void CalucateClimbOffset(class ACharacter*& Character, const struct FVector& IKDirection, const struct FVector& OffsetRelativeLocation, const struct FVector& BoneLocation, float OffsetCorrection, float TraceRadius, const struct FVector& MeshWorldLocation, const struct FRotator& QuatInverse, struct FVector& CachedLocation, struct FVector& CachedNormal, const float& IKCurveValue, const float& ClimbRadius, float& PrevFrameAlpha, struct FVector* OutOffset, struct FVector* OutNormal, bool* bSuccess);
	void ClimbIKProcess(class UAnimInstance* AnimInstance, const struct FVector& MeshWorldLocation, const struct FRotator& QuatInverse, const bool& IsClimbExitState, struct FVector& OverallOffsetLocation, float& ClimbIK, class ACharacter*& Character, class USkeletalMeshComponent*& Mesh, const float& ClimbRadius, const struct FVector& LFootOffsetRelativeLocation, struct FVector& LFootCachedLocation, struct FVector& LFootCachedNormal, struct FVector& LFootOffsetLocation, struct FVector& LFootNormalDirection, float& LFootPrevFrameAlpha, const struct FVector& RFootOffsetRelativeLocation, struct FVector& RFootCachedLocation, struct FVector& RFootCachedNormal, struct FVector& RFootOffsetLocation, struct FVector& RFootNormalDirection, float& RFootPrevFrameAlpha, const struct FVector& LHandOffsetRelativeLocation, struct FVector& LHandCachedLocation, struct FVector& LHandCachedNormal, struct FVector& LHandOffsetLocation, struct FVector& LHandNormalDirection, float& LHandPrevFrameAlpha, const struct FVector& RHandOffsetRelativeLocation, struct FVector& RHandCachedLocation, struct FVector& RHandCachedNormal, struct FVector& RHandOffsetLocation, struct FVector& RHandNormalDirection, float& RHandPrevFrameAlpha);
	class FString GetDebugAnimNodeString();
	void GroundIKProcess(const struct FVector& MeshWorldLocation, const float& DegMovementSlop, class ACharacter*& Character, class USkeletalMeshComponent*& Mesh, const bool& bUpHill, const bool& bDownHill, const float& Speed, const bool& HasMoveInput, bool& bLFootNeedIK, struct FVector& LFootOffsetLocation, struct FVector& LFootNormalDirection, struct FHitResult& LFootHitResult, bool& bRFootNeedIK, struct FVector& RFootOffsetLocation, struct FVector& RFootNormalDirection, struct FHitResult& RFootHitResult, bool UseCurveFootLocation);
	void IKInfoLerpProcess(const float& DeltaTime, const float& HipLerpSpeed, const struct FRotator& QuatInverse, const struct FVector& OverallOffsetLocation, struct FVector& OverallOffsetLocationBeUsed, struct FVector& LFootOffsetRelativeLocation, struct FVector& LFootNormalRelativeDirection, const struct FVector& LFootOffsetLocation, const struct FVector& LFootNormalDirection, struct FVector& RFootOffsetRelativeLocation, struct FVector& RFootNormalRelativeDirection, const struct FVector& RFootOffsetLocation, const struct FVector& RFootNormalDirection, struct FVector& LHandOffsetRelativeLocation, struct FVector& LHandNormalRelativeDirection, const struct FVector& LHandOffsetLocation, const struct FVector& LHandNormalDirection, struct FVector& RHandOffsetRelativeLocation, struct FVector& RHandNormalRelativeDirection, const struct FVector& RHandOffsetLocation, const struct FVector& RHandNormalDirection);
	struct FLeanAmount InterpLeanAmountTo(const struct FLeanAmount& Current, const struct FLeanAmount& Target, float DeltaTime, float InterpSpeed);
	float IsContainExtraRibbonAnims();
	void OnComponentStart();
	void RegisterActor(class ACharacter* Character);
	void RegisterExtraFollowOwnerAnimInstance(class UAnimInstance* AnimInstance);
	void ResigterExtraRibbenOwnerAnimInstance(class UAnimInstance* AnimInstance);
	void SetBoneRotateToLocationInfoRunBegin(float TurnAngle, float LookUpAngle, const struct FVector2D& TurnLimit, const struct FVector2D& LookUpLimit, float TurnOffset, float LookUpOffset);
	void SetBoneRotateToLocationInfoRunEnd();
	void SetBoneRotateToLocationInfoRunTick(float TurnAngle, float LookUpAngle);
	void SetBoneRotateToLocationInfoStopBegin();
	void SetBoneRotateToLocationInfoStopEnd();
	void SetDebugTraceType(EDrawDebugTrace GroundTrace, EDrawDebugTrace ClimbTrace);
	void SetFootOffset(const struct FVector& SkeletionAbsoluteLocation, const struct FVector& IKDirection, const float& BenchMarkDepth, const float& RotationCorrectedDistance, class ACharacter*& Character, class USkeletalMeshComponent*& Mesh, const bool& HasMoveInput, bool& bNeedIK, struct FVector& OffsetLocation, struct FVector& NormalDirection, struct FHitResult& OutHitResult);
	void StartABP();
	void UnRegisterActorAndResetInstance();
	void UpdateABP(float DeltaSeconds);
	void UpdateAdditiveBlendInfo(class UAnimInstance* AnimInstance, const bool& bUsingAdditiveBlend, const bool& bUsingWholeBodyBlend, float& AdditiveBlendAlpha, struct FAdditiveBlendAlpha& Pelvis, struct FAdditiveBlendAlpha& Spine, struct FAdditiveBlendAlpha& Spine1, struct FAdditiveBlendAlpha& Spine2, struct FAdditiveBlendAlpha& Head, struct FAdditiveBlendAlpha& ArmL, struct FAdditiveBlendAlpha& ArmR, struct FAdditiveBlendAlpha& Leg);
	void UpdateBattleIdle(const float& BattleIdleTime, bool& bBattleIdle);
	void UpdateBindRoleInfo();
	void UpdateBooleanVar();
	void UpdateCameraStateMoveInfo(const struct FVector& Speed, class ACharacter*& Character, const struct FRotator& RoleRotator, const struct FVector& Acceleration, float& RotatorMixed, const float& DeltaTime, struct FVector& RelativeAcceleration, struct FLeanAmount& LeanAmount, const float& GroundLeanAmountLerpSpeed, const struct FRotator& AimRotator, float& AimAngle);
	void UpdateCharacterVar();
	void UpdateIKinfoInClimbState(class UAnimInstance* AnimInstance, const struct FVector& MeshWorldLocation, const struct FRotator& QuatInverse, struct FVector& OverallOffsetLocation, float& ClimbIK, const float& FastClimbDirection, const bool& IsFastClimbState, class ACharacter*& Character, class USkeletalMeshComponent*& Mesh, float& HipLerpSpeed, const float& Speed, const bool& HasMoveInput, const bool& IsClimbExitState, const float& ClimbRadius, const struct FVector& LFootOffsetRelativeLocation, struct FVector& LFootCachedLocation, struct FVector& LFootCachedNormal, struct FVector& LFootOffsetLocation, struct FVector& LFootNormalDirection, float& LFootPrevFrameAlpha, const struct FVector& RFootOffsetRelativeLocation, struct FVector& RFootCachedLocation, struct FVector& RFootCachedNormal, struct FVector& RFootOffsetLocation, struct FVector& RFootNormalDirection, float& RFootPrevFrameAlpha, const struct FVector& LHandOffsetRelativeLocation, struct FVector& LHandCachedLocation, struct FVector& LHandCachedNormal, struct FVector& LHandOffsetLocation, struct FVector& LHandNormalDirection, float& LHandPrevFrameAlpha, const struct FVector& RHandOffsetRelativeLocation, struct FVector& RHandCachedLocation, struct FVector& RHandCachedNormal, struct FVector& RHandOffsetLocation, struct FVector& RHandNormalDirection, float& RHandPrevFrameAlpha);
	void UpdateIKInfoInGroundState(const bool& HasWallForward, const struct FVector& MeshWorldLocation, const bool& IsMoving, const float& DegMovementSlop, bool& bUpHill, bool& bDownHill, class ACharacter*& Character, class USkeletalMeshComponent*& Mesh, const float& Speed, const bool& HasMoveInput, const float& RunWalkMix, struct FVector& OverallOffsetLocation, float& HipLerpSpeed, bool& bLFootNeedIK, struct FVector& LFootOffsetLocation, struct FVector& LFootNormalDirection, struct FHitResult& LFootHitResult, bool& bRFootNeedIK, struct FVector& RFootOffsetLocation, struct FVector& RFootNormalDirection, struct FHitResult& RFootHitResult, bool UseCurveFootLocation);
	void UpdateIKinfoInOtherState(class ACharacter*& Character, struct FVector& OverallOffsetLocation, struct FVector& LFootOffsetLocation, struct FVector& LFootNormalDirection, struct FVector& RFootOffsetLocation, struct FVector& RFootNormalDirection, struct FVector& LHandNormalDirection, struct FVector& RHandNormalDirection, float& HipLerpSpeed);
	void UpdateIKInfoLocalValue(class ACharacter* Character, struct FRotator& MeshQuatInverse, struct FVector& MeshWorldLocation);
	void UpdateMoveInfoMixed(float& WalkRunMixed, const float& DeltaTime, const float& Slop, class UCurveFloat*& AngleToStepFrequency, class UCurveFloat*& AngleToStepLength, class UCurveFloat*& WalkCurve, class UCurveFloat*& RunCurve, const float& SpeedSize, float& StepLengthMixed, const float& AnimWalkSpeed, const float& AnimRunSpeed, const float& SprintSpeed, float& StandRate);
	void UpdateRoleInfo(bool& StateGround, bool& StateGroundSprint, bool& StateGroundWalk, bool& StateGroundRun, bool& StateRunStop, bool& StateSprintStop, bool& StateWalkStop, bool& RunStop, bool& StateClimb, bool& StateAir, bool& StateAirGlide, bool& StateWater, bool& StateView, bool& StateAim, bool& StateFace);
	void UpdateSkillMoveInfo(const float& DeltaTime, const struct FRotator& RoleRotator, const struct FVector& Speed, class ACharacter*& Character, float& RotatorMixed, const struct FVector& Acceleration, struct FVector& RelativeAcceleration, struct FLeanAmount& LeanAmount, const float& GroundLeanAmountLerpSpeed, const struct FRotator& AimRotator, float& AimAngle, struct FVector2D& AimMoveMixed, const float& RotatorSpeed, class AActor* SkillTarget, const struct FVectorDouble& CachedActorLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroAnimInstance">();
	}
	static class UKuroAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAnimInstance>();
	}
};
#pragma pack(pop)
static_assert(alignof(UKuroAnimInstance) == 0x000010, "Wrong alignment on UKuroAnimInstance");
static_assert(sizeof(UKuroAnimInstance) == 0x000820, "Wrong size on UKuroAnimInstance");
static_assert(offsetof(UKuroAnimInstance, TurnLimitForBoneRotateAnimNode) == 0x000798, "Member 'UKuroAnimInstance::TurnLimitForBoneRotateAnimNode' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstance, LookUpLimitForBoneRotateAnimNode) == 0x0007A0, "Member 'UKuroAnimInstance::LookUpLimitForBoneRotateAnimNode' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstance, bRollBackToOriginForBoneRotateAnimNode) == 0x0007A8, "Member 'UKuroAnimInstance::bRollBackToOriginForBoneRotateAnimNode' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstance, bStopForBoneRotateAnimNode) == 0x0007A9, "Member 'UKuroAnimInstance::bStopForBoneRotateAnimNode' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstance, TurnAngleForBoneRotateAnimNode) == 0x0007AC, "Member 'UKuroAnimInstance::TurnAngleForBoneRotateAnimNode' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstance, LookUpAngleForBoneRotateAnimNode) == 0x0007B0, "Member 'UKuroAnimInstance::LookUpAngleForBoneRotateAnimNode' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstance, TurnOffsetForBoneRotateAnimNode) == 0x0007B4, "Member 'UKuroAnimInstance::TurnOffsetForBoneRotateAnimNode' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstance, LookUpOffsetForBoneRotateAnimNode) == 0x0007B8, "Member 'UKuroAnimInstance::LookUpOffsetForBoneRotateAnimNode' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstance, ExtraRibbonAnims) == 0x0007C0, "Member 'UKuroAnimInstance::ExtraRibbonAnims' has a wrong offset!");

// Class KuroAnim.KuroAnimInstanceChar
// 0x0120 (0x0940 - 0x0820)
class UKuroAnimInstanceChar : public UKuroAnimInstance
{
public:
	class UAbpLogicParams*                        LogicParams;                                       // 0x0818(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABaseCharacter*                         BaseCharacter;                                     // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_828[0x8];                                      // 0x0828(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaTime;                                         // 0x0830(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EntityId;                                          // 0x0834(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutonomousProxy;                                // 0x0838(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_839[0x3];                                      // 0x0839(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Velocity;                                          // 0x083C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_848[0xC];                                      // 0x0848(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsMovedLocation;                                  // 0x0854(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_855[0x1B];                                     // 0x0855(0x001B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Acceleration;                                      // 0x0870(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ActorForward;                                      // 0x087C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_888[0x4];                                      // 0x0888(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OnJumpSpeed;                                       // 0x088C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStunned;                                          // 0x0890(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_891[0x2F];                                     // 0x0891(0x002F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               LowerBodyRotator;                                  // 0x08C0(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8CC[0x4];                                      // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          LocationProxy;                                     // 0x08D0(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FTransform>          CachedBones;                                       // 0x08E8(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	ESightLockMode                                SightLockMode;                                     // 0x0938(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_939[0x7];                                      // 0x0939(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroAnimInstanceChar">();
	}
	static class UKuroAnimInstanceChar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAnimInstanceChar>();
	}
};
static_assert(alignof(UKuroAnimInstanceChar) == 0x000010, "Wrong alignment on UKuroAnimInstanceChar");
static_assert(sizeof(UKuroAnimInstanceChar) == 0x000940, "Wrong size on UKuroAnimInstanceChar");
static_assert(offsetof(UKuroAnimInstanceChar, LogicParams) == 0x000818, "Member 'UKuroAnimInstanceChar::LogicParams' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, BaseCharacter) == 0x000820, "Member 'UKuroAnimInstanceChar::BaseCharacter' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, DeltaTime) == 0x000830, "Member 'UKuroAnimInstanceChar::DeltaTime' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, EntityId) == 0x000834, "Member 'UKuroAnimInstanceChar::EntityId' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, bIsAutonomousProxy) == 0x000838, "Member 'UKuroAnimInstanceChar::bIsAutonomousProxy' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, Velocity) == 0x00083C, "Member 'UKuroAnimInstanceChar::Velocity' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, bIsMovedLocation) == 0x000854, "Member 'UKuroAnimInstanceChar::bIsMovedLocation' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, Acceleration) == 0x000870, "Member 'UKuroAnimInstanceChar::Acceleration' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, ActorForward) == 0x00087C, "Member 'UKuroAnimInstanceChar::ActorForward' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, OnJumpSpeed) == 0x00088C, "Member 'UKuroAnimInstanceChar::OnJumpSpeed' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, bStunned) == 0x000890, "Member 'UKuroAnimInstanceChar::bStunned' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, LowerBodyRotator) == 0x0008C0, "Member 'UKuroAnimInstanceChar::LowerBodyRotator' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, LocationProxy) == 0x0008D0, "Member 'UKuroAnimInstanceChar::LocationProxy' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, CachedBones) == 0x0008E8, "Member 'UKuroAnimInstanceChar::CachedBones' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceChar, SightLockMode) == 0x000938, "Member 'UKuroAnimInstanceChar::SightLockMode' has a wrong offset!");

// Class KuroAnim.KuroAdjustableBoxComponent
// 0x0030 (0x0580 - 0x0550)
class UKuroAdjustableBoxComponent final : public UBoxComponent
{
public:
	TArray<class FName>                           BindSocketNames;                                   // 0x0550(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         AddExtent;                                         // 0x0560(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinExtent;                                         // 0x0564(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxExtent;                                         // 0x0568(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAdjustBoxType                                AdjustBoxType;                                     // 0x056C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56D[0x13];                                     // 0x056D(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroAdjustableBoxComponent">();
	}
	static class UKuroAdjustableBoxComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAdjustableBoxComponent>();
	}
};
static_assert(alignof(UKuroAdjustableBoxComponent) == 0x000010, "Wrong alignment on UKuroAdjustableBoxComponent");
static_assert(sizeof(UKuroAdjustableBoxComponent) == 0x000580, "Wrong size on UKuroAdjustableBoxComponent");
static_assert(offsetof(UKuroAdjustableBoxComponent, BindSocketNames) == 0x000550, "Member 'UKuroAdjustableBoxComponent::BindSocketNames' has a wrong offset!");
static_assert(offsetof(UKuroAdjustableBoxComponent, AddExtent) == 0x000560, "Member 'UKuroAdjustableBoxComponent::AddExtent' has a wrong offset!");
static_assert(offsetof(UKuroAdjustableBoxComponent, MinExtent) == 0x000564, "Member 'UKuroAdjustableBoxComponent::MinExtent' has a wrong offset!");
static_assert(offsetof(UKuroAdjustableBoxComponent, MaxExtent) == 0x000568, "Member 'UKuroAdjustableBoxComponent::MaxExtent' has a wrong offset!");
static_assert(offsetof(UKuroAdjustableBoxComponent, AdjustBoxType) == 0x00056C, "Member 'UKuroAdjustableBoxComponent::AdjustBoxType' has a wrong offset!");

// Class KuroAnim.KuroAnimInstanceNpc
// 0x0030 (0x0970 - 0x0940)
class UKuroAnimInstanceNpc final : public UKuroAnimInstanceChar
{
public:
	struct FVector                                SightDirection;                                    // 0x0940(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SightAlpha;                                        // 0x094C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CameraModeType;                                    // 0x0950(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBeingCaptured;                                  // 0x0954(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayKnockUpAnim;                                  // 0x0955(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHeadIKReturnToOrigin;                             // 0x0956(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECharMoveStateType                            CharacterMoveStateType;                            // 0x0957(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECharPositionStateType                        CharacterPositionStateType;                        // 0x0958(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoveDirection                                MovementDirection;                                 // 0x0959(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWalkPosture                                  WalkingPosture;                                    // 0x095A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_95B[0x1];                                      // 0x095B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpdateDeltaSeconds;                                // 0x095C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldDeltaSeconds;                                 // 0x0960(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIdleThreeState;                                   // 0x0964(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCommonDebugState;                                 // 0x0965(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAirState;                                       // 0x0966(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLowerHalfUniversalFusionState;                    // 0x0967(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInBattleState;                                    // 0x0968(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayEnterBattleState;                             // 0x0969(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_96A[0x6];                                      // 0x096A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroAnimInstanceNpc">();
	}
	static class UKuroAnimInstanceNpc* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAnimInstanceNpc>();
	}
};
static_assert(alignof(UKuroAnimInstanceNpc) == 0x000010, "Wrong alignment on UKuroAnimInstanceNpc");
static_assert(sizeof(UKuroAnimInstanceNpc) == 0x000970, "Wrong size on UKuroAnimInstanceNpc");
static_assert(offsetof(UKuroAnimInstanceNpc, SightDirection) == 0x000940, "Member 'UKuroAnimInstanceNpc::SightDirection' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, SightAlpha) == 0x00094C, "Member 'UKuroAnimInstanceNpc::SightAlpha' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, CameraModeType) == 0x000950, "Member 'UKuroAnimInstanceNpc::CameraModeType' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, bIsBeingCaptured) == 0x000954, "Member 'UKuroAnimInstanceNpc::bIsBeingCaptured' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, bPlayKnockUpAnim) == 0x000955, "Member 'UKuroAnimInstanceNpc::bPlayKnockUpAnim' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, bHeadIKReturnToOrigin) == 0x000956, "Member 'UKuroAnimInstanceNpc::bHeadIKReturnToOrigin' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, CharacterMoveStateType) == 0x000957, "Member 'UKuroAnimInstanceNpc::CharacterMoveStateType' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, CharacterPositionStateType) == 0x000958, "Member 'UKuroAnimInstanceNpc::CharacterPositionStateType' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, MovementDirection) == 0x000959, "Member 'UKuroAnimInstanceNpc::MovementDirection' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, WalkingPosture) == 0x00095A, "Member 'UKuroAnimInstanceNpc::WalkingPosture' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, UpdateDeltaSeconds) == 0x00095C, "Member 'UKuroAnimInstanceNpc::UpdateDeltaSeconds' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, WorldDeltaSeconds) == 0x000960, "Member 'UKuroAnimInstanceNpc::WorldDeltaSeconds' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, bIdleThreeState) == 0x000964, "Member 'UKuroAnimInstanceNpc::bIdleThreeState' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, bCommonDebugState) == 0x000965, "Member 'UKuroAnimInstanceNpc::bCommonDebugState' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, bInAirState) == 0x000966, "Member 'UKuroAnimInstanceNpc::bInAirState' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, bLowerHalfUniversalFusionState) == 0x000967, "Member 'UKuroAnimInstanceNpc::bLowerHalfUniversalFusionState' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, bInBattleState) == 0x000968, "Member 'UKuroAnimInstanceNpc::bInBattleState' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceNpc, bPlayEnterBattleState) == 0x000969, "Member 'UKuroAnimInstanceNpc::bPlayEnterBattleState' has a wrong offset!");

// Class KuroAnim.KuroAdjustableCapsuleComponent
// 0x0040 (0x0590 - 0x0550)
class UKuroAdjustableCapsuleComponent final : public UCapsuleComponent
{
public:
	TArray<class FName>                           BindSocketNames;                                   // 0x0548(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         AddRadius;                                         // 0x0558(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRadius;                                         // 0x055C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRadius;                                         // 0x0560(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAdjustCapsuleType                            AdjustCapsuleType;                                 // 0x0564(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_565[0x2B];                                     // 0x0565(0x002B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroAdjustableCapsuleComponent">();
	}
	static class UKuroAdjustableCapsuleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAdjustableCapsuleComponent>();
	}
};
static_assert(alignof(UKuroAdjustableCapsuleComponent) == 0x000010, "Wrong alignment on UKuroAdjustableCapsuleComponent");
static_assert(sizeof(UKuroAdjustableCapsuleComponent) == 0x000590, "Wrong size on UKuroAdjustableCapsuleComponent");
static_assert(offsetof(UKuroAdjustableCapsuleComponent, BindSocketNames) == 0x000548, "Member 'UKuroAdjustableCapsuleComponent::BindSocketNames' has a wrong offset!");
static_assert(offsetof(UKuroAdjustableCapsuleComponent, AddRadius) == 0x000558, "Member 'UKuroAdjustableCapsuleComponent::AddRadius' has a wrong offset!");
static_assert(offsetof(UKuroAdjustableCapsuleComponent, MinRadius) == 0x00055C, "Member 'UKuroAdjustableCapsuleComponent::MinRadius' has a wrong offset!");
static_assert(offsetof(UKuroAdjustableCapsuleComponent, MaxRadius) == 0x000560, "Member 'UKuroAdjustableCapsuleComponent::MaxRadius' has a wrong offset!");
static_assert(offsetof(UKuroAdjustableCapsuleComponent, AdjustCapsuleType) == 0x000564, "Member 'UKuroAdjustableCapsuleComponent::AdjustCapsuleType' has a wrong offset!");

// Class KuroAnim.KuroAnimInstancePhyCloth
// 0x0040 (0x0770 - 0x0730)
class UKuroAnimInstancePhyCloth final : public UAnimInstance
{
public:
	bool                                          bEnableFormSwitch;                                 // 0x0730(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_731[0x7];                                      // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   FormSkelMeshRefs;                                  // 0x0738(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_748[0x28];                                     // 0x0748(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroAnimInstancePhyCloth">();
	}
	static class UKuroAnimInstancePhyCloth* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAnimInstancePhyCloth>();
	}
};
static_assert(alignof(UKuroAnimInstancePhyCloth) == 0x000010, "Wrong alignment on UKuroAnimInstancePhyCloth");
static_assert(sizeof(UKuroAnimInstancePhyCloth) == 0x000770, "Wrong size on UKuroAnimInstancePhyCloth");
static_assert(offsetof(UKuroAnimInstancePhyCloth, bEnableFormSwitch) == 0x000730, "Member 'UKuroAnimInstancePhyCloth::bEnableFormSwitch' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstancePhyCloth, FormSkelMeshRefs) == 0x000738, "Member 'UKuroAnimInstancePhyCloth::FormSkelMeshRefs' has a wrong offset!");

// Class KuroAnim.KuroAnimConfig
// 0x0008 (0x0038 - 0x0030)
class UKuroAnimConfig final : public UObject
{
public:
	float                                         DefaultFootOffset;                                 // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultHighHeelsOffset;                            // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroAnimConfig">();
	}
	static class UKuroAnimConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAnimConfig>();
	}
};
static_assert(alignof(UKuroAnimConfig) == 0x000008, "Wrong alignment on UKuroAnimConfig");
static_assert(sizeof(UKuroAnimConfig) == 0x000038, "Wrong size on UKuroAnimConfig");
static_assert(offsetof(UKuroAnimConfig, DefaultFootOffset) == 0x000030, "Member 'UKuroAnimConfig::DefaultFootOffset' has a wrong offset!");
static_assert(offsetof(UKuroAnimConfig, DefaultHighHeelsOffset) == 0x000034, "Member 'UKuroAnimConfig::DefaultHighHeelsOffset' has a wrong offset!");

// Class KuroAnim.KuroAnimInstanceMonster
// 0x0060 (0x09A0 - 0x0940)
class UKuroAnimInstanceMonster final : public UKuroAnimInstanceChar
{
public:
	TArray<class FName>                           HitBonesList;                                      // 0x0940(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                SightDirection;                                    // 0x0950(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SightAlpha;                                        // 0x095C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SightDirectionRightAngle;                          // 0x0960(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SightDirectionUpAngle;                             // 0x0964(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HateLocation;                                      // 0x0968(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBeingCaptured;                                  // 0x0974(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayKnockUpAnim;                                  // 0x0975(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHeadIKReturnToOrigin;                             // 0x0976(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECharMoveStateType                            CharacterMoveStateType;                            // 0x0977(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECharPositionStateType                        CharacterPositionStateType;                        // 0x0978(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAcceptNewHit;                                     // 0x0979(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnterFk;                                          // 0x097A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitInAir;                                         // 0x097B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HitAnimType;                                       // 0x097C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoveDirection                                MovementDirection;                                 // 0x0980(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWalkPosture                                  WalkingPosture;                                    // 0x0981(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_982[0x2];                                      // 0x0982(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpdateDeltaSeconds;                                // 0x0984(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldDeltaSeconds;                                 // 0x0988(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIdleThreeState;                                   // 0x098C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCommonDebugState;                                 // 0x098D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAirState;                                       // 0x098E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLowerHalfUniversalFusionState;                    // 0x098F(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInBattleState;                                    // 0x0990(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayEnterBattleState;                             // 0x0991(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_992[0xE];                                      // 0x0992(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroAnimInstanceMonster">();
	}
	static class UKuroAnimInstanceMonster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAnimInstanceMonster>();
	}
};
static_assert(alignof(UKuroAnimInstanceMonster) == 0x000010, "Wrong alignment on UKuroAnimInstanceMonster");
static_assert(sizeof(UKuroAnimInstanceMonster) == 0x0009A0, "Wrong size on UKuroAnimInstanceMonster");
static_assert(offsetof(UKuroAnimInstanceMonster, HitBonesList) == 0x000940, "Member 'UKuroAnimInstanceMonster::HitBonesList' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, SightDirection) == 0x000950, "Member 'UKuroAnimInstanceMonster::SightDirection' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, SightAlpha) == 0x00095C, "Member 'UKuroAnimInstanceMonster::SightAlpha' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, SightDirectionRightAngle) == 0x000960, "Member 'UKuroAnimInstanceMonster::SightDirectionRightAngle' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, SightDirectionUpAngle) == 0x000964, "Member 'UKuroAnimInstanceMonster::SightDirectionUpAngle' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, HateLocation) == 0x000968, "Member 'UKuroAnimInstanceMonster::HateLocation' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, bIsBeingCaptured) == 0x000974, "Member 'UKuroAnimInstanceMonster::bIsBeingCaptured' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, bPlayKnockUpAnim) == 0x000975, "Member 'UKuroAnimInstanceMonster::bPlayKnockUpAnim' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, bHeadIKReturnToOrigin) == 0x000976, "Member 'UKuroAnimInstanceMonster::bHeadIKReturnToOrigin' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, CharacterMoveStateType) == 0x000977, "Member 'UKuroAnimInstanceMonster::CharacterMoveStateType' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, CharacterPositionStateType) == 0x000978, "Member 'UKuroAnimInstanceMonster::CharacterPositionStateType' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, bAcceptNewHit) == 0x000979, "Member 'UKuroAnimInstanceMonster::bAcceptNewHit' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, bEnterFk) == 0x00097A, "Member 'UKuroAnimInstanceMonster::bEnterFk' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, bHitInAir) == 0x00097B, "Member 'UKuroAnimInstanceMonster::bHitInAir' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, HitAnimType) == 0x00097C, "Member 'UKuroAnimInstanceMonster::HitAnimType' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, MovementDirection) == 0x000980, "Member 'UKuroAnimInstanceMonster::MovementDirection' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, WalkingPosture) == 0x000981, "Member 'UKuroAnimInstanceMonster::WalkingPosture' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, UpdateDeltaSeconds) == 0x000984, "Member 'UKuroAnimInstanceMonster::UpdateDeltaSeconds' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, WorldDeltaSeconds) == 0x000988, "Member 'UKuroAnimInstanceMonster::WorldDeltaSeconds' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, bIdleThreeState) == 0x00098C, "Member 'UKuroAnimInstanceMonster::bIdleThreeState' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, bCommonDebugState) == 0x00098D, "Member 'UKuroAnimInstanceMonster::bCommonDebugState' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, bInAirState) == 0x00098E, "Member 'UKuroAnimInstanceMonster::bInAirState' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, bLowerHalfUniversalFusionState) == 0x00098F, "Member 'UKuroAnimInstanceMonster::bLowerHalfUniversalFusionState' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, bInBattleState) == 0x000990, "Member 'UKuroAnimInstanceMonster::bInBattleState' has a wrong offset!");
static_assert(offsetof(UKuroAnimInstanceMonster, bPlayEnterBattleState) == 0x000991, "Member 'UKuroAnimInstanceMonster::bPlayEnterBattleState' has a wrong offset!");

// Class KuroAnim.KuroAnimInstanceRole
// 0x0340 (0x0C80 - 0x0940)
class UKuroAnimInstanceRole : public UKuroAnimInstanceChar
{
public:
	TArray<int32>                                 ValidPerformanceIndexes;                           // 0x0940(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         FloorSpeed;                                        // 0x0950(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_954[0x1C];                                     // 0x0954(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCanbeInterrupt;                                   // 0x0970(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMoveBlock;                                        // 0x0971(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_972[0x2];                                      // 0x0972(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeSeconds;                                       // 0x0974(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_978[0x4];                                      // 0x0978(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsNotNPC;                                         // 0x097C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_97D[0x3];                                      // 0x097D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ChangeRoleCount;                                   // 0x0980(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_984[0x1];                                      // 0x0984(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bHasNPCTag;                                        // 0x0985(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsGoingToMove;                                    // 0x0986(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_987[0x5];                                      // 0x0987(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TurnMix;                                           // 0x098C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVeloctiyBlend                         SpeedMix;                                          // 0x0990(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         LerpSpeedAlpha;                                    // 0x09A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              AimMoveMix;                                        // 0x09A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalAccel;                                        // 0x09AC(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLeanAmount                            LeanAmount;                                        // 0x09B8(0x0008)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EMoveDirection                                MoveDirection;                                     // 0x09C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C1[0x3];                                      // 0x09C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GroundMovePlayRate;                                // 0x09C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WalkRunMix;                                        // 0x09C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepSizeMix;                                       // 0x09CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVeloctiyBlend                         AccelLerpMix;                                      // 0x09D0(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         AimYaw;                                            // 0x09E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimPitch;                                          // 0x09E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFightStand;                                     // 0x09E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9E9[0x3];                                      // 0x09E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              MoveMix;                                           // 0x09EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CachePercentLR;                                    // 0x09F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CachePercentFB;                                    // 0x09F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStandTurnType                                StandTurnType;                                     // 0x09FC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9FD[0x3];                                      // 0x09FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LandSpeedIndex;                                    // 0x0A00(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallingSpeed;                                      // 0x0A04(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForecastLandWeight;                                // 0x0A08(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AirVelocity;                                       // 0x0A0C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AirTargetYaw;                                      // 0x0A18(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                GlideMix;                                          // 0x0A1C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlideMix;                                          // 0x0A28(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2C[0x18];                                     // 0x0A2C(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AirSlideMix;                                       // 0x0A44(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HookRopeMix;                                       // 0x0A50(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
