#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroCollision

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KuroCollision_structs.hpp"


namespace SDK
{

// Class KuroCollision.CollisionClusterComponent
// 0x0110 (0x0640 - 0x0530)
class UCollisionClusterComponent final : public UPrimitiveComponent
{
public:
	uint8                                         Pad_528[0x80];                                     // 0x0528(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftObjectPath>                StaticMeshPathNames;                               // 0x05A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UPhysicalMaterial*>              PhysicalMaterials;                                 // 0x05B8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FKAggregateGeom>                AggGeometries;                                     // 0x05C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UBodySetup*>                     BodySetups;                                        // 0x05D8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5E8[0x10];                                     // 0x05E8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 BodySetupComplexPhysicalMaterialNums;              // 0x05F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_608[0x10];                                     // 0x0608(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoxSphereBounds                       RelativeBounds;                                    // 0x0618(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_634[0xC];                                      // 0x0634(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CollisionClusterComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CollisionClusterComponent")
	}
	static class UCollisionClusterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollisionClusterComponent>();
	}
};
DUMPER7_ASSERTS_UCollisionClusterComponent;

// Class KuroCollision.KuroBodySetupLibrary
// 0x0000 (0x0030 - 0x0030)
class UKuroBodySetupLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddClearWpBodySetupBlackList(const class FName& StaticMeshName);
	static void EmptyClearWpBodySetupBlackList();
	static void InitClearWpBodySetupBlackList(const TSet<class FName>& InClearWpBodySetupBlackList);
	static void LoadClearWpBodySetupBlackList();
	static void RemoveClearWpBodySetupBlackList(const class FName& StaticMeshName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBodySetupLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBodySetupLibrary")
	}
	static class UKuroBodySetupLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroBodySetupLibrary>();
	}
};
DUMPER7_ASSERTS_UKuroBodySetupLibrary;

// Class KuroCollision.KuroCollisionLibrary
// 0x0000 (0x0030 - 0x0030)
class UKuroCollisionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool ActorHasTag(class AActor* InActor, const class FName& Tag, int32 InstanceIndex);
	static bool CanCharacterStandOn(class UPrimitiveComponent* PrimitiveComponent, int32 InstanceIndex);
	static bool CanCharacterStepUp(class UPrimitiveComponent* PrimitiveComponent, class APawn* Pawn, int32 InstanceIndex);
	static struct FBodyInstance GetBodyInstance(const class UKuroHitResult* HitResult, int32 HitIndex);
	static class FName GetCollisionProfileName(class UPrimitiveComponent* PrimitiveComponent, int32 InstanceIndex);
	static ECollisionResponse GetCollisionResponseToChannel(class UPrimitiveComponent* PrimitiveComponent, ECollisionChannel Channel, int32 InstanceIndex);
	static void GetOverlappingComponents(class UPrimitiveComponent* PrimitiveComponent, TArray<class UPrimitiveComponent*>* OutOverlappingComponents, TArray<int32>* OutOverlappingBodyIndices);
	static const struct FWalkableSlopeOverride GetWalkableSlopeOverride(class UPrimitiveComponent* PrimitiveComponent, int32 InstanceIndex);
	static void SetCollisionResponseToChannel(class UPrimitiveComponent* PrimitiveComponent, const ECollisionChannel Channel, const ECollisionResponse NewResponse, const int32 InstanceIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroCollisionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroCollisionLibrary")
	}
	static class UKuroCollisionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroCollisionLibrary>();
	}
};
DUMPER7_ASSERTS_UKuroCollisionLibrary;

// Class KuroCollision.KuroCollisionSubSystem
// 0x00B8 (0x00F0 - 0x0038)
class UKuroCollisionSubSystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FSoftObjectPath, struct FKuroBodySetupInfo> CollisionClusterBodySetups;              // 0x0040(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x60];                                      // 0x0090(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroCollisionSubSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroCollisionSubSystem")
	}
	static class UKuroCollisionSubSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroCollisionSubSystem>();
	}
};
DUMPER7_ASSERTS_UKuroCollisionSubSystem;

// Class KuroCollision.KuroLandscapeHeightfieldCollisionComponent
// 0x0080 (0x05B0 - 0x0530)
class UKuroLandscapeHeightfieldCollisionComponent final : public UPrimitiveComponent
{
public:
	uint8                                         Pad_528[0x8];                                      // 0x0528(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULandscapeLayerInfoObject*>      ComponentLayerInfos;                               // 0x0530(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         SectionBaseX;                                      // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SectionBaseY;                                      // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CollisionSizeQuads;                                // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CollisionScale;                                    // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SimpleCollisionSizeQuads;                          // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  HeightfieldGuid;                                   // 0x0554(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBox                                   CachedLocalBox;                                    // 0x0564(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_580[0x10];                                     // 0x0580(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicalMaterial*>              CookedPhysicalMaterials;                           // 0x0590(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A0[0x10];                                     // 0x05A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroLandscapeHeightfieldCollisionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroLandscapeHeightfieldCollisionComponent")
	}
	static class UKuroLandscapeHeightfieldCollisionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroLandscapeHeightfieldCollisionComponent>();
	}
};
DUMPER7_ASSERTS_UKuroLandscapeHeightfieldCollisionComponent;

// Class KuroCollision.LevelCollisionActor
// 0x0008 (0x02B8 - 0x02B0)
class ALevelCollisionActor final : public AActor
{
public:
	class UCollisionClusterComponent*             CollisionClusterComponent;                         // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelCollisionActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelCollisionActor")
	}
	static class ALevelCollisionActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelCollisionActor>();
	}
};
DUMPER7_ASSERTS_ALevelCollisionActor;

// Class KuroCollision.LevelLandscapeCollisionActor
// 0x0010 (0x02C0 - 0x02B0)
class ALevelLandscapeCollisionActor final : public AActor
{
public:
	class UPhysicalMaterial*                      DefaultPhysMaterial;                               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroLandscapeHeightfieldCollisionComponent* CollisionComponent;                           // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelLandscapeCollisionActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelLandscapeCollisionActor")
	}
	static class ALevelLandscapeCollisionActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelLandscapeCollisionActor>();
	}
};
DUMPER7_ASSERTS_ALevelLandscapeCollisionActor;

}

