#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroAudioMaterial

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KuroAudioMaterial.KuroAudioMaterialSettings.GetFootstepTextureName
// 0x0010 (0x0010 - 0x0000)
struct KuroAudioMaterialSettings_GetFootstepTextureName final
{
public:
	EPhysicalSurface                              SurfaceType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroAudioMaterialSettings_GetFootstepTextureName) == 0x000004, "Wrong alignment on KuroAudioMaterialSettings_GetFootstepTextureName");
static_assert(sizeof(KuroAudioMaterialSettings_GetFootstepTextureName) == 0x000010, "Wrong size on KuroAudioMaterialSettings_GetFootstepTextureName");
static_assert(offsetof(KuroAudioMaterialSettings_GetFootstepTextureName, SurfaceType) == 0x000000, "Member 'KuroAudioMaterialSettings_GetFootstepTextureName::SurfaceType' has a wrong offset!");
static_assert(offsetof(KuroAudioMaterialSettings_GetFootstepTextureName, ReturnValue) == 0x000004, "Member 'KuroAudioMaterialSettings_GetFootstepTextureName::ReturnValue' has a wrong offset!");

// Function KuroAudioMaterial.KuroAudioMaterialSubsystem.QueryInsideAnyFoliageInstance
// 0x0040 (0x0040 - 0x0000)
struct KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance final
{
public:
	struct FVectorDouble                          InQueryLocation;                                   // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutInstancedNames;                                 // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      OutPhysicalMaterial;                               // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   OutStaicMeshComponent;                             // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance) == 0x000008, "Wrong alignment on KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance");
static_assert(sizeof(KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance) == 0x000040, "Wrong size on KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance");
static_assert(offsetof(KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance, InQueryLocation) == 0x000000, "Member 'KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance::InQueryLocation' has a wrong offset!");
static_assert(offsetof(KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance, OutInstancedNames) == 0x000018, "Member 'KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance::OutInstancedNames' has a wrong offset!");
static_assert(offsetof(KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance, OutPhysicalMaterial) == 0x000028, "Member 'KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance::OutPhysicalMaterial' has a wrong offset!");
static_assert(offsetof(KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance, OutStaicMeshComponent) == 0x000030, "Member 'KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance::OutStaicMeshComponent' has a wrong offset!");
static_assert(offsetof(KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance, ReturnValue) == 0x000038, "Member 'KuroAudioMaterialSubsystem_QueryInsideAnyFoliageInstance::ReturnValue' has a wrong offset!");

// Function KuroAudioMaterial.KuroAudioMaterialSubsystem.QueryOverlapAnyFoliageInstance
// 0x0040 (0x0040 - 0x0000)
struct KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance final
{
public:
	struct FBox                                   InQueryBounds;                                     // 0x0000(0x001C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OutInstancedNames;                                 // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicalMaterial*                      OutPhysicalMaterial;                               // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   OutStaicMeshComponent;                             // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance) == 0x000008, "Wrong alignment on KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance");
static_assert(sizeof(KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance) == 0x000040, "Wrong size on KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance");
static_assert(offsetof(KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance, InQueryBounds) == 0x000000, "Member 'KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance::InQueryBounds' has a wrong offset!");
static_assert(offsetof(KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance, OutInstancedNames) == 0x00001C, "Member 'KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance::OutInstancedNames' has a wrong offset!");
static_assert(offsetof(KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance, OutPhysicalMaterial) == 0x000028, "Member 'KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance::OutPhysicalMaterial' has a wrong offset!");
static_assert(offsetof(KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance, OutStaicMeshComponent) == 0x000030, "Member 'KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance::OutStaicMeshComponent' has a wrong offset!");
static_assert(offsetof(KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance, ReturnValue) == 0x000038, "Member 'KuroAudioMaterialSubsystem_QueryOverlapAnyFoliageInstance::ReturnValue' has a wrong offset!");

}

