#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroBullet

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "KuroSimpleCombat_structs.hpp"
#include "KuroSimpleCombat_classes.hpp"
#include "KuroBullet_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class KuroBullet.BulletActionBase
// 0x0008 (0x0038 - 0x0030)
class UBulletActionBase : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BulletActionBase">();
	}
	static class UBulletActionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBulletActionBase>();
	}
};
static_assert(alignof(UBulletActionBase) == 0x000008, "Wrong alignment on UBulletActionBase");
static_assert(sizeof(UBulletActionBase) == 0x000038, "Wrong size on UBulletActionBase");

// Class KuroBullet.ActionChildBullet
// 0x0000 (0x0038 - 0x0038)
class UActionChildBullet final : public UBulletActionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionChildBullet">();
	}
	static class UActionChildBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionChildBullet>();
	}
};
static_assert(alignof(UActionChildBullet) == 0x000008, "Wrong alignment on UActionChildBullet");
static_assert(sizeof(UActionChildBullet) == 0x000038, "Wrong size on UActionChildBullet");

// Class KuroBullet.ActionDestroyBullet
// 0x0000 (0x0038 - 0x0038)
class UActionDestroyBullet final : public UBulletActionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionDestroyBullet">();
	}
	static class UActionDestroyBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionDestroyBullet>();
	}
};
static_assert(alignof(UActionDestroyBullet) == 0x000008, "Wrong alignment on UActionDestroyBullet");
static_assert(sizeof(UActionDestroyBullet) == 0x000038, "Wrong size on UActionDestroyBullet");

// Class KuroBullet.BulletHitActorData
// 0x0048 (0x0078 - 0x0030)
class UBulletHitActorData final : public UObject
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BulletHitActorData">();
	}
	static class UBulletHitActorData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBulletHitActorData>();
	}
};
static_assert(alignof(UBulletHitActorData) == 0x000008, "Wrong alignment on UBulletHitActorData");
static_assert(sizeof(UBulletHitActorData) == 0x000078, "Wrong size on UBulletHitActorData");

// Class KuroBullet.ActionInitBullet
// 0x0008 (0x0040 - 0x0038)
class UActionInitBullet final : public UBulletActionBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionInitBullet">();
	}
	static class UActionInitBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionInitBullet>();
	}
};
static_assert(alignof(UActionInitBullet) == 0x000008, "Wrong alignment on UActionInitBullet");
static_assert(sizeof(UActionInitBullet) == 0x000040, "Wrong size on UActionInitBullet");

// Class KuroBullet.ActionUpdateCollision
// 0x0000 (0x0038 - 0x0038)
class UActionUpdateCollision final : public UBulletActionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionUpdateCollision">();
	}
	static class UActionUpdateCollision* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionUpdateCollision>();
	}
};
static_assert(alignof(UActionUpdateCollision) == 0x000008, "Wrong alignment on UActionUpdateCollision");
static_assert(sizeof(UActionUpdateCollision) == 0x000038, "Wrong size on UActionUpdateCollision");

// Class KuroBullet.ActionUpdateAtLast
// 0x0000 (0x0038 - 0x0038)
class UActionUpdateAtLast final : public UBulletActionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionUpdateAtLast">();
	}
	static class UActionUpdateAtLast* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionUpdateAtLast>();
	}
};
static_assert(alignof(UActionUpdateAtLast) == 0x000008, "Wrong alignment on UActionUpdateAtLast");
static_assert(sizeof(UActionUpdateAtLast) == 0x000038, "Wrong size on UActionUpdateAtLast");

// Class KuroBullet.ActionUpdateLiveTime
// 0x0000 (0x0038 - 0x0038)
class UActionUpdateLiveTime final : public UBulletActionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionUpdateLiveTime">();
	}
	static class UActionUpdateLiveTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionUpdateLiveTime>();
	}
};
static_assert(alignof(UActionUpdateLiveTime) == 0x000008, "Wrong alignment on UActionUpdateLiveTime");
static_assert(sizeof(UActionUpdateLiveTime) == 0x000038, "Wrong size on UActionUpdateLiveTime");

// Class KuroBullet.ActionUpdateMove
// 0x0000 (0x0038 - 0x0038)
class UActionUpdateMove final : public UBulletActionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionUpdateMove">();
	}
	static class UActionUpdateMove* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionUpdateMove>();
	}
};
static_assert(alignof(UActionUpdateMove) == 0x000008, "Wrong alignment on UActionUpdateMove");
static_assert(sizeof(UActionUpdateMove) == 0x000038, "Wrong size on UActionUpdateMove");

// Class KuroBullet.ActionUpdateTimeScale
// 0x0000 (0x0038 - 0x0038)
class UActionUpdateTimeScale final : public UBulletActionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionUpdateTimeScale">();
	}
	static class UActionUpdateTimeScale* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionUpdateTimeScale>();
	}
};
static_assert(alignof(UActionUpdateTimeScale) == 0x000008, "Wrong alignment on UActionUpdateTimeScale");
static_assert(sizeof(UActionUpdateTimeScale) == 0x000038, "Wrong size on UActionUpdateTimeScale");

// Class KuroBullet.BulletEntity
// 0x0340 (0x0370 - 0x0030)
class alignas(0x10) UBulletEntity final : public UObject
{
public:
	class AActor*                                 Actor;                                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EntityId;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ConfigId;                                          // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBulletOwner>          BulletOwner;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x68];                                      // 0x0060(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CollisionComponent;                                // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0xC8];                                      // 0x00D0(0x00C8)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bNeedDetach;                                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_199[0x5F];                                     // 0x0199(0x005F)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AActor*, class UBulletHitActorData*> MapHitActorData;                                 // 0x01F8(0x0050)(NativeAccessSpecifierPublic)
	TArray<class UBulletHitActorData*>            ArrayHitActorData;                                 // 0x0248(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class AActor*, class UBulletHitActorData*> LastMapHitActorData;                             // 0x0258(0x0050)(NativeAccessSpecifierPublic)
	TArray<class UBulletHitActorData*>            LastArrayHitActorData;                             // 0x02A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTraceSphereElement*                    ObstacleTraceSphere;                               // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTraceBoxElement*                       ObstacleTraceBox;                                  // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D0[0x40];                                     // 0x02D0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBulletActionBase*>              TickActions;                                       // 0x0310(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_320[0x50];                                     // 0x0320(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnObstacleTrace(bool Result, class UTraceBaseElement* Element, double Frame, double Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BulletEntity">();
	}
	static class UBulletEntity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBulletEntity>();
	}
};
static_assert(alignof(UBulletEntity) == 0x000010, "Wrong alignment on UBulletEntity");
static_assert(sizeof(UBulletEntity) == 0x000370, "Wrong size on UBulletEntity");
static_assert(offsetof(UBulletEntity, Actor) == 0x000030, "Member 'UBulletEntity::Actor' has a wrong offset!");
static_assert(offsetof(UBulletEntity, EntityId) == 0x000038, "Member 'UBulletEntity::EntityId' has a wrong offset!");
static_assert(offsetof(UBulletEntity, ConfigId) == 0x000040, "Member 'UBulletEntity::ConfigId' has a wrong offset!");
static_assert(offsetof(UBulletEntity, BulletOwner) == 0x000050, "Member 'UBulletEntity::BulletOwner' has a wrong offset!");
static_assert(offsetof(UBulletEntity, CollisionComponent) == 0x0000C8, "Member 'UBulletEntity::CollisionComponent' has a wrong offset!");
static_assert(offsetof(UBulletEntity, bNeedDetach) == 0x000198, "Member 'UBulletEntity::bNeedDetach' has a wrong offset!");
static_assert(offsetof(UBulletEntity, MapHitActorData) == 0x0001F8, "Member 'UBulletEntity::MapHitActorData' has a wrong offset!");
static_assert(offsetof(UBulletEntity, ArrayHitActorData) == 0x000248, "Member 'UBulletEntity::ArrayHitActorData' has a wrong offset!");
static_assert(offsetof(UBulletEntity, LastMapHitActorData) == 0x000258, "Member 'UBulletEntity::LastMapHitActorData' has a wrong offset!");
static_assert(offsetof(UBulletEntity, LastArrayHitActorData) == 0x0002A8, "Member 'UBulletEntity::LastArrayHitActorData' has a wrong offset!");
static_assert(offsetof(UBulletEntity, ObstacleTraceSphere) == 0x0002C0, "Member 'UBulletEntity::ObstacleTraceSphere' has a wrong offset!");
static_assert(offsetof(UBulletEntity, ObstacleTraceBox) == 0x0002C8, "Member 'UBulletEntity::ObstacleTraceBox' has a wrong offset!");
static_assert(offsetof(UBulletEntity, TickActions) == 0x000310, "Member 'UBulletEntity::TickActions' has a wrong offset!");

// Class KuroBullet.BulletOwner
// 0x0000 (0x0000 - 0x0000)
class IBulletOwner final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BulletOwner">();
	}
	static class IBulletOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBulletOwner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IBulletOwner) == 0x000001, "Wrong alignment on IBulletOwner");
static_assert(sizeof(IBulletOwner) == 0x000001, "Wrong size on IBulletOwner");

// Class KuroBullet.BulletWorld
// 0x01E0 (0x0210 - 0x0030)
class UBulletWorld final : public UObject
{
public:
	class UKSC_World*                             KscWorld;                                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, class UBulletEntity*>             BulletEntityMap;                                   // 0x0038(0x0050)(NativeAccessSpecifierPublic)
	TArray<class UDataTable*>                     CommonBulletDataTableList;                         // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x20];                                      // 0x0098(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UTraceLineElement*                      StickGroundLineTrace;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlatGround;                                       // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GroundZ;                                           // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceUpdateOverlap;                                // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 EntityId, int64 BuffId, bool bAdd)> OnBulletModifyBuff;      // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x10];                                      // 0x00E8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        ObjectHold;                                        // 0x00F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x108];                                    // 0x0108(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddCommonBulletDataTable(class UDataTable* DataTable);
	void ClearCommonBulletDataTable();
	int32 CreateBullet(TScriptInterface<class IBulletOwner> BulletOwner, int64 BulletConfigId, const struct FTransformDouble& InitialTransform);
	void DestroyAllBulletsByOwner(const class AActor* Owner);
	void DestroyBullet(class UBulletEntity* BulletEntity, bool ClearOwner);
	void DestroyBulletById(int32 BulletEntityId, bool ClearOwner);
	void DisableFlatGround();
	void EnableFlatGround(double Height);
	void EnableFlatGroundByAbovePoint(const struct FVectorDouble& AbovePoint);
	bool FindBulletConfig(int64 BulletConfigId, class UDataTable* OwnerBulletDataTable, struct FKuroBulletData* OutRow);
	bool InitBulletConfig(class UBulletEntity* BulletEntity, int64 BulletConfigId, class UDataTable* OwnerBulletDataTable);
	void SetShowBulletCollision(bool Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BulletWorld">();
	}
	static class UBulletWorld* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBulletWorld>();
	}
};
static_assert(alignof(UBulletWorld) == 0x000008, "Wrong alignment on UBulletWorld");
static_assert(sizeof(UBulletWorld) == 0x000210, "Wrong size on UBulletWorld");
static_assert(offsetof(UBulletWorld, KscWorld) == 0x000030, "Member 'UBulletWorld::KscWorld' has a wrong offset!");
static_assert(offsetof(UBulletWorld, BulletEntityMap) == 0x000038, "Member 'UBulletWorld::BulletEntityMap' has a wrong offset!");
static_assert(offsetof(UBulletWorld, CommonBulletDataTableList) == 0x000088, "Member 'UBulletWorld::CommonBulletDataTableList' has a wrong offset!");
static_assert(offsetof(UBulletWorld, StickGroundLineTrace) == 0x0000B8, "Member 'UBulletWorld::StickGroundLineTrace' has a wrong offset!");
static_assert(offsetof(UBulletWorld, bFlatGround) == 0x0000C0, "Member 'UBulletWorld::bFlatGround' has a wrong offset!");
static_assert(offsetof(UBulletWorld, GroundZ) == 0x0000C8, "Member 'UBulletWorld::GroundZ' has a wrong offset!");
static_assert(offsetof(UBulletWorld, ForceUpdateOverlap) == 0x0000D0, "Member 'UBulletWorld::ForceUpdateOverlap' has a wrong offset!");
static_assert(offsetof(UBulletWorld, OnBulletModifyBuff) == 0x0000D8, "Member 'UBulletWorld::OnBulletModifyBuff' has a wrong offset!");
static_assert(offsetof(UBulletWorld, ObjectHold) == 0x0000F8, "Member 'UBulletWorld::ObjectHold' has a wrong offset!");

// Class KuroBullet.KSC_DA_Buff_KuroBullet
// 0x0010 (0x01C0 - 0x01B0)
class UKSC_DA_Buff_KuroBullet final : public UKSC_DA_Buff
{
public:
	int64                                         BulletId;                                          // 0x01A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DestroyBulletOnBuffEnd;                            // 0x01B0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B1[0xF];                                      // 0x01B1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_DA_Buff_KuroBullet">();
	}
	static class UKSC_DA_Buff_KuroBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_DA_Buff_KuroBullet>();
	}
};
static_assert(alignof(UKSC_DA_Buff_KuroBullet) == 0x000010, "Wrong alignment on UKSC_DA_Buff_KuroBullet");
static_assert(sizeof(UKSC_DA_Buff_KuroBullet) == 0x0001C0, "Wrong size on UKSC_DA_Buff_KuroBullet");
static_assert(offsetof(UKSC_DA_Buff_KuroBullet, BulletId) == 0x0001A8, "Member 'UKSC_DA_Buff_KuroBullet::BulletId' has a wrong offset!");
static_assert(offsetof(UKSC_DA_Buff_KuroBullet, DestroyBulletOnBuffEnd) == 0x0001B0, "Member 'UKSC_DA_Buff_KuroBullet::DestroyBulletOnBuffEnd' has a wrong offset!");

// Class KuroBullet.KSC_Buff_KuroBullet
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_KuroBullet final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_KuroBullet*                DaBuffKuroBullet_;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_KuroBullet">();
	}
	static class UKSC_Buff_KuroBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_KuroBullet>();
	}
};
static_assert(alignof(UKSC_Buff_KuroBullet) == 0x000008, "Wrong alignment on UKSC_Buff_KuroBullet");
static_assert(sizeof(UKSC_Buff_KuroBullet) == 0x000070, "Wrong size on UKSC_Buff_KuroBullet");
static_assert(offsetof(UKSC_Buff_KuroBullet, DaBuffKuroBullet_) == 0x000060, "Member 'UKSC_Buff_KuroBullet::DaBuffKuroBullet_' has a wrong offset!");

// Class KuroBullet.KSC_DA_Buff_Period_KuroBullet
// 0x0030 (0x0230 - 0x0200)
class UKSC_DA_Buff_Period_KuroBullet final : public UKSC_DA_Buff_Period
{
public:
	int64                                         BulletId;                                          // 0x0200(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_BulletTarget                             Target;                                            // 0x0208(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EKSC_Faction>                          IgnoreFaction;                                     // 0x0210(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         Range;                                             // 0x0220(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_224[0xC];                                      // 0x0224(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_DA_Buff_Period_KuroBullet">();
	}
	static class UKSC_DA_Buff_Period_KuroBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_DA_Buff_Period_KuroBullet>();
	}
};
static_assert(alignof(UKSC_DA_Buff_Period_KuroBullet) == 0x000010, "Wrong alignment on UKSC_DA_Buff_Period_KuroBullet");
static_assert(sizeof(UKSC_DA_Buff_Period_KuroBullet) == 0x000230, "Wrong size on UKSC_DA_Buff_Period_KuroBullet");
static_assert(offsetof(UKSC_DA_Buff_Period_KuroBullet, BulletId) == 0x000200, "Member 'UKSC_DA_Buff_Period_KuroBullet::BulletId' has a wrong offset!");
static_assert(offsetof(UKSC_DA_Buff_Period_KuroBullet, Target) == 0x000208, "Member 'UKSC_DA_Buff_Period_KuroBullet::Target' has a wrong offset!");
static_assert(offsetof(UKSC_DA_Buff_Period_KuroBullet, IgnoreFaction) == 0x000210, "Member 'UKSC_DA_Buff_Period_KuroBullet::IgnoreFaction' has a wrong offset!");
static_assert(offsetof(UKSC_DA_Buff_Period_KuroBullet, Range) == 0x000220, "Member 'UKSC_DA_Buff_Period_KuroBullet::Range' has a wrong offset!");

// Class KuroBullet.KSC_Buff_Period_KuroBullet
// 0x0010 (0x0088 - 0x0078)
class UKSC_Buff_Period_KuroBullet final : public UKSC_Buff_Period
{
public:
	class UKSC_DA_Buff_Period_KuroBullet*         DaBuffPeriodKuroBullet_;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Buff_Period_KuroBullet">();
	}
	static class UKSC_Buff_Period_KuroBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Period_KuroBullet>();
	}
};
static_assert(alignof(UKSC_Buff_Period_KuroBullet) == 0x000008, "Wrong alignment on UKSC_Buff_Period_KuroBullet");
static_assert(sizeof(UKSC_Buff_Period_KuroBullet) == 0x000088, "Wrong size on UKSC_Buff_Period_KuroBullet");
static_assert(offsetof(UKSC_Buff_Period_KuroBullet, DaBuffPeriodKuroBullet_) == 0x000078, "Member 'UKSC_Buff_Period_KuroBullet::DaBuffPeriodKuroBullet_' has a wrong offset!");

// Class KuroBullet.KSC_DA_Skill_KuroBullet
// 0x0030 (0x0190 - 0x0160)
class UKSC_DA_Skill_KuroBullet final : public UKSC_DA_Skill_Anim
{
public:
	TArray<struct FKSC_SkillKuroBullet>           Bullets;                                           // 0x0160(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	EKSC_BulletTarget                             Target;                                            // 0x0170(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroBulletSkillDirection                     SkillDirection;                                    // 0x0171(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CastRangeMin;                                      // 0x0174(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int64>                                 AddBuffsToSelf;                                    // 0x0178(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_DA_Skill_KuroBullet">();
	}
	static class UKSC_DA_Skill_KuroBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_DA_Skill_KuroBullet>();
	}
};
static_assert(alignof(UKSC_DA_Skill_KuroBullet) == 0x000010, "Wrong alignment on UKSC_DA_Skill_KuroBullet");
static_assert(sizeof(UKSC_DA_Skill_KuroBullet) == 0x000190, "Wrong size on UKSC_DA_Skill_KuroBullet");
static_assert(offsetof(UKSC_DA_Skill_KuroBullet, Bullets) == 0x000160, "Member 'UKSC_DA_Skill_KuroBullet::Bullets' has a wrong offset!");
static_assert(offsetof(UKSC_DA_Skill_KuroBullet, Target) == 0x000170, "Member 'UKSC_DA_Skill_KuroBullet::Target' has a wrong offset!");
static_assert(offsetof(UKSC_DA_Skill_KuroBullet, SkillDirection) == 0x000171, "Member 'UKSC_DA_Skill_KuroBullet::SkillDirection' has a wrong offset!");
static_assert(offsetof(UKSC_DA_Skill_KuroBullet, CastRangeMin) == 0x000174, "Member 'UKSC_DA_Skill_KuroBullet::CastRangeMin' has a wrong offset!");
static_assert(offsetof(UKSC_DA_Skill_KuroBullet, AddBuffsToSelf) == 0x000178, "Member 'UKSC_DA_Skill_KuroBullet::AddBuffsToSelf' has a wrong offset!");

// Class KuroBullet.KSC_Skill_KuroBullet
// 0x0028 (0x00D0 - 0x00A8)
class UKSC_Skill_KuroBullet final : public UKSC_Skill_Anim
{
public:
	class UKSC_DA_Skill_KuroBullet*               DaSkillKuroBullet_;                                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x20];                                      // 0x00B0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSC_Skill_KuroBullet">();
	}
	static class UKSC_Skill_KuroBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Skill_KuroBullet>();
	}
};
static_assert(alignof(UKSC_Skill_KuroBullet) == 0x000008, "Wrong alignment on UKSC_Skill_KuroBullet");
static_assert(sizeof(UKSC_Skill_KuroBullet) == 0x0000D0, "Wrong size on UKSC_Skill_KuroBullet");
static_assert(offsetof(UKSC_Skill_KuroBullet, DaSkillKuroBullet_) == 0x0000A8, "Member 'UKSC_Skill_KuroBullet::DaSkillKuroBullet_' has a wrong offset!");

// Class KuroBullet.KSCBulletOwner
// 0x0048 (0x0078 - 0x0030)
class UKSCBulletOwner final : public UObject
{
public:
	uint8                                         Pad_30[0x38];                                      // 0x0030(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             OwnerBulletDataTable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KSCBulletOwner">();
	}
	static class UKSCBulletOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSCBulletOwner>();
	}
};
static_assert(alignof(UKSCBulletOwner) == 0x000008, "Wrong alignment on UKSCBulletOwner");
static_assert(sizeof(UKSCBulletOwner) == 0x000078, "Wrong size on UKSCBulletOwner");
static_assert(offsetof(UKSCBulletOwner, OwnerBulletDataTable) == 0x000068, "Member 'UKSCBulletOwner::OwnerBulletDataTable' has a wrong offset!");

// Class KuroBullet.KuroBulletFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UKuroBulletFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 CreateBullet(class AKSC_Entity* KSC_Entity, int64 BulletConfigId, const struct FTransformDouble& InitialTransform, class UDataTable* OwnerBulletDataTable, class AKSC_Entity* SkillTarget);
