#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroGameplay

#include "Basic.hpp"

#include "KuroCurve_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum KuroGameplay.EEffectModelGhostCppComponent
// NumValues: 0x0019
enum class EEffectModelGhostCppComponent : uint8
{
	Body                                     = 0,
	WeaponCase0                              = 1,
	WeaponCase1                              = 2,
	WeaponCase2                              = 3,
	WeaponCase3                              = 4,
	WeaponCase4                              = 5,
	Hulu                                     = 6,
	OtherCase0                               = 7,
	OtherCase1                               = 8,
	OtherCase2                               = 9,
	OtherCase3                               = 10,
	OtherCase4                               = 11,
	OtherCase5                               = 12,
	OtherCase6                               = 13,
	OtherCase7                               = 14,
	OtherCase8                               = 15,
	OtherCase9                               = 16,
	OtherCase10                              = 17,
	OtherCase11                              = 18,
	OtherCase12                              = 19,
	OtherCase13                              = 20,
	OtherCase14                              = 21,
	OtherCase15                              = 22,
	OtherCase16                              = 23,
	EEffectModelGhostCppComponent_MAX        = 24,
};

// Enum KuroGameplay.EMultiEffectType
// NumValues: 0x0002
enum class EMultiEffectType : uint8
{
	BuffBall                                 = 0,
	EMultiEffectType_MAX                     = 1,
};

// Enum KuroGameplay.ELockAxis
// NumValues: 0x0007
enum class ELockAxis : uint8
{
	Forward                                  = 0,
	Back                                     = 1,
	Right                                    = 2,
	Left                                     = 3,
	Up                                       = 4,
	Down                                     = 5,
	ELockAxis_MAX                            = 6,
};

// Enum KuroGameplay.EKuroEasingFuncType
// NumValues: 0x0010
enum class EKuroEasingFuncType : uint8
{
	KEF_Linear                               = 0,
	KEF_EaseIn                               = 1,
	KEF_EaseOut                              = 2,
	KEF_EaseInOut                            = 3,
	KEF_SinIn                                = 4,
	KEF_SinOut                               = 5,
	KEF_SinInOut                             = 6,
	KEF_ExpoIn                               = 7,
	KEF_ExpoOut                              = 8,
	KEF_ExpoInOut                            = 9,
	KEF_CircularIn                           = 10,
	KEF_CircularOut                          = 11,
	KEF_CircularInOut                        = 12,
	KEF_FloatCurve                           = 13,
	KEF_CustomFunc                           = 14,
	KEF_MAX                                  = 15,
};

// ScriptStruct KuroGameplay.KuroParameterFloat
// 0x0010 (0x0010 - 0x0000)
struct FKuroParameterFloat final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroParameterFloat;

// ScriptStruct KuroGameplay.EffectModelNiagaraExtraState
// 0x00F0 (0x00F0 - 0x0000)
struct FEffectModelNiagaraExtraState final
{
public:
	TMap<class FName, struct FKuroCurveFloat>     FloatParameters;                                   // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, struct FKuroCurveLinearColor> ColorParameters;                                 // 0x0050(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, struct FKuroCurveVector>    VectorParameters;                                  // 0x00A0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FEffectModelNiagaraExtraState;

// ScriptStruct KuroGameplay.PerformanceStatisticsUnitRecord
// 0x0028 (0x0028 - 0x0000)
struct FPerformanceStatisticsUnitRecord final
{
public:
	int32                                         FrameCount;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Mode;                                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserDefineMessage;                                 // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerformanceStatisticsUnitRecord;

// ScriptStruct KuroGameplay.PerformanceStatisticsSectionRecordSerialize
// 0x0020 (0x0020 - 0x0000)
struct FPerformanceStatisticsSectionRecordSerialize final
{
public:
	class FName                                   SectionName;                                       // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPerformanceStatisticsUnitRecord> UnitRecordValues;                                // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerformanceStatisticsSectionRecordSerialize;

// ScriptStruct KuroGameplay.KuroEffectPostProcessSkyBoxSetting
// 0x20E0 (0x20E0 - 0x0000)
struct FKuroEffectPostProcessSkyBoxSetting final
{
public:
	uint8                                         bOverride_ZenithColor : 1;                         // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_NadirColor : 1;                          // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_NadirFalloff : 1;                        // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_NadirFalloff_Mobile : 1;                 // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_HorizonColor : 1;                        // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_HorizonFalloff : 1;                      // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_TopColor : 1;                            // 0x0000(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_TopFalloff : 1;                          // 0x0000(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_TopColorMobile : 1;                      // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_TopFalloffMobile : 1;                    // 0x0001(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SunDiscColor : 1;                        // 0x0001(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SunScatterColor : 1;                     // 0x0001(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SunSize : 1;                             // 0x0001(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SunScatterSize : 1;                      // 0x0001(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SunMeshScale : 1;                        // 0x0001(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SunMeshColor : 1;                        // 0x0001(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonTexture : 1;                         // 0x0002(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonPhase : 1;                           // 0x0002(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonDiscColor : 1;                       // 0x0002(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonScatterColor : 1;                    // 0x0002(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonSize : 1;                            // 0x0002(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonScatterSize : 1;                     // 0x0002(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ExtremeWeatherWeight : 1;                // 0x0002(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ST_TopColor : 1;                         // 0x0002(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ST_DomeColorTint : 1;                    // 0x0003(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ST_TopWidth : 1;                         // 0x0003(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroCurveLinearColor                  ZenithColor;                                       // 0x0008(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveLinearColor                  NadirColor;                                        // 0x0228(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        NadirFalloff;                                      // 0x0448(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        NadirFalloff_Mobile;                               // 0x04D8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveLinearColor                  HorizonColor;                                      // 0x0568(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        HorizonFalloff;                                    // 0x0788(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveLinearColor                  TopColor;                                          // 0x0818(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        TopFalloff;                                        // 0x0A38(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveLinearColor                  TopColorMobile;                                    // 0x0AC8(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        TopFalloffMobile;                                  // 0x0CE8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveLinearColor                  SunDiscColor;                                      // 0x0D78(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveLinearColor                  SunScatterColor;                                   // 0x0F98(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        SunSize;                                           // 0x11B8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        SunScatterSize;                                    // 0x1248(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        SunMeshScale;                                      // 0x12D8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveLinearColor                  SunMeshColor;                                      // 0x1368(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveLinearColor                  MoonDiscColor;                                     // 0x1588(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UTexture2D*                             MoonTexture;                                       // 0x17A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        MoonPhase;                                         // 0x17B0(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveLinearColor                  MoonScatterColor;                                  // 0x1840(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        MoonSize;                                          // 0x1A60(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        MoonScatterSize;                                   // 0x1AF0(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        ExtremeWeatherWeight;                              // 0x1B80(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveLinearColor                  ST_TopColor;                                       // 0x1C10(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveLinearColor                  ST_DomeColorTint;                                  // 0x1E30(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroCurveFloat                        ST_TopWidth;                                       // 0x2050(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroEffectPostProcessSkyBoxSetting;

// ScriptStruct KuroGameplay.PerformanceStatisticsSectionsSerialize
// 0x0010 (0x0010 - 0x0000)
struct FPerformanceStatisticsSectionsSerialize final
{
public:
	TArray<struct FPerformanceStatisticsSectionRecordSerialize> SectionRecords;                      // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerformanceStatisticsSectionsSerialize;

// ScriptStruct KuroGameplay.KuroSceneTeamItem
// 0x0008 (0x0008 - 0x0000)
struct FKuroSceneTeamItem final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsMyRole;                                          // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKuroSceneTeamItem;

// ScriptStruct KuroGameplay.KuroParameterLinearColor
// 0x001C (0x001C - 0x0000)
struct FKuroParameterLinearColor final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroParameterLinearColor;

// ScriptStruct KuroGameplay.KuroParameterVector
// 0x0018 (0x0018 - 0x0000)
struct FKuroParameterVector final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroParameterVector;

// ScriptStruct KuroGameplay.KuroParameterArrayVector
// 0x0020 (0x0020 - 0x0000)
struct FKuroParameterArrayVector final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Value;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroParameterArrayVector;

// ScriptStruct KuroGameplay.KuroEffectNiagaraParametersStruct
// 0x0060 (0x0060 - 0x0000)
struct FKuroEffectNiagaraParametersStruct final
{
public:
	TArray<struct FKuroParameterFloat>            UserParameterFloat;                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FKuroParameterLinearColor>      UserParameterColor;                                // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FKuroParameterVector>           UserParameterVector;                               // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FKuroParameterArrayVector>      UserParameterArrayVector;                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FKuroParameterFloat>            MaterialParameterFloat;                            // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FKuroParameterLinearColor>      MaterialParameterColor;                            // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroEffectNiagaraParametersStruct;

// ScriptStruct KuroGameplay.PerformanceStatisticsTagNode
// 0x0088 (0x0088 - 0x0000)
struct alignas(0x08) FPerformanceStatisticsTagNode final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RecordFramesCount;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalTime;                                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AverageTime;                                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTime;                                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x6C];                                      // 0x001C(0x006C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPerformanceStatisticsTagNode;

// ScriptStruct KuroGameplay.KuroEffectSpecData
// 0x0018 (0x0018 - 0x0000)
struct FKuroEffectSpecData final
{
public:
	int32                                         Id;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Path;                                              // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SpecType;                                          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         EffectRegularType;                                 // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LifeTime;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroEffectSpecData;

// ScriptStruct KuroGameplay.SequencerBindingRuntimeProxy
// 0x0018 (0x0018 - 0x0000)
struct FSequencerBindingRuntimeProxy final
{
public:
	struct FGuid                                  BindingID;                                         // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMovieSceneSequence*                    Sequence;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSequencerBindingRuntimeProxy;

// ScriptStruct KuroGameplay.KuroEffectContext
// 0x0030 (0x0030 - 0x0000)
struct FKuroEffectContext
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                SourceObject;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisablePostProcess;                                // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CreateFromType;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayFlag;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CreateFromBpEffectActor;                           // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ContextType;                                       // 0x001D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HitEffectType;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AnsSlotName;                                       // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroEffectContext;

// ScriptStruct KuroGameplay.KuroProgressBarStyle
// 0x0240 (0x0248 - 0x0008)
struct FKuroProgressBarStyle final : public FSlateWidgetStyle
{
public:
	struct FSlateBrush                            BackgroundImage;                                   // 0x0008(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FillImageMiddle;                                   // 0x0098(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FillImage;                                         // 0x0128(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MarqueeImage;                                      // 0x01B8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroProgressBarStyle;

// ScriptStruct KuroGameplay.KuroSkeletalMeshEffectContext
// 0x0010 (0x0040 - 0x0030)
struct FKuroSkeletalMeshEffectContext : public FKuroEffectContext
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSyncTimeDilation;                                // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSyncEventTimeToEffectTime;                       // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKuroSkeletalMeshEffectContext;

// ScriptStruct KuroGameplay.PerformanceStatisticsTagTreeNodeSerialize
// 0x0028 (0x0028 - 0x0000)
struct FPerformanceStatisticsTagTreeNodeSerialize final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AverageTime;                                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTime;                                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Mode;                                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserDefineMessage;                                 // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerformanceStatisticsTagTreeNodeSerialize;

// ScriptStruct KuroGameplay.KuroEffectRuntimeGhostEffectContext
// 0x0010 (0x0050 - 0x0040)
struct FKuroEffectRuntimeGhostEffectContext final : public FKuroSkeletalMeshEffectContext
{
public:
	float                                         SpawnRate;                                         // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseSpawnRate;                                      // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpawnInterval;                                     // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GhostLifeTime;                                     // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroEffectRuntimeGhostEffectContext;

// ScriptStruct KuroGameplay.PerformanceStatisticsTagTreeSerialize
// 0x0038 (0x0038 - 0x0000)
struct FPerformanceStatisticsTagTreeSerialize final
{
public:
	struct FPerformanceStatisticsTagTreeNodeSerialize NodeSerialize;                                 // 0x0000(0x0028)(NativeAccessSpecifierPublic)
	TArray<struct FPerformanceStatisticsTagTreeNodeSerialize> ChildTags;                             // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerformanceStatisticsTagTreeSerialize;

// ScriptStruct KuroGameplay.KuroEffectAudioContext
// 0x0008 (0x0038 - 0x0030)
struct FKuroEffectAudioContext final : public FKuroEffectContext
{
public:
	bool                                          FromPrimaryRole;                                   // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKuroEffectAudioContext;

// ScriptStruct KuroGameplay.KuroGASMessageParams
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FKuroGASMessageParams final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKuroGASMessageParams;

// ScriptStruct KuroGameplay.PerformanceStatisticsTagNodeForSerialize
// 0x001C (0x001C - 0x0000)
struct FPerformanceStatisticsTagNodeForSerialize final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RecordFramesCount;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalTime;                                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AverageTime;                                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTime;                                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerformanceStatisticsTagNodeForSerialize;

// ScriptStruct KuroGameplay.KuroInputDefine
// 0x0001 (0x0001 - 0x0000)
struct FKuroInputDefine final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKuroInputDefine;

// ScriptStruct KuroGameplay.TrailSegment
// 0x0028 (0x0028 - 0x0000)
struct FTrailSegment final
{
public:
	class UBoxComponent*                          Box;                                               // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTrailSegment;

// ScriptStruct KuroGameplay.KuroLevelSwitchMaterialData
// 0x0030 (0x0030 - 0x0000)
struct FKuroLevelSwitchMaterialData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeChildren;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      EnterMaterial;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroLevelMaterialDynamicData*          MaterialAsset;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExitReverse;                                      // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      ExitMaterial;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroLevelSwitchMaterialData;

// ScriptStruct KuroGameplay.KuroSplineParams
// 0x0018 (0x0018 - 0x0000)
struct FKuroSplineParams final
{
public:
	TArray<struct FVector>                        Points;                                            // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bClosedLoop;                                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKuroSplineParams;

// ScriptStruct KuroGameplay.RoadwayCreateParam
// 0x0058 (0x0058 - 0x0000)
struct FRoadwayCreateParam final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotator;                                           // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FSplinePoint>                   SplineData;                                        // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         RoadwayId;                                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RoadwayWidth;                                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectTerrain;                                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OpposingRoadId;                                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastRoadId;                                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextRoadId;                                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PavedRoadConfig;                                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        IntersectCells;                                    // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRoadwayCreateParam;

// ScriptStruct KuroGameplay.RoadSegmentInfo
// 0x0010 (0x0010 - 0x0000)
struct FRoadSegmentInfo final
{
public:
	float                                         StartKey;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroRoadway*                           RoadInfo;                                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRoadSegmentInfo;

}

