#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroPointCloud

#include "Basic.hpp"

#include "KuroPointCloud_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Niagara_classes.hpp"


namespace SDK
{

// Class KuroPointCloud.KuroPointCloudActor
// 0x0088 (0x0338 - 0x02B0)
class AKuroPointCloudActor final : public AActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMeshComponent;                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UKuroPointCloudCache*                   PointCloudAsset;                                   // 0x02B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointNumToStopDivide;                              // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoxLengthToStopDivide;                             // 0x02C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InstanceScale;                                     // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroPointKdTree                       KdTree;                                            // 0x02D0(0x0058)(NativeAccessSpecifierPrivate)
	TArray<float>                                 CustomData;                                        // 0x0328(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void BuildKdTreeData();
	void ClearMark();
	void MarkPointsInBox(const struct FBox& BoxWS);
	void UpdateIsm();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPointCloudActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPointCloudActor")
	}
	static class AKuroPointCloudActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroPointCloudActor>();
	}
};
DUMPER7_ASSERTS_AKuroPointCloudActor;

// Class KuroPointCloud.KuroPointCloudCache
// 0x0228 (0x0258 - 0x0030)
class UKuroPointCloudCache final : public UObject
{
public:
	TArray<struct FVector>                        PositionCache;                                     // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FQuat>                          RotationCache;                                     // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVector>                        ScaleCache;                                        // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 AgeCache;                                          // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 IndexCache;                                        // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 FlatCustomFloatCache;                              // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         CustomFloatCacheStride;                            // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      CustomFloatCacheDataOffsets;                       // 0x0098(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<struct FKuroPointCloudCacheCustomFloat> CustomFloatCache;                                 // 0x00E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 CurveMapCache;                                     // 0x00F8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 CurveStartTimeCache;                               // 0x0108(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 FlatCurveCustomFloatCache;                         // 0x0118(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         CurveCustomFloatCacheStride;                       // 0x0128(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      CurveCustomFloatCacheDataOffsets;                  // 0x0130(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<struct FKuroPointCloudCacheCustomFloat> CurveCustomFloatCache;                            // 0x0180(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, int32>                      MetaDataInt;                                       // 0x0190(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, float>                      MetaDataFloat;                                     // 0x01E0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	int32                                         NumPoints;                                         // 0x0230(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumCurves;                                         // 0x0234(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ReleaseCPUData;                                    // 0x0238(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsCookedPlatformWithCPUDataReleased;              // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_23A[0x1E];                                     // 0x023A(0x001E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetMetaDataFloat(class FName Name_0);
	int32 GetMetaDataInt(class FName Name_0);
	bool HasMetaDataFloat(class FName Name_0);
	bool HasMetaDataInt(class FName Name_0);
	void SetMetaDataFloat(class FName Name_0, float Value);
	void SetMetaDataInt(class FName Name_0, int32 Value);
	bool UpdateFromData(const TArray<struct FVector>& Positions, const TArray<struct FQuat>& Rotations, const TArray<struct FVector>& Scales);
	bool UpdateFromDataEx(const TArray<struct FVector>& Positions, const TArray<struct FQuat>& Rotations, const TArray<struct FVector>& Scales, const TArray<float>& Ages, const TArray<int32>& Indices, const TArray<struct FKuroPointCloudCacheCustomFloat>& CustomFloats, const TArray<float>& CurveStartTimes, const TArray<struct FKuroPointCloudCacheCustomFloat>& CurveCustomFloats);

	bool CheckConsistency(bool Verbosity) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPointCloudCache")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPointCloudCache")
	}
	static class UKuroPointCloudCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroPointCloudCache>();
	}
};
DUMPER7_ASSERTS_UKuroPointCloudCache;

// Class KuroPointCloud.KuroPointCloudFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UKuroPointCloudFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool SetNiagaraKuroPointCloudCache(class UNiagaraComponent* NiagaraComponent, class UKuroPointCloudCache* KuroPointCloudCache, class FName ParameterName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPointCloudFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPointCloudFunctionLibrary")
	}
	static class UKuroPointCloudFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroPointCloudFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UKuroPointCloudFunctionLibrary;

// Class KuroPointCloud.KuroPointCloudInstance
// 0x0068 (0x0098 - 0x0030)
class UKuroPointCloudInstance final : public UObject
{
public:
	class UKuroPointCloudCache*                   PointCloudCache;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FKuroPointKdTree                       KdTree;                                            // 0x0038(0x0058)(NativeAccessSpecifierPrivate)
	class UKuroVirtualPointCloud2DQTree*          QTree2D;                                           // 0x0090(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BuildFrom2DPoints(const TArray<struct FIntPoint>& InPoints, const struct FTransform& InPlaneToWorld, int32 MaxHeight);
	void BuildFromPointCloudData(const TArray<struct FVector>& Positions, const TArray<struct FQuat>& Rotations, const TArray<struct FVector>& Scales);
	void ResetData();

	struct FBox GetBound() const;
	class UKuroPointCloudCache* GetPointCloudCache() const;
	int32 GetQueryPointsNum(const struct FKuroPointCloudInstanceQueryResult& QueryResult) const;
	bool GetQueryPointTransform(const struct FKuroPointCloudInstanceQueryResult& QueryResult, int32 Index_0, struct FVector* OutPosition, struct FQuat* OutRotation, struct FVector* OutScale) const;
	struct FKuroPointCloudInstanceQueryResult SphereQuery(const struct FVector& SphereCenter, float SphereRadius) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPointCloudInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPointCloudInstance")
	}
	static class UKuroPointCloudInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroPointCloudInstance>();
	}
};
DUMPER7_ASSERTS_UKuroPointCloudInstance;

// Class KuroPointCloud.KuroPointCloudStreamingConfig
// 0x0018 (0x0050 - 0x0038)
class UKuroPointCloudStreamingConfig final : public UPrimaryDataAsset
{
public:
	TArray<struct FKuroPointCloudStreamingCell>   StreamingCells;                                    // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         CellSize;                                          // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearEmptyInstances();
	void SetInstanceData(int32 CellX, int32 CellY, class FName CollectionName, class UKuroPointCloudInstance* PointCloudInstance);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPointCloudStreamingConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPointCloudStreamingConfig")
	}
	static class UKuroPointCloudStreamingConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroPointCloudStreamingConfig>();
	}
};
DUMPER7_ASSERTS_UKuroPointCloudStreamingConfig;

// Class KuroPointCloud.KuroPointCloudStreamingActor
// 0x0028 (0x02D8 - 0x02B0)
class AKuroPointCloudStreamingActor final : public AActor
{
public:
	class USceneComponent*                        SceneRoot;                                         // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroPointCloudWorldComponent*          PointCloudWorldComponent;                          // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x18];                                     // 0x02C0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPointCloudStreamingActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPointCloudStreamingActor")
	}
	static class AKuroPointCloudStreamingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroPointCloudStreamingActor>();
	}
};
DUMPER7_ASSERTS_AKuroPointCloudStreamingActor;

// Class KuroPointCloud.KuroPointCloudStreamer
// 0x0090 (0x00C0 - 0x0030)
class UKuroPointCloudStreamer final : public UObject
{
public:
	class UKuroPointCloudStreamingConfig*         Config;                                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AKuroPointCloudStreamingActor*>  SpawnedActors;                                     // 0x0088(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class AKuroPointCloudStreamingActor*>  ActorPool;                                         // 0x0098(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPointCloudStreamer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPointCloudStreamer")
	}
	static class UKuroPointCloudStreamer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroPointCloudStreamer>();
	}
};
DUMPER7_ASSERTS_UKuroPointCloudStreamer;

// Class KuroPointCloud.KuroPointCloudWorldActor
// 0x0028 (0x02D8 - 0x02B0)
class AKuroPointCloudWorldActor final : public AActor
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroPointCloudWorldComponent*          PointCloudWorldComponent;                          // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GroupName;                                         // 0x02C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SubGroupName;                                      // 0x02CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static void DeleteAllActorsInGroup(const class UObject* WorldContextObject, class FName TargetGroupName, class FName TargetSubGroupName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPointCloudWorldActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPointCloudWorldActor")
	}
	static class AKuroPointCloudWorldActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroPointCloudWorldActor>();
	}
};
DUMPER7_ASSERTS_AKuroPointCloudWorldActor;

// Class KuroPointCloud.KuroPointCloudWorldComponent
// 0x0030 (0x0250 - 0x0220)
class UKuroPointCloudWorldComponent final : public USceneComponent
{
public:
	class FName                                   KuroPointCloudCollectionName;                      // 0x0218(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_224[0xC];                                      // 0x0224(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroPointCloudInstance*                PointCloudInstance;                                // 0x0230(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EKPCWorldComponentDynamicPointMode            DynamicPointMode;                                  // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKPCWDynamicPointSocketInfo>    SocketInfos;                                       // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	class UKuroPointCloudInstance* GetInstance(bool bCreateIfNull);
	void MarkUpdate();
	void SetInstance(class UKuroPointCloudInstance* Instance);

	int32 GetNumDynamicPoints() const;
	bool SampleDynamicPoint(int32 Index_0, struct FTransform* OutTransform) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPointCloudWorldComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPointCloudWorldComponent")
	}
	static class UKuroPointCloudWorldComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroPointCloudWorldComponent>();
	}
};
DUMPER7_ASSERTS_UKuroPointCloudWorldComponent;

// Class KuroPointCloud.KuroPointCloudWorldSystem
// 0x0078 (0x00B0 - 0x0038)
class UKuroPointCloudWorldSystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroPointCloudStreamer*                Streamer;                                          // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FKuroPointCloudWorldCollection> Collections;                            // 0x0050(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetStreamingConfig(class UKuroPointCloudStreamingConfig* Config, float StreamingDistance);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPointCloudWorldSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPointCloudWorldSystem")
	}
	static class UKuroPointCloudWorldSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroPointCloudWorldSystem>();
	}
};
DUMPER7_ASSERTS_UKuroPointCloudWorldSystem;

// Class KuroPointCloud.KuroVirtualPointCloud2DQTree
// 0x0090 (0x00C0 - 0x0030)
class UKuroVirtualPointCloud2DQTree final : public UObject
{
public:
	TArray<int32>                                 QTree;                                             // 0x0030(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              QTreeBoundMin;                                     // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                              QTreeBoundMax;                                     // 0x0050(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             WorldToPointCloudLocal;                            // 0x0060(0x0030)(Edit, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTransform                             PointCloudLocalToWorld;                            // 0x0090(0x0030)(Edit, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void BuildFromPointData(const TArray<struct FIntPoint>& InPoints, const struct FTransform& InPlaneToWorld, int32 MaxHeight);
	void Reset();

	struct FQuat GetRotation() const;
	struct FBox GetWorldBound() const;
	void SphereQuery(const struct FVector& SphereCenter, float SphereRadius, TArray<struct FIntPoint>* OutResult) const;
	struct FVector TransformPointToWorld(const struct FIntPoint& Point) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroVirtualPointCloud2DQTree")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroVirtualPointCloud2DQTree")
	}
	static class UKuroVirtualPointCloud2DQTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroVirtualPointCloud2DQTree>();
	}
};
DUMPER7_ASSERTS_UKuroVirtualPointCloud2DQTree;

// Class KuroPointCloud.NiagaraDataInterfaceKuroPointCloud
// 0x0018 (0x0058 - 0x0040)
class UNiagaraDataInterfaceKuroPointCloud final : public UNiagaraDataInterface
{
public:
	class UKuroPointCloudCache*                   PointCloudCache;                                   // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WorldCollectionName;                               // 0x0048(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceKuroPointCloud")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceKuroPointCloud")
	}
	static class UNiagaraDataInterfaceKuroPointCloud* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceKuroPointCloud>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceKuroPointCloud;

}

