#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroDynamicMeshBatch

#include "Basic.hpp"

#include "KuroDynamicMeshBatch_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class KuroDynamicMeshBatch.BatchableComponent
// 0x0030 (0x0250 - 0x0220)
class UBatchableComponent final : public USceneComponent
{
public:
	bool                                          bDynamicUpdate;                                    // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            InstanceStaticMesh;                                // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     InstanceMaterial;                                  // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasBeenRemovedFromBatch;                          // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRegistered;                                     // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPropMaterialParams                    InstanceData;                                      // 0x0234(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RegisterInstance();
	void SetDynamicUpdate(bool bEnabled);
	void UnregisterInstance();
	void UpdateBatchInstance();

	bool ShouldBatch() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BatchableComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BatchableComponent")
	}
	static class UBatchableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBatchableComponent>();
	}
};
DUMPER7_ASSERTS_UBatchableComponent;

// Class KuroDynamicMeshBatch.BatchSystem
// 0x0198 (0x0448 - 0x02B0)
class ABatchSystem final : public AActor
{
public:
	uint8                                         Pad_2B0[0x28];                                     // 0x02B0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CullDistance;                                      // 0x02D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FBatchKey, class UInstancedStaticMeshComponent*> BatchComponents;                    // 0x02E0(0x0050)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<TWeakObjectPtr<class USceneComponent>, struct FDynamicInstanceData> DynamicInstances;       // 0x0330(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_380[0xC8];                                     // 0x0380(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ProcessBatch();
	void SetActorDynamicUpdate(class USceneComponent* Component, bool bDynamic);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BatchSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BatchSystem")
	}
	static class ABatchSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABatchSystem>();
	}
};
DUMPER7_ASSERTS_ABatchSystem;

// Class KuroDynamicMeshBatch.BatchSystemFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UBatchSystemFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UBatchSystemSubsystem* GetBatchSystemSubsystem(const class UObject* WorldContextObject);
	static void ProcessAllBatches(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BatchSystemFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BatchSystemFunctionLibrary")
	}
	static class UBatchSystemFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBatchSystemFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UBatchSystemFunctionLibrary;

// Class KuroDynamicMeshBatch.BatchSystemSubsystem
// 0x0008 (0x0040 - 0x0038)
class UBatchSystemSubsystem final : public UGameInstanceSubsystem
{
public:
	class ABatchSystem*                           BatchSystem;                                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BatchSystemSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BatchSystemSubsystem")
	}
	static class UBatchSystemSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBatchSystemSubsystem>();
	}
};
DUMPER7_ASSERTS_UBatchSystemSubsystem;

// Class KuroDynamicMeshBatch.PropBatchActor
// 0x0008 (0x02B8 - 0x02B0)
class APropBatchActor final : public AActor
{
public:
	class UPropBatchComponent*                    PropBatchComponent;                                // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ClearAllProps();
	void RefreshProps();
	void SetupFromDataAsset();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropBatchActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropBatchActor")
	}
	static class APropBatchActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APropBatchActor>();
	}
};
DUMPER7_ASSERTS_APropBatchActor;

// Class KuroDynamicMeshBatch.PropBatchComponent
// 0x0010 (0x0230 - 0x0220)
class UPropBatchComponent final : public USceneComponent
{
public:
	class UPropGroupDataAsset*                    DataAsset;                                         // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UBatchableComponent*>            SpawnedProps;                                      // 0x0220(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	void ClearAllProps();
	void RefreshProps();
	void SetupFromDataAsset(class UPropGroupDataAsset* InDataAsset, class AActor* TargetActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropBatchComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropBatchComponent")
	}
	static class UPropBatchComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropBatchComponent>();
	}
};
DUMPER7_ASSERTS_UPropBatchComponent;

// Class KuroDynamicMeshBatch.PropGroupDataAsset
// 0x0010 (0x0048 - 0x0038)
class UPropGroupDataAsset final : public UPrimaryDataAsset
{
public:
	TArray<struct FPropGroup>                     PropGroups;                                        // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropGroupDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropGroupDataAsset")
	}
	static class UPropGroupDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropGroupDataAsset>();
	}
};
DUMPER7_ASSERTS_UPropGroupDataAsset;

}

