#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroRenderingRuntimeBPPlugin

#include "Basic.hpp"

#include "KuroGamePartition_structs.hpp"
#include "ProceduralMeshComponent_classes.hpp"
#include "KuroGameBudget_classes.hpp"
#include "KuroMath_structs.hpp"
#include "KuroPointCloud_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "KuroCurve_structs.hpp"
#include "Renderer_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "MovieScene_classes.hpp"
#include "Niagara_classes.hpp"


namespace SDK
{

// Class KuroRenderingRuntimeBPPlugin.KuroVolumetricQualitySettings
// 0x0010 (0x0058 - 0x0048)
class UKuroVolumetricQualitySettings final : public UDeveloperSettings
{
public:
	TArray<class FString>                         VolumetricQuality;                                 // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroVolumetricQualitySettings">();
	}
	static class UKuroVolumetricQualitySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroVolumetricQualitySettings>();
	}
};
static_assert(alignof(UKuroVolumetricQualitySettings) == 0x000008, "Wrong alignment on UKuroVolumetricQualitySettings");
static_assert(sizeof(UKuroVolumetricQualitySettings) == 0x000058, "Wrong size on UKuroVolumetricQualitySettings");
static_assert(offsetof(UKuroVolumetricQualitySettings, VolumetricQuality) == 0x000048, "Member 'UKuroVolumetricQualitySettings::VolumetricQuality' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.InteractiveLeavesConfigData
// 0x0128 (0x0160 - 0x0038)
class UInteractiveLeavesConfigData final : public UPrimaryDataAsset
{
public:
	class UKuroPointCloudCache*                   PointCache;                                        // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroPointCloudCache*                   PointCacheMobile;                                  // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            InstanceMesh;                                      // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     InstanceMaterial;                                  // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            WholeMesh;                                         // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            WholeMeshMobile;                                   // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     WholeMaterial;                                     // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerRadius;                                      // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReviveRadius;                                      // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LifeTime;                                          // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialAgeRandom;                                  // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisappearTime;                                     // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReviveTime;                                        // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Drag;                                              // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerForceSize;                                   // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerForceExp;                                    // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitVelocitySizeMin;                               // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitVelocitySizeMax;                               // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitFloatVelocitySizeMin;                          // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitFloatVelocitySizeMax;                          // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ConstForce;                                        // 0x00A4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKuroPointKdTree                       SpatialTree;                                       // 0x00B0(0x0058)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FKuroPointKdTree                       SpatialTreeMobile;                                 // 0x0108(0x0058)(Edit, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractiveLeavesConfigData">();
	}
	static class UInteractiveLeavesConfigData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractiveLeavesConfigData>();
	}
};
static_assert(alignof(UInteractiveLeavesConfigData) == 0x000008, "Wrong alignment on UInteractiveLeavesConfigData");
static_assert(sizeof(UInteractiveLeavesConfigData) == 0x000160, "Wrong size on UInteractiveLeavesConfigData");
static_assert(offsetof(UInteractiveLeavesConfigData, PointCache) == 0x000038, "Member 'UInteractiveLeavesConfigData::PointCache' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, PointCacheMobile) == 0x000040, "Member 'UInteractiveLeavesConfigData::PointCacheMobile' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, InstanceMesh) == 0x000048, "Member 'UInteractiveLeavesConfigData::InstanceMesh' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, InstanceMaterial) == 0x000050, "Member 'UInteractiveLeavesConfigData::InstanceMaterial' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, WholeMesh) == 0x000058, "Member 'UInteractiveLeavesConfigData::WholeMesh' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, WholeMeshMobile) == 0x000060, "Member 'UInteractiveLeavesConfigData::WholeMeshMobile' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, WholeMaterial) == 0x000068, "Member 'UInteractiveLeavesConfigData::WholeMaterial' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, PlayerRadius) == 0x000070, "Member 'UInteractiveLeavesConfigData::PlayerRadius' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, ReviveRadius) == 0x000074, "Member 'UInteractiveLeavesConfigData::ReviveRadius' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, LifeTime) == 0x000078, "Member 'UInteractiveLeavesConfigData::LifeTime' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, InitialAgeRandom) == 0x00007C, "Member 'UInteractiveLeavesConfigData::InitialAgeRandom' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, DisappearTime) == 0x000080, "Member 'UInteractiveLeavesConfigData::DisappearTime' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, ReviveTime) == 0x000084, "Member 'UInteractiveLeavesConfigData::ReviveTime' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, Drag) == 0x000088, "Member 'UInteractiveLeavesConfigData::Drag' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, PlayerForceSize) == 0x00008C, "Member 'UInteractiveLeavesConfigData::PlayerForceSize' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, PlayerForceExp) == 0x000090, "Member 'UInteractiveLeavesConfigData::PlayerForceExp' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, InitVelocitySizeMin) == 0x000094, "Member 'UInteractiveLeavesConfigData::InitVelocitySizeMin' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, InitVelocitySizeMax) == 0x000098, "Member 'UInteractiveLeavesConfigData::InitVelocitySizeMax' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, InitFloatVelocitySizeMin) == 0x00009C, "Member 'UInteractiveLeavesConfigData::InitFloatVelocitySizeMin' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, InitFloatVelocitySizeMax) == 0x0000A0, "Member 'UInteractiveLeavesConfigData::InitFloatVelocitySizeMax' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, ConstForce) == 0x0000A4, "Member 'UInteractiveLeavesConfigData::ConstForce' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, SpatialTree) == 0x0000B0, "Member 'UInteractiveLeavesConfigData::SpatialTree' has a wrong offset!");
static_assert(offsetof(UInteractiveLeavesConfigData, SpatialTreeMobile) == 0x000108, "Member 'UInteractiveLeavesConfigData::SpatialTreeMobile' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.KuroScreenBlueLightFilterParameter
// 0x0018 (0x0050 - 0x0038)
class UKuroScreenBlueLightFilterParameter final : public UDataAsset
{
public:
	float                                         ScreenBlueLightFilterStrength;                     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenBlueLightFilterTemperature;                  // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenBrightnessClampMax;                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenBrightnessClampSoftness;                     // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenBlueLightFilterTextureIntensity;             // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroScreenBlueLightFilterParameter">();
	}
	static class UKuroScreenBlueLightFilterParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroScreenBlueLightFilterParameter>();
	}
};
static_assert(alignof(UKuroScreenBlueLightFilterParameter) == 0x000008, "Wrong alignment on UKuroScreenBlueLightFilterParameter");
static_assert(sizeof(UKuroScreenBlueLightFilterParameter) == 0x000050, "Wrong size on UKuroScreenBlueLightFilterParameter");
static_assert(offsetof(UKuroScreenBlueLightFilterParameter, ScreenBlueLightFilterStrength) == 0x000038, "Member 'UKuroScreenBlueLightFilterParameter::ScreenBlueLightFilterStrength' has a wrong offset!");
static_assert(offsetof(UKuroScreenBlueLightFilterParameter, ScreenBlueLightFilterTemperature) == 0x00003C, "Member 'UKuroScreenBlueLightFilterParameter::ScreenBlueLightFilterTemperature' has a wrong offset!");
static_assert(offsetof(UKuroScreenBlueLightFilterParameter, ScreenBrightnessClampMax) == 0x000040, "Member 'UKuroScreenBlueLightFilterParameter::ScreenBrightnessClampMax' has a wrong offset!");
static_assert(offsetof(UKuroScreenBlueLightFilterParameter, ScreenBrightnessClampSoftness) == 0x000044, "Member 'UKuroScreenBlueLightFilterParameter::ScreenBrightnessClampSoftness' has a wrong offset!");
static_assert(offsetof(UKuroScreenBlueLightFilterParameter, ScreenBlueLightFilterTextureIntensity) == 0x000048, "Member 'UKuroScreenBlueLightFilterParameter::ScreenBlueLightFilterTextureIntensity' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.KuroBPActor
// 0x0000 (0x03A8 - 0x03A8)
class AKuroBPActor : public AKuroGameBudgetBlueprintActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroBPActor">();
	}
	static class AKuroBPActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroBPActor>();
	}
};
static_assert(alignof(AKuroBPActor) == 0x000008, "Wrong alignment on AKuroBPActor");
static_assert(sizeof(AKuroBPActor) == 0x0003A8, "Wrong size on AKuroBPActor");

// Class KuroRenderingRuntimeBPPlugin.KuroBezierMeshComponent
// 0x00B0 (0x0680 - 0x05D0)
class UKuroBezierMeshComponent final : public UProceduralMeshComponent
{
public:
	uint8                                         Pad_5C8[0xB8];                                     // 0x05C8(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddLayer(float alpha);
	void ClearData();
	void Dissipate(float SubLayersNum);
	int32 GetLayerNum();
	int32 GetMeshHeight();
	TArray<struct FVector> GetMeshPoints();
	TArray<int32> GetMeshTriangles();
	int32 GetMeshWidth();
	TArray<struct FVector> GetPointsArray();
	void SetKeyPoint(int32 Index_0, float X, float Y, float Z);
	void Setup(int32 Width, float InUnitLength);
	void UpdateMesh(int32 Section);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroBezierMeshComponent">();
	}
	static class UKuroBezierMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroBezierMeshComponent>();
	}
};
static_assert(alignof(UKuroBezierMeshComponent) == 0x000010, "Wrong alignment on UKuroBezierMeshComponent");
static_assert(sizeof(UKuroBezierMeshComponent) == 0x000680, "Wrong size on UKuroBezierMeshComponent");

// Class KuroRenderingRuntimeBPPlugin.InteractiveLeaves
// 0x01E0 (0x0490 - 0x02B0)
class alignas(0x10) AInteractiveLeaves final : public AActor
{
public:
	class UInstancedStaticMeshComponent*          IsmComponent;                                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   StaticComponent;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInteractiveLeavesConfigData*           Config;                                            // 0x02C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x1C8];                                    // 0x02C8(0x01C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractiveLeaves">();
	}
	static class AInteractiveLeaves* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteractiveLeaves>();
	}
};
static_assert(alignof(AInteractiveLeaves) == 0x000010, "Wrong alignment on AInteractiveLeaves");
static_assert(sizeof(AInteractiveLeaves) == 0x000490, "Wrong size on AInteractiveLeaves");
static_assert(offsetof(AInteractiveLeaves, IsmComponent) == 0x0002B0, "Member 'AInteractiveLeaves::IsmComponent' has a wrong offset!");
static_assert(offsetof(AInteractiveLeaves, StaticComponent) == 0x0002B8, "Member 'AInteractiveLeaves::StaticComponent' has a wrong offset!");
static_assert(offsetof(AInteractiveLeaves, Config) == 0x0002C0, "Member 'AInteractiveLeaves::Config' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.KuroActorCullingLocalVolume
// 0x0018 (0x0300 - 0x02E8)
class AKuroActorCullingLocalVolume final : public AVolume
{
public:
	uint8                                         Pad_2E8[0x18];                                     // 0x02E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroActorCullingLocalVolume">();
	}
	static class AKuroActorCullingLocalVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroActorCullingLocalVolume>();
	}
};
static_assert(alignof(AKuroActorCullingLocalVolume) == 0x000008, "Wrong alignment on AKuroActorCullingLocalVolume");
static_assert(sizeof(AKuroActorCullingLocalVolume) == 0x000300, "Wrong size on AKuroActorCullingLocalVolume");

// Class KuroRenderingRuntimeBPPlugin.KuroGlobalColorSplitTextures
// 0x0050 (0x0088 - 0x0038)
class UKuroGlobalColorSplitTextures final : public UDataAsset
{
public:
	TMap<struct FWPCoord, TSoftObjectPtr<class UTexture2D>> CoordTexPair;                            // 0x0038(0x0050)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroGlobalColorSplitTextures">();
	}
	static class UKuroGlobalColorSplitTextures* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroGlobalColorSplitTextures>();
	}
};
static_assert(alignof(UKuroGlobalColorSplitTextures) == 0x000008, "Wrong alignment on UKuroGlobalColorSplitTextures");
static_assert(sizeof(UKuroGlobalColorSplitTextures) == 0x000088, "Wrong size on UKuroGlobalColorSplitTextures");
static_assert(offsetof(UKuroGlobalColorSplitTextures, CoordTexPair) == 0x000038, "Member 'UKuroGlobalColorSplitTextures::CoordTexPair' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.KuroSceneInteractionInfo
// 0x0048 (0x0078 - 0x0030)
class UKuroSceneInteractionInfo final : public UObject
{
public:
	struct FVector                                Location;                                          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 LevelName;                                         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HandleId;                                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroSceneInteractionState                    CurrentState;                                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LoadingLevelComplete;                              // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AKuroSceneInteractionActor*             InteractionActor;                                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelStreamingDynamic*                 LevelStreaming;                                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLevelShown();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroSceneInteractionInfo">();
	}
	static class UKuroSceneInteractionInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroSceneInteractionInfo>();
	}
};
static_assert(alignof(UKuroSceneInteractionInfo) == 0x000008, "Wrong alignment on UKuroSceneInteractionInfo");
static_assert(sizeof(UKuroSceneInteractionInfo) == 0x000078, "Wrong size on UKuroSceneInteractionInfo");
static_assert(offsetof(UKuroSceneInteractionInfo, Location) == 0x000030, "Member 'UKuroSceneInteractionInfo::Location' has a wrong offset!");
static_assert(offsetof(UKuroSceneInteractionInfo, Rotation) == 0x00003C, "Member 'UKuroSceneInteractionInfo::Rotation' has a wrong offset!");
static_assert(offsetof(UKuroSceneInteractionInfo, LevelName) == 0x000048, "Member 'UKuroSceneInteractionInfo::LevelName' has a wrong offset!");
static_assert(offsetof(UKuroSceneInteractionInfo, HandleId) == 0x000058, "Member 'UKuroSceneInteractionInfo::HandleId' has a wrong offset!");
static_assert(offsetof(UKuroSceneInteractionInfo, CurrentState) == 0x00005C, "Member 'UKuroSceneInteractionInfo::CurrentState' has a wrong offset!");
static_assert(offsetof(UKuroSceneInteractionInfo, LoadingLevelComplete) == 0x00005D, "Member 'UKuroSceneInteractionInfo::LoadingLevelComplete' has a wrong offset!");
static_assert(offsetof(UKuroSceneInteractionInfo, InteractionActor) == 0x000060, "Member 'UKuroSceneInteractionInfo::InteractionActor' has a wrong offset!");
static_assert(offsetof(UKuroSceneInteractionInfo, LevelStreaming) == 0x000068, "Member 'UKuroSceneInteractionInfo::LevelStreaming' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.KuroAnimNotify
// 0x0008 (0x0048 - 0x0040)
class UKuroAnimNotify : public UAnimNotify
{
public:
	int32                                         exportIndex;                                       // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool K2_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);
	bool K2_PostChangeProperty(const class FName PropertyName);
	bool K2_ValidateAssets();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroAnimNotify">();
	}
	static class UKuroAnimNotify* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAnimNotify>();
	}
};
static_assert(alignof(UKuroAnimNotify) == 0x000008, "Wrong alignment on UKuroAnimNotify");
static_assert(sizeof(UKuroAnimNotify) == 0x000048, "Wrong size on UKuroAnimNotify");
static_assert(offsetof(UKuroAnimNotify, exportIndex) == 0x000040, "Member 'UKuroAnimNotify::exportIndex' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.KuroAnimNotifyState
// 0x0008 (0x0048 - 0x0040)
class UKuroAnimNotifyState : public UAnimNotifyState
{
public:
	int32                                         exportIndex;                                       // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool K2_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration);
	bool K2_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);
	bool K2_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime);
	bool K2_PostChangeProperty(const class FName PropertyName);
	bool K2_ValidateAssets();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroAnimNotifyState">();
	}
	static class UKuroAnimNotifyState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAnimNotifyState>();
	}
};
static_assert(alignof(UKuroAnimNotifyState) == 0x000008, "Wrong alignment on UKuroAnimNotifyState");
static_assert(sizeof(UKuroAnimNotifyState) == 0x000048, "Wrong size on UKuroAnimNotifyState");
static_assert(offsetof(UKuroAnimNotifyState, exportIndex) == 0x000040, "Member 'UKuroAnimNotifyState::exportIndex' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.KuroGISystem
// 0x0578 (0x05B0 - 0x0038)
class alignas(0x10) UKuroGISystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroScreenFilterDataAsset*             KuroScreenFilterDataAsset;                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroScreenBlueLightFilterDataAsset*    KuroScreenBlueLightFilterDataAsset;                // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x210];                                     // 0x0050(0x0210)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UObject*>             WeatherData;                                       // 0x0260(0x0050)(Transient, NativeAccessSpecifierPublic)
	class UKuroScreenBlueLightFilterDataAsset*    FilterSystemData;                                  // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0xF8];                                     // 0x02B8(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroWorldPartitionPreviewManager*      WorldPartitionPreviewManager;                      // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKuroPostprocessMaterialManager        PostprocessMaterialManager;                        // 0x03B8(0x0030)(BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FKuroSceneEffectActorManager           SceneEffectActorManager;                           // 0x03E8(0x0028)(NativeAccessSpecifierPublic)
	class UKuroRenderingPropertyDebugger*         PropertyDebugger;                                  // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_418[0x58];                                     // 0x0418(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroRainManager*                       RainManager;                                       // 0x0470(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_478[0x138];                                    // 0x0478(0x0138)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void ApplyEyeProtectionBrightness(class UWorld* InWorld, float Brightness, float EnvironmentID);
	static void ApplyEyeProtectionEnvironment(class UWorld* InWorld, float EnvironmentID);
	static void ApplyEyeProtectionStrength(class UWorld* InWorld, float EyeProtectIntensity, float EnvironmentID);
	static void ApplyEyeProtectionTemperature(class UWorld* InWorld, float Temperature, float EnvironmentID);
	static void ApplyEyeProtectionTexture(class UWorld* InWorld, float TextureIntensityID, float EnvironmentID);
	static class UKuroGISystem* GetKuroGISystem(class UWorld* InWorld);
	static void SetKuroAdvancedModeScreenFilter(class UWorld* InWorld, const int32 ScreenFilterIndex, float X, float Y, float Intensity, float KuroSharpenIntensity, float AdModeBrightness, float AdModeScreenFilterContrast, float AdModeScreenFilteColorTemperature, float AdModeScreenFilterSaturation, float AdModeBloom, float AdModeNoiseIntensity, float AdModeShadowIntensity, float AdModeGamma, float AdModeHalation);
	static void SetKuroScreenFilterInterpolation(class UWorld* InWorld, const int32 ScreenFilterIndex, float X, float Y, float Intensity);

	void DoTransition(class FName CollectionName, int32 TransitionState, float TransitionTime);
	bool End3DUISceneRendering();
	class AKuroGlobalGI* GetKuroGlobalGIActor();
	bool IsLastTickGIActor(class AKuroGlobalGI* Actor);
	bool IsUISceneRendering();
	bool Start3DUISceneRendering(const class FString& InLevelName);

	EKuroUI3DState GetUISceneRenderingState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroGISystem">();
	}
	static class UKuroGISystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroGISystem>();
	}
};
static_assert(alignof(UKuroGISystem) == 0x000010, "Wrong alignment on UKuroGISystem");
static_assert(sizeof(UKuroGISystem) == 0x0005B0, "Wrong size on UKuroGISystem");
static_assert(offsetof(UKuroGISystem, KuroScreenFilterDataAsset) == 0x000040, "Member 'UKuroGISystem::KuroScreenFilterDataAsset' has a wrong offset!");
static_assert(offsetof(UKuroGISystem, KuroScreenBlueLightFilterDataAsset) == 0x000048, "Member 'UKuroGISystem::KuroScreenBlueLightFilterDataAsset' has a wrong offset!");
static_assert(offsetof(UKuroGISystem, WeatherData) == 0x000260, "Member 'UKuroGISystem::WeatherData' has a wrong offset!");
static_assert(offsetof(UKuroGISystem, FilterSystemData) == 0x0002B0, "Member 'UKuroGISystem::FilterSystemData' has a wrong offset!");
static_assert(offsetof(UKuroGISystem, WorldPartitionPreviewManager) == 0x0003B0, "Member 'UKuroGISystem::WorldPartitionPreviewManager' has a wrong offset!");
static_assert(offsetof(UKuroGISystem, PostprocessMaterialManager) == 0x0003B8, "Member 'UKuroGISystem::PostprocessMaterialManager' has a wrong offset!");
static_assert(offsetof(UKuroGISystem, SceneEffectActorManager) == 0x0003E8, "Member 'UKuroGISystem::SceneEffectActorManager' has a wrong offset!");
static_assert(offsetof(UKuroGISystem, PropertyDebugger) == 0x000410, "Member 'UKuroGISystem::PropertyDebugger' has a wrong offset!");
static_assert(offsetof(UKuroGISystem, RainManager) == 0x000470, "Member 'UKuroGISystem::RainManager' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.KuroANSCurveTrailDecal
// 0x0058 (0x00A0 - 0x0048)
class UKuroANSCurveTrailDecal final : public UKuroAnimNotifyState
{
public:
	class FName                                   AttachSocketName;                                  // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             AttachTransform;                                   // 0x0060(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UKuroCurveTrailDecalConfig*             Config;                                            // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroANSCurveTrailDecal">();
	}
	static class UKuroANSCurveTrailDecal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroANSCurveTrailDecal>();
	}
};
static_assert(alignof(UKuroANSCurveTrailDecal) == 0x000010, "Wrong alignment on UKuroANSCurveTrailDecal");
static_assert(sizeof(UKuroANSCurveTrailDecal) == 0x0000A0, "Wrong size on UKuroANSCurveTrailDecal");
static_assert(offsetof(UKuroANSCurveTrailDecal, AttachSocketName) == 0x000048, "Member 'UKuroANSCurveTrailDecal::AttachSocketName' has a wrong offset!");
static_assert(offsetof(UKuroANSCurveTrailDecal, AttachTransform) == 0x000060, "Member 'UKuroANSCurveTrailDecal::AttachTransform' has a wrong offset!");
static_assert(offsetof(UKuroANSCurveTrailDecal, Config) == 0x000090, "Member 'UKuroANSCurveTrailDecal::Config' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.KuroSuperFarFog
// 0x00D8 (0x0480 - 0x03A8)
class AKuroSuperFarFog final : public AKuroGameBudgetBlueprintActor
{
public:
	class UStaticMeshComponent*                   FogMeshComponent;                                  // 0x03A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UKuroSuperFarFogConfig*                 Config;                                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDayNightMixColor;                              // 0x03B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ColorTintDay;                                      // 0x03BC(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           ColorTintNight;                                    // 0x03CC(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroCurveFloat                        DayNightMixCurve;                                  // 0x03E0(0x0090)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_470[0x10];                                     // 0x0470(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Update(float DeltaSeconds);
	void UpdateFog();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroSuperFarFog">();
	}
	static class AKuroSuperFarFog* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroSuperFarFog>();
	}
};
static_assert(alignof(AKuroSuperFarFog) == 0x000008, "Wrong alignment on AKuroSuperFarFog");
static_assert(sizeof(AKuroSuperFarFog) == 0x000480, "Wrong size on AKuroSuperFarFog");
static_assert(offsetof(AKuroSuperFarFog, FogMeshComponent) == 0x0003A8, "Member 'AKuroSuperFarFog::FogMeshComponent' has a wrong offset!");
static_assert(offsetof(AKuroSuperFarFog, Config) == 0x0003B0, "Member 'AKuroSuperFarFog::Config' has a wrong offset!");
static_assert(offsetof(AKuroSuperFarFog, bUseDayNightMixColor) == 0x0003B8, "Member 'AKuroSuperFarFog::bUseDayNightMixColor' has a wrong offset!");
static_assert(offsetof(AKuroSuperFarFog, ColorTintDay) == 0x0003BC, "Member 'AKuroSuperFarFog::ColorTintDay' has a wrong offset!");
static_assert(offsetof(AKuroSuperFarFog, ColorTintNight) == 0x0003CC, "Member 'AKuroSuperFarFog::ColorTintNight' has a wrong offset!");
static_assert(offsetof(AKuroSuperFarFog, DayNightMixCurve) == 0x0003E0, "Member 'AKuroSuperFarFog::DayNightMixCurve' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.KuroBillboardComponent
// 0x0010 (0x00D0 - 0x00C0)
class UKuroBillboardComponent final : public UActorComponent
{
public:
	bool                                          IsUpdateEveryFrame;                                // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBillboardMode                                OrientAxis;                                        // 0x00C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFixSize;                                         // 0x00C2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScaleSize;                                         // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinSize;                                           // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Initialize();

	void Update() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroBillboardComponent">();
	}
	static class UKuroBillboardComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroBillboardComponent>();
	}
};
static_assert(alignof(UKuroBillboardComponent) == 0x000008, "Wrong alignment on UKuroBillboardComponent");
static_assert(sizeof(UKuroBillboardComponent) == 0x0000D0, "Wrong size on UKuroBillboardComponent");
static_assert(offsetof(UKuroBillboardComponent, IsUpdateEveryFrame) == 0x0000C0, "Member 'UKuroBillboardComponent::IsUpdateEveryFrame' has a wrong offset!");
static_assert(offsetof(UKuroBillboardComponent, OrientAxis) == 0x0000C1, "Member 'UKuroBillboardComponent::OrientAxis' has a wrong offset!");
static_assert(offsetof(UKuroBillboardComponent, IsFixSize) == 0x0000C2, "Member 'UKuroBillboardComponent::IsFixSize' has a wrong offset!");
static_assert(offsetof(UKuroBillboardComponent, ScaleSize) == 0x0000C4, "Member 'UKuroBillboardComponent::ScaleSize' has a wrong offset!");
static_assert(offsetof(UKuroBillboardComponent, MaxDistance) == 0x0000C8, "Member 'UKuroBillboardComponent::MaxDistance' has a wrong offset!");
static_assert(offsetof(UKuroBillboardComponent, MinSize) == 0x0000CC, "Member 'UKuroBillboardComponent::MinSize' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.KuroBookPavingActor
// 0x0018 (0x02C8 - 0x02B0)
class AKuroBookPavingActor final : public AActor
{
public:
	TArray<struct FBookPavingDataStruct>          DataList;                                          // 0x02B0(0x0010)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroBookPavingActor">();
	}
	static class AKuroBookPavingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroBookPavingActor>();
	}
};
static_assert(alignof(AKuroBookPavingActor) == 0x000008, "Wrong alignment on AKuroBookPavingActor");
static_assert(sizeof(AKuroBookPavingActor) == 0x0002C8, "Wrong size on AKuroBookPavingActor");
static_assert(offsetof(AKuroBookPavingActor, DataList) == 0x0002B0, "Member 'AKuroBookPavingActor::DataList' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.KuroGPUParticleSubsystem
// 0x0030 (0x0068 - 0x0038)
class UKuroGPUParticleSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x30];                                      // 0x0038(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UKuroGPUParticleSubsystem* GetKuroGPUParticleSystem(class UWorld* InWorld);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroGPUParticleSubsystem">();
	}
	static class UKuroGPUParticleSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroGPUParticleSubsystem>();
	}
};
static_assert(alignof(UKuroGPUParticleSubsystem) == 0x000008, "Wrong alignment on UKuroGPUParticleSubsystem");
static_assert(sizeof(UKuroGPUParticleSubsystem) == 0x000068, "Wrong size on UKuroGPUParticleSubsystem");

// Class KuroRenderingRuntimeBPPlugin.UKuroCustomCookActor
// 0x0000 (0x03A8 - 0x03A8)
class AUKuroCustomCookActor : public AKuroGameBudgetBlueprintActor
{
public:
	void BeforeCookForMobile();
	void BeforeCookForPC();
	void BeforeSave();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UKuroCustomCookActor">();
	}
	static class AUKuroCustomCookActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUKuroCustomCookActor>();
	}
};
static_assert(alignof(AUKuroCustomCookActor) == 0x000008, "Wrong alignment on AUKuroCustomCookActor");
static_assert(sizeof(AUKuroCustomCookActor) == 0x0003A8, "Wrong size on AUKuroCustomCookActor");

// Class KuroRenderingRuntimeBPPlugin.KuroBPCustomCookActor
// 0x0000 (0x03A8 - 0x03A8)
class AKuroBPCustomCookActor : public AUKuroCustomCookActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroBPCustomCookActor">();
	}
	static class AKuroBPCustomCookActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroBPCustomCookActor>();
	}
};
static_assert(alignof(AKuroBPCustomCookActor) == 0x000008, "Wrong alignment on AKuroBPCustomCookActor");
static_assert(sizeof(AKuroBPCustomCookActor) == 0x0003A8, "Wrong size on AKuroBPCustomCookActor");

// Class KuroRenderingRuntimeBPPlugin.KuroEditorTickActor
// 0x0010 (0x03B8 - 0x03A8)
class AKuroEditorTickActor : public AKuroGameBudgetBlueprintActor
{
public:
	bool                                          bEditorTickBySelected;                             // 0x03A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetActorComponentTickEnabledByFocus;              // 0x03A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3AA[0x2];                                      // 0x03AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         KuroEditorTickActorId;                             // 0x03AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSyncFolderPathToAttachChildren;                   // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EditorFocusIn();
	void EditorFocusOut();
	void EditorInit();
	void EditorTick(float DeltaSeconds);

	void EditorSetActorComponentsTickEnabled(bool bValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroEditorTickActor">();
	}
	static class AKuroEditorTickActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroEditorTickActor>();
	}
};
static_assert(alignof(AKuroEditorTickActor) == 0x000008, "Wrong alignment on AKuroEditorTickActor");
static_assert(sizeof(AKuroEditorTickActor) == 0x0003B8, "Wrong size on AKuroEditorTickActor");
static_assert(offsetof(AKuroEditorTickActor, bEditorTickBySelected) == 0x0003A8, "Member 'AKuroEditorTickActor::bEditorTickBySelected' has a wrong offset!");
static_assert(offsetof(AKuroEditorTickActor, bSetActorComponentTickEnabledByFocus) == 0x0003A9, "Member 'AKuroEditorTickActor::bSetActorComponentTickEnabledByFocus' has a wrong offset!");
static_assert(offsetof(AKuroEditorTickActor, KuroEditorTickActorId) == 0x0003AC, "Member 'AKuroEditorTickActor::KuroEditorTickActorId' has a wrong offset!");
static_assert(offsetof(AKuroEditorTickActor, bSyncFolderPathToAttachChildren) == 0x0003B0, "Member 'AKuroEditorTickActor::bSyncFolderPathToAttachChildren' has a wrong offset!");

// Class KuroRenderingRuntimeBPPlugin.KuroGlobalGI
// 0x3148 (0x34F0 - 0x03A8)
class AKuroGlobalGI : public AKuroGameBudgetBlueprintActor
{
public:
	bool                                          TickInEditor;                                      // 0x03A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPersistentLevelGI;                               // 0x03A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPostProcessVolumeChanged;                         // 0x03AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3AB[0x1];                                      // 0x03AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TickDeltaTime;                                     // 0x03AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ViewLocation;                                      // 0x03B0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableGlobalGITransition;                         // 0x03BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableFixedTimeState;                             // 0x03BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3BE[0x2];                                      // 0x03BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SunHorizonAngle;                                   // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SunVerticalAngle;                                  // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsReversed;                                        // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReverseZCenter;                                    // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLockSceneLightVerticalAngle;                      // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SceneLightVerticalAngleRange;                      // 0x03D4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroGISetting                         LerpGISetting;                                     // 0x03E0(0x1140)(Edit, BlueprintVisible, Transient, EditConst, NativeAccessSpecifierPublic)
	struct FKuroGISetting                         TempGISetting;                                     // 0x1520(0x1140)(Edit, BlueprintVisible, Transient, EditConst, NativeAccessSpecifierPublic)
	struct FPostProcessSettings                   LerpPostProcessSetting;                            // 0x2660(0x0910)(Edit, BlueprintVisible, Transient, EditConst, NativeAccessSpecifierPublic)
	bool                                          bContrlTODTime;                                    // 0x2F70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F71[0x3];                                     // 0x2F71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurTimeAfterLerp;                                  // 0x2F74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LerpSunHorizonAngle;                               // 0x2F78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LerpSunVerticalAngle;                              // 0x2F7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GlobalWindSpeed;                                   // 0x2F80(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GlobalWindSpeedWithoutTimeDilation;                // 0x2F84(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GlobalWindPower;                                   // 0x2F88(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GlobalTimeDilation;                                // 0x2F8C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                GlobalWindForwardDrection;                         // 0x2F90(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WindTextureOffset;                                 // 0x2F9C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDayTime;                                        // 0x2FA8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDayNightEmssiveFactor;                            // 0x2FA9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2FAA[0x2];                                     // 0x2FAA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DayNightEmssiveSmoothFactor;                       // 0x2FAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TODNightLightLoadingTime;                          // 0x2FB0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TODDayLightLoadingTime;                            // 0x2FB4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TODEmssiveCloseLerpFade;                           // 0x2FB8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NowGlobalLightIntensity;                           // 0x2FBC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2FC0[0x1];                                     // 0x2FC0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bRainAffectPointLight;                             // 0x2FC1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2FC2[0x2];                                     // 0x2FC2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CharLightHorizontal;                               // 0x2FC4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CharDebugLightDirection;                           // 0x2FC8(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CharDebugLightDirectionZero;                       // 0x2FD4(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               AtmosphereSunRotation;                             // 0x2FE0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                AtmosphereSunForward;                              // 0x2FEC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               AtmosphereMoonRotation;                            // 0x2FF8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                AtmosphereMoonForward;                             // 0x3004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KuroViewCenterPlayerIndex;                         // 0x3010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KuroViewCenterHeightOffset;                        // 0x3014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCustomKuroViewCenter;                       // 0x3018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3019[0x3];                                     // 0x3019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CustomKuroViewCenter;                              // 0x301C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CurrentKuroViewCenter;                             // 0x3028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
