#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroComputeShader

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum KuroComputeShader.EColliderType_genericCloth
// NumValues: 0x0004
enum class EColliderType_genericCloth : uint8
{
	None                                     = 0,
	Box                                      = 1,
	Cylinder                                 = 2,
	EColliderType_MAX                        = 3,
};

// ScriptStruct KuroComputeShader.KuroCSParticle_chain
// 0x0040 (0x0040 - 0x0000)
struct FKuroCSParticle_chain final
{
public:
	struct FVector                                pos;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LeftID;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                posFoe;                                            // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RightID;                                           // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                pos_bind;                                          // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         isPinned;                                          // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                vol;                                               // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         padding0;                                          // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FKuroCSParticle_chain) == 0x000004, "Wrong alignment on FKuroCSParticle_chain");
static_assert(sizeof(FKuroCSParticle_chain) == 0x000040, "Wrong size on FKuroCSParticle_chain");
static_assert(offsetof(FKuroCSParticle_chain, pos) == 0x000000, "Member 'FKuroCSParticle_chain::pos' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain, LeftID) == 0x00000C, "Member 'FKuroCSParticle_chain::LeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain, posFoe) == 0x000010, "Member 'FKuroCSParticle_chain::posFoe' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain, RightID) == 0x00001C, "Member 'FKuroCSParticle_chain::RightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain, pos_bind) == 0x000020, "Member 'FKuroCSParticle_chain::pos_bind' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain, isPinned) == 0x00002C, "Member 'FKuroCSParticle_chain::isPinned' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain, vol) == 0x000030, "Member 'FKuroCSParticle_chain::vol' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain, padding0) == 0x00003C, "Member 'FKuroCSParticle_chain::padding0' has a wrong offset!");

// ScriptStruct KuroComputeShader.KuroCSParticle_chain30
// 0x0050 (0x0050 - 0x0000)
struct FKuroCSParticle_chain30 final
{
public:
	struct FVector                                pos;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LeftID;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                posFoe;                                            // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RightID;                                           // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                pos_bind;                                          // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         isPinned;                                          // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                vol;                                               // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         leftDis;                                           // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         rightDis;                                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroCSParticle_chain30) == 0x000004, "Wrong alignment on FKuroCSParticle_chain30");
static_assert(sizeof(FKuroCSParticle_chain30) == 0x000050, "Wrong size on FKuroCSParticle_chain30");
static_assert(offsetof(FKuroCSParticle_chain30, pos) == 0x000000, "Member 'FKuroCSParticle_chain30::pos' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain30, LeftID) == 0x00000C, "Member 'FKuroCSParticle_chain30::LeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain30, posFoe) == 0x000010, "Member 'FKuroCSParticle_chain30::posFoe' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain30, RightID) == 0x00001C, "Member 'FKuroCSParticle_chain30::RightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain30, pos_bind) == 0x000020, "Member 'FKuroCSParticle_chain30::pos_bind' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain30, isPinned) == 0x00002C, "Member 'FKuroCSParticle_chain30::isPinned' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain30, vol) == 0x000030, "Member 'FKuroCSParticle_chain30::vol' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain30, leftDis) == 0x00003C, "Member 'FKuroCSParticle_chain30::leftDis' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_chain30, rightDis) == 0x000040, "Member 'FKuroCSParticle_chain30::rightDis' has a wrong offset!");

// ScriptStruct KuroComputeShader.KuroCSParticle_cloth
// 0x0070 (0x0070 - 0x0000)
struct FKuroCSParticle_cloth final
{
public:
	struct FVector                                pos;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LeftID;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                posFoe;                                            // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RightID;                                           // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                pos_bind;                                          // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopID;                                             // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                vol;                                               // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomID;                                          // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomLeftID;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomRightID;                                     // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopLeftID;                                         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopRightID;                                        // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomRightRightID;                                // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopLeftLeftID;                                     // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         isPinned;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                pos_beforeStage;                                   // 0x0060(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroCSParticle_cloth) == 0x000004, "Wrong alignment on FKuroCSParticle_cloth");
static_assert(sizeof(FKuroCSParticle_cloth) == 0x000070, "Wrong size on FKuroCSParticle_cloth");
static_assert(offsetof(FKuroCSParticle_cloth, pos) == 0x000000, "Member 'FKuroCSParticle_cloth::pos' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, LeftID) == 0x00000C, "Member 'FKuroCSParticle_cloth::LeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, posFoe) == 0x000010, "Member 'FKuroCSParticle_cloth::posFoe' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, RightID) == 0x00001C, "Member 'FKuroCSParticle_cloth::RightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, pos_bind) == 0x000020, "Member 'FKuroCSParticle_cloth::pos_bind' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, TopID) == 0x00002C, "Member 'FKuroCSParticle_cloth::TopID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, vol) == 0x000030, "Member 'FKuroCSParticle_cloth::vol' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, BottomID) == 0x00003C, "Member 'FKuroCSParticle_cloth::BottomID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, BottomLeftID) == 0x000040, "Member 'FKuroCSParticle_cloth::BottomLeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, BottomRightID) == 0x000044, "Member 'FKuroCSParticle_cloth::BottomRightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, TopLeftID) == 0x000048, "Member 'FKuroCSParticle_cloth::TopLeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, TopRightID) == 0x00004C, "Member 'FKuroCSParticle_cloth::TopRightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, BottomRightRightID) == 0x000050, "Member 'FKuroCSParticle_cloth::BottomRightRightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, TopLeftLeftID) == 0x000054, "Member 'FKuroCSParticle_cloth::TopLeftLeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, isPinned) == 0x000058, "Member 'FKuroCSParticle_cloth::isPinned' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_cloth, pos_beforeStage) == 0x000060, "Member 'FKuroCSParticle_cloth::pos_beforeStage' has a wrong offset!");

// ScriptStruct KuroComputeShader.KuroCSParticle_Cloth_DynamicPin
// 0x0070 (0x0070 - 0x0000)
struct FKuroCSParticle_Cloth_DynamicPin final
{
public:
	struct FVector                                pos;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LeftID;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                posFoe;                                            // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RightID;                                           // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                pos_bind;                                          // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopID;                                             // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                vol;                                               // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomID;                                          // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomLeftID;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomRightID;                                     // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopLeftID;                                         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopRightID;                                        // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomRightRightID;                                // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopLeftLeftID;                                     // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         isPinned;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         indexX;                                            // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         indexY;                                            // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroCSParticle_Cloth_DynamicPin) == 0x000004, "Wrong alignment on FKuroCSParticle_Cloth_DynamicPin");
static_assert(sizeof(FKuroCSParticle_Cloth_DynamicPin) == 0x000070, "Wrong size on FKuroCSParticle_Cloth_DynamicPin");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, pos) == 0x000000, "Member 'FKuroCSParticle_Cloth_DynamicPin::pos' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, LeftID) == 0x00000C, "Member 'FKuroCSParticle_Cloth_DynamicPin::LeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, posFoe) == 0x000010, "Member 'FKuroCSParticle_Cloth_DynamicPin::posFoe' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, RightID) == 0x00001C, "Member 'FKuroCSParticle_Cloth_DynamicPin::RightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, pos_bind) == 0x000020, "Member 'FKuroCSParticle_Cloth_DynamicPin::pos_bind' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, TopID) == 0x00002C, "Member 'FKuroCSParticle_Cloth_DynamicPin::TopID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, vol) == 0x000030, "Member 'FKuroCSParticle_Cloth_DynamicPin::vol' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, BottomID) == 0x00003C, "Member 'FKuroCSParticle_Cloth_DynamicPin::BottomID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, BottomLeftID) == 0x000040, "Member 'FKuroCSParticle_Cloth_DynamicPin::BottomLeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, BottomRightID) == 0x000044, "Member 'FKuroCSParticle_Cloth_DynamicPin::BottomRightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, TopLeftID) == 0x000048, "Member 'FKuroCSParticle_Cloth_DynamicPin::TopLeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, TopRightID) == 0x00004C, "Member 'FKuroCSParticle_Cloth_DynamicPin::TopRightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, BottomRightRightID) == 0x000050, "Member 'FKuroCSParticle_Cloth_DynamicPin::BottomRightRightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, TopLeftLeftID) == 0x000054, "Member 'FKuroCSParticle_Cloth_DynamicPin::TopLeftLeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, isPinned) == 0x000058, "Member 'FKuroCSParticle_Cloth_DynamicPin::isPinned' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, indexX) == 0x00005C, "Member 'FKuroCSParticle_Cloth_DynamicPin::indexX' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_DynamicPin, indexY) == 0x000060, "Member 'FKuroCSParticle_Cloth_DynamicPin::indexY' has a wrong offset!");

// ScriptStruct KuroComputeShader.KuroCSParticle_Cloth_Path
// 0x0090 (0x0090 - 0x0000)
struct FKuroCSParticle_Cloth_Path final
{
public:
	struct FVector                                pos;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                pos_bind;                                          // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                normal_bind;                                       // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                pos_beforeStage;                                   // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                vol;                                               // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         pinWeight;                                         // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LeftID;                                            // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RightID;                                           // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopID;                                             // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomID;                                          // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomLeftID;                                      // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomRightID;                                     // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopLeftID;                                         // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopRightID;                                        // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis_left;                                          // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis_right;                                         // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis_top;                                           // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis_bottom;                                        // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis_bottomLeft;                                    // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis_bottomRight;                                   // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis_topLeft;                                       // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis_topRight;                                      // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FKuroCSParticle_Cloth_Path) == 0x000004, "Wrong alignment on FKuroCSParticle_Cloth_Path");
static_assert(sizeof(FKuroCSParticle_Cloth_Path) == 0x000090, "Wrong size on FKuroCSParticle_Cloth_Path");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, pos) == 0x000000, "Member 'FKuroCSParticle_Cloth_Path::pos' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, pos_bind) == 0x000010, "Member 'FKuroCSParticle_Cloth_Path::pos_bind' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, normal_bind) == 0x000020, "Member 'FKuroCSParticle_Cloth_Path::normal_bind' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, pos_beforeStage) == 0x000030, "Member 'FKuroCSParticle_Cloth_Path::pos_beforeStage' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, vol) == 0x000040, "Member 'FKuroCSParticle_Cloth_Path::vol' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, pinWeight) == 0x00004C, "Member 'FKuroCSParticle_Cloth_Path::pinWeight' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, LeftID) == 0x000050, "Member 'FKuroCSParticle_Cloth_Path::LeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, RightID) == 0x000054, "Member 'FKuroCSParticle_Cloth_Path::RightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, TopID) == 0x000058, "Member 'FKuroCSParticle_Cloth_Path::TopID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, BottomID) == 0x00005C, "Member 'FKuroCSParticle_Cloth_Path::BottomID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, BottomLeftID) == 0x000060, "Member 'FKuroCSParticle_Cloth_Path::BottomLeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, BottomRightID) == 0x000064, "Member 'FKuroCSParticle_Cloth_Path::BottomRightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, TopLeftID) == 0x000068, "Member 'FKuroCSParticle_Cloth_Path::TopLeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, TopRightID) == 0x00006C, "Member 'FKuroCSParticle_Cloth_Path::TopRightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, dis_left) == 0x000070, "Member 'FKuroCSParticle_Cloth_Path::dis_left' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, dis_right) == 0x000074, "Member 'FKuroCSParticle_Cloth_Path::dis_right' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, dis_top) == 0x000078, "Member 'FKuroCSParticle_Cloth_Path::dis_top' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, dis_bottom) == 0x00007C, "Member 'FKuroCSParticle_Cloth_Path::dis_bottom' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, dis_bottomLeft) == 0x000080, "Member 'FKuroCSParticle_Cloth_Path::dis_bottomLeft' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, dis_bottomRight) == 0x000084, "Member 'FKuroCSParticle_Cloth_Path::dis_bottomRight' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, dis_topLeft) == 0x000088, "Member 'FKuroCSParticle_Cloth_Path::dis_topLeft' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_Cloth_Path, dis_topRight) == 0x00008C, "Member 'FKuroCSParticle_Cloth_Path::dis_topRight' has a wrong offset!");

// ScriptStruct KuroComputeShader.KuroCSParticle_doubleChain
// 0x0070 (0x0070 - 0x0000)
struct FKuroCSParticle_doubleChain final
{
public:
	struct FVector                                pos;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LeftID;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                posFoe;                                            // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RightID;                                           // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                pos_bind;                                          // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopID;                                             // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                vol;                                               // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomID;                                          // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomLeftID;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomRightID;                                     // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopLeftID;                                         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopRightID;                                        // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BottomRightRightID;                                // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TopLeftLeftID;                                     // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         isPinned;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                pos_beforeStage;                                   // 0x0060(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroCSParticle_doubleChain) == 0x000004, "Wrong alignment on FKuroCSParticle_doubleChain");
static_assert(sizeof(FKuroCSParticle_doubleChain) == 0x000070, "Wrong size on FKuroCSParticle_doubleChain");
static_assert(offsetof(FKuroCSParticle_doubleChain, pos) == 0x000000, "Member 'FKuroCSParticle_doubleChain::pos' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, LeftID) == 0x00000C, "Member 'FKuroCSParticle_doubleChain::LeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, posFoe) == 0x000010, "Member 'FKuroCSParticle_doubleChain::posFoe' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, RightID) == 0x00001C, "Member 'FKuroCSParticle_doubleChain::RightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, pos_bind) == 0x000020, "Member 'FKuroCSParticle_doubleChain::pos_bind' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, TopID) == 0x00002C, "Member 'FKuroCSParticle_doubleChain::TopID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, vol) == 0x000030, "Member 'FKuroCSParticle_doubleChain::vol' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, BottomID) == 0x00003C, "Member 'FKuroCSParticle_doubleChain::BottomID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, BottomLeftID) == 0x000040, "Member 'FKuroCSParticle_doubleChain::BottomLeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, BottomRightID) == 0x000044, "Member 'FKuroCSParticle_doubleChain::BottomRightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, TopLeftID) == 0x000048, "Member 'FKuroCSParticle_doubleChain::TopLeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, TopRightID) == 0x00004C, "Member 'FKuroCSParticle_doubleChain::TopRightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, BottomRightRightID) == 0x000050, "Member 'FKuroCSParticle_doubleChain::BottomRightRightID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, TopLeftLeftID) == 0x000054, "Member 'FKuroCSParticle_doubleChain::TopLeftLeftID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, isPinned) == 0x000058, "Member 'FKuroCSParticle_doubleChain::isPinned' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_doubleChain, pos_beforeStage) == 0x000060, "Member 'FKuroCSParticle_doubleChain::pos_beforeStage' has a wrong offset!");

// ScriptStruct KuroComputeShader.KuroCSParticle_genericCloth
// 0x00C0 (0x00C0 - 0x0000)
struct FKuroCSParticle_genericCloth final
{
public:
	struct FVector                                pos;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         neighbour1;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         neighbour2;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         neighbour3;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         neighbour4;                                        // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                pos_bind;                                          // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         neighbour5;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                pos_foe;                                           // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         neighbour6;                                        // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis1;                                              // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis2;                                              // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis3;                                              // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis4;                                              // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis5;                                              // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis6;                                              // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         neighbour7;                                        // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         neighbour8;                                        // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                vol;                                               // 0x0060(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis7;                                              // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                pos_before_rotate;                                 // 0x0070(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         dis8;                                              // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                myNormal;                                          // 0x0080(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         isPinned;                                          // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bend1;                                             // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bend2;                                             // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bend3;                                             // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bend4;                                             // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bend5;                                             // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bend6;                                             // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bend7;                                             // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bend8;                                             // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                pos_beforeStage;                                   // 0x00B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroCSParticle_genericCloth) == 0x000004, "Wrong alignment on FKuroCSParticle_genericCloth");
static_assert(sizeof(FKuroCSParticle_genericCloth) == 0x0000C0, "Wrong size on FKuroCSParticle_genericCloth");
static_assert(offsetof(FKuroCSParticle_genericCloth, pos) == 0x000000, "Member 'FKuroCSParticle_genericCloth::pos' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, index) == 0x00000C, "Member 'FKuroCSParticle_genericCloth::index' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, neighbour1) == 0x000010, "Member 'FKuroCSParticle_genericCloth::neighbour1' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, neighbour2) == 0x000014, "Member 'FKuroCSParticle_genericCloth::neighbour2' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, neighbour3) == 0x000018, "Member 'FKuroCSParticle_genericCloth::neighbour3' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, neighbour4) == 0x00001C, "Member 'FKuroCSParticle_genericCloth::neighbour4' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, pos_bind) == 0x000020, "Member 'FKuroCSParticle_genericCloth::pos_bind' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, neighbour5) == 0x00002C, "Member 'FKuroCSParticle_genericCloth::neighbour5' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, pos_foe) == 0x000030, "Member 'FKuroCSParticle_genericCloth::pos_foe' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, neighbour6) == 0x00003C, "Member 'FKuroCSParticle_genericCloth::neighbour6' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, dis1) == 0x000040, "Member 'FKuroCSParticle_genericCloth::dis1' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, dis2) == 0x000044, "Member 'FKuroCSParticle_genericCloth::dis2' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, dis3) == 0x000048, "Member 'FKuroCSParticle_genericCloth::dis3' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, dis4) == 0x00004C, "Member 'FKuroCSParticle_genericCloth::dis4' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, dis5) == 0x000050, "Member 'FKuroCSParticle_genericCloth::dis5' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, dis6) == 0x000054, "Member 'FKuroCSParticle_genericCloth::dis6' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, neighbour7) == 0x000058, "Member 'FKuroCSParticle_genericCloth::neighbour7' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, neighbour8) == 0x00005C, "Member 'FKuroCSParticle_genericCloth::neighbour8' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, vol) == 0x000060, "Member 'FKuroCSParticle_genericCloth::vol' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, dis7) == 0x00006C, "Member 'FKuroCSParticle_genericCloth::dis7' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, pos_before_rotate) == 0x000070, "Member 'FKuroCSParticle_genericCloth::pos_before_rotate' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, dis8) == 0x00007C, "Member 'FKuroCSParticle_genericCloth::dis8' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, myNormal) == 0x000080, "Member 'FKuroCSParticle_genericCloth::myNormal' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, isPinned) == 0x00008C, "Member 'FKuroCSParticle_genericCloth::isPinned' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, bend1) == 0x000090, "Member 'FKuroCSParticle_genericCloth::bend1' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, bend2) == 0x000094, "Member 'FKuroCSParticle_genericCloth::bend2' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, bend3) == 0x000098, "Member 'FKuroCSParticle_genericCloth::bend3' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, bend4) == 0x00009C, "Member 'FKuroCSParticle_genericCloth::bend4' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, bend5) == 0x0000A0, "Member 'FKuroCSParticle_genericCloth::bend5' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, bend6) == 0x0000A4, "Member 'FKuroCSParticle_genericCloth::bend6' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, bend7) == 0x0000A8, "Member 'FKuroCSParticle_genericCloth::bend7' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, bend8) == 0x0000AC, "Member 'FKuroCSParticle_genericCloth::bend8' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_genericCloth, pos_beforeStage) == 0x0000B0, "Member 'FKuroCSParticle_genericCloth::pos_beforeStage' has a wrong offset!");

// ScriptStruct KuroComputeShader.KuroCSParticle_liuShu
// 0x0050 (0x0050 - 0x0000)
struct FKuroCSParticle_liuShu final
{
public:
	struct FVector                                pos;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IDA;                                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                posFoe;                                            // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IDB;                                               // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                pos_bind;                                          // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         percent;                                           // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                vol;                                               // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         hardPoint;                                         // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                col;                                               // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroCSParticle_liuShu) == 0x000004, "Wrong alignment on FKuroCSParticle_liuShu");
static_assert(sizeof(FKuroCSParticle_liuShu) == 0x000050, "Wrong size on FKuroCSParticle_liuShu");
static_assert(offsetof(FKuroCSParticle_liuShu, pos) == 0x000000, "Member 'FKuroCSParticle_liuShu::pos' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_liuShu, IDA) == 0x00000C, "Member 'FKuroCSParticle_liuShu::IDA' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_liuShu, posFoe) == 0x000010, "Member 'FKuroCSParticle_liuShu::posFoe' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_liuShu, IDB) == 0x00001C, "Member 'FKuroCSParticle_liuShu::IDB' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_liuShu, pos_bind) == 0x000020, "Member 'FKuroCSParticle_liuShu::pos_bind' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_liuShu, percent) == 0x00002C, "Member 'FKuroCSParticle_liuShu::percent' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_liuShu, vol) == 0x000030, "Member 'FKuroCSParticle_liuShu::vol' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_liuShu, hardPoint) == 0x00003C, "Member 'FKuroCSParticle_liuShu::hardPoint' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_liuShu, col) == 0x000040, "Member 'FKuroCSParticle_liuShu::col' has a wrong offset!");

// ScriptStruct KuroComputeShader.KuroCSParticle_PlantAnim
// 0x0050 (0x0050 - 0x0000)
struct FKuroCSParticle_PlantAnim final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParentID;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Pos_Anim;                                          // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PPID;                                              // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Pos_BeforeStage;                                   // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Dir_Bind;                                          // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKuroCSParticle_PlantAnim) == 0x000004, "Wrong alignment on FKuroCSParticle_PlantAnim");
static_assert(sizeof(FKuroCSParticle_PlantAnim) == 0x000050, "Wrong size on FKuroCSParticle_PlantAnim");
static_assert(offsetof(FKuroCSParticle_PlantAnim, Pos) == 0x000000, "Member 'FKuroCSParticle_PlantAnim::Pos' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_PlantAnim, ParentID) == 0x00000C, "Member 'FKuroCSParticle_PlantAnim::ParentID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_PlantAnim, Pos_Anim) == 0x000010, "Member 'FKuroCSParticle_PlantAnim::Pos_Anim' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_PlantAnim, PPID) == 0x00001C, "Member 'FKuroCSParticle_PlantAnim::PPID' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_PlantAnim, Normal) == 0x000020, "Member 'FKuroCSParticle_PlantAnim::Normal' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_PlantAnim, Pos_BeforeStage) == 0x000030, "Member 'FKuroCSParticle_PlantAnim::Pos_BeforeStage' has a wrong offset!");
static_assert(offsetof(FKuroCSParticle_PlantAnim, Dir_Bind) == 0x000040, "Member 'FKuroCSParticle_PlantAnim::Dir_Bind' has a wrong offset!");

// ScriptStruct KuroComputeShader.KuroCSParticle_rpbd
// 0x0090 (0x0090 - 0x0000)
struct FKuroCSParticle_rpbd final
{
public:
	struct FVector                                pos;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         index;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         neighbour1;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         neighbour2;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         neighbour3;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         neighbour4;                                        // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
