#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroRenderingRuntimeBPPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "KuroGameBudget_classes.hpp"
#include "KuroMath_structs.hpp"
#include "ProceduralMeshComponent_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KuroPointCloud_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "KuroGamePartition_structs.hpp"
#include "KuroCurve_structs.hpp"
#include "Renderer_structs.hpp"
#include "LevelSequence_classes.hpp"
#include "MovieScene_classes.hpp"
#include "Niagara_classes.hpp"


namespace SDK
{

// Class KuroRenderingRuntimeBPPlugin.KuroBPActor
// 0x0000 (0x03B8 - 0x03B8)
class AKuroBPActor : public AKuroGameBudgetBlueprintActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBPActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBPActor")
	}
	static class AKuroBPActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroBPActor>();
	}
};
DUMPER7_ASSERTS_AKuroBPActor;

// Class KuroRenderingRuntimeBPPlugin.FSRayCastingActor
// 0x0000 (0x03B8 - 0x03B8)
class AFSRayCastingActor : public AKuroBPActor
{
public:
	static void P_FS_CheckFrontObstacle2_Shuffled(const class USceneComponent* PlaneComponent, const float RayCastingDetectDis, const class UObject* WorldContextObject, const ETraceTypeQuery TraceChannel, float* OutDistance, TArray<struct FVector>& Dir, TArray<struct FVector>& EndPos, TArray<float>& Dis, TArray<class FName>& ParamNames, class UMaterialInstanceDynamic* MID, const bool debugLine, const int32 CountIndex, const int32 BatchSize, const int32 ParticleCount, int32* OutNewCountIndex, const TArray<class AActor*>& ActorsToIgnore, TArray<int32>& ShuffleOrder, struct FRandomStream& Rng, const bool bReshuffleWhenWrap);
	static struct FRotator P_FS_ComputeTilt_ByHeightH2(struct FVectorDouble* LastFrameNormal, class USceneComponent* PlaneComponent, float RayCastingDetectRange, double MaxDegreeAngle, float MinActiveRadius, float MaxActiveRadius, double FollowSpeedRate, double ReturnSpeedRate, bool bPlayerColliding, bool bNeedReturnOrNot, bool bLinear);
	static double P_FS_PointToIndex_Local_Double(const class USceneComponent* PlaneComponent, int32 N);

	void P_FS_CheckFrontObstacle2(const class USceneComponent* PlaneComponent, const float RayCastingDetectDis, const class UObject* WorldContextObject, const ETraceTypeQuery TraceChannel, float* OutDistance, TArray<struct FVector>& Dir, TArray<struct FVector>& EndPos, TArray<float>& Dis, TArray<class FName>& ParamNames, class UMaterialInstanceDynamic* MID, const bool debugLine, const int32 CountIndex, const int32 BatchSize, const int32 ParticleCount, int32* OutNewCountIndex, const TArray<class AActor*>& ActorsToIgnore);
	bool P_FS_DetectPlayer_Two(const class USceneComponent* PlaneComponent, const double Index_0, const int32 ParticleCount, const TArray<float>& Dis, const TArray<struct FVector>& Dirs, float* OutDistance);
	bool P_FS_IsPointInTriangle_ZProjection(const struct FVector& P, const struct FVector& A, const struct FVector& B, const struct FVector& C, float* OutDistance, float Epsilon);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FSRayCastingActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FSRayCastingActor")
	}
	static class AFSRayCastingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFSRayCastingActor>();
	}
};
DUMPER7_ASSERTS_AFSRayCastingActor;

// Class KuroRenderingRuntimeBPPlugin.HexagonConsumer
// 0x0080 (0x0438 - 0x03B8)
class AHexagonConsumer final : public AFSRayCastingActor
{
public:
	class USceneComponent*                        Root;                                              // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Center;                                            // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ActorCenterWorld;                                  // 0x03E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NewPointWorld;                                     // 0x03EC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RayCount;                                          // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 RayLengths;                                        // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         MaxDis;                                            // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         renderOrder;                                       // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDistanceBasedRenderOrder;                      // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_419[0x3];                                      // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           MaxColor;                                          // 0x041C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42C[0xC];                                      // 0x042C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void afterBeginPlay();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HexagonConsumer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HexagonConsumer")
	}
	static class AHexagonConsumer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHexagonConsumer>();
	}
};
DUMPER7_ASSERTS_AHexagonConsumer;

// Class KuroRenderingRuntimeBPPlugin.KuroPPLensflareData
// 0x0030 (0x0068 - 0x0038)
class UKuroPPLensflareData final : public UPrimaryDataAsset
{
public:
	class FName                                   ConfigName;                                        // 0x0038(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroLensflareSettings                 Settings;                                          // 0x0048(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPPLensflareData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPPLensflareData")
	}
	static class UKuroPPLensflareData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroPPLensflareData>();
	}
};
DUMPER7_ASSERTS_UKuroPPLensflareData;

// Class KuroRenderingRuntimeBPPlugin.KuroEditorTickActorSubsystem
// 0x0028 (0x0060 - 0x0038)
class UKuroEditorTickActorSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x28];                                      // 0x0038(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroEditorTickActorSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroEditorTickActorSubsystem")
	}
	static class UKuroEditorTickActorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroEditorTickActorSubsystem>();
	}
};
DUMPER7_ASSERTS_UKuroEditorTickActorSubsystem;

// Class KuroRenderingRuntimeBPPlugin.KuroScreenFilterSystemData
// 0x0028 (0x0060 - 0x0038)
class UKuroScreenFilterSystemData final : public UDataAsset
{
public:
	TArray<class UKuroScreenFilterDataAsset*>     ScreenFilterSystemDatas;                           // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         SharpenRadius;                                     // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SharpenAmount;                                     // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LaplacianAmount;                                   // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SharpenIntensity;                                  // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ToonSharpenIntensity;                              // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SharpenDistance;                                   // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroScreenFilterSystemData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroScreenFilterSystemData")
	}
	static class UKuroScreenFilterSystemData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroScreenFilterSystemData>();
	}
};
DUMPER7_ASSERTS_UKuroScreenFilterSystemData;

// Class KuroRenderingRuntimeBPPlugin.InteractiveLeaves
// 0x01E0 (0x0490 - 0x02B0)
class alignas(0x10) AInteractiveLeaves final : public AActor
{
public:
	class UInstancedStaticMeshComponent*          IsmComponent;                                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   StaticComponent;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInteractiveLeavesConfigData*           Config;                                            // 0x02C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x1C8];                                    // 0x02C8(0x01C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractiveLeaves")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractiveLeaves")
	}
	static class AInteractiveLeaves* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteractiveLeaves>();
	}
};
DUMPER7_ASSERTS_AInteractiveLeaves;

// Class KuroRenderingRuntimeBPPlugin.InteractiveLeavesConfigData
// 0x0128 (0x0160 - 0x0038)
class UInteractiveLeavesConfigData final : public UPrimaryDataAsset
{
public:
	class UKuroPointCloudCache*                   PointCache;                                        // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroPointCloudCache*                   PointCacheMobile;                                  // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            InstanceMesh;                                      // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     InstanceMaterial;                                  // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            WholeMesh;                                         // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            WholeMeshMobile;                                   // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     WholeMaterial;                                     // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerRadius;                                      // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReviveRadius;                                      // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LifeTime;                                          // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialAgeRandom;                                  // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisappearTime;                                     // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReviveTime;                                        // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Drag;                                              // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerForceSize;                                   // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerForceExp;                                    // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitVelocitySizeMin;                               // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitVelocitySizeMax;                               // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitFloatVelocitySizeMin;                          // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitFloatVelocitySizeMax;                          // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ConstForce;                                        // 0x00A4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKuroPointKdTree                       SpatialTree;                                       // 0x00B0(0x0058)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FKuroPointKdTree                       SpatialTreeMobile;                                 // 0x0108(0x0058)(Edit, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractiveLeavesConfigData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractiveLeavesConfigData")
	}
	static class UInteractiveLeavesConfigData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractiveLeavesConfigData>();
	}
};
DUMPER7_ASSERTS_UInteractiveLeavesConfigData;

// Class KuroRenderingRuntimeBPPlugin.KuroFloatLightActor
// 0x0068 (0x0420 - 0x03B8)
class AKuroFloatLightActor final : public AKuroGameBudgetBlueprintActor
{
public:
	class UKuroFloatLightPreset*                  Preset;                                            // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseIntensityScale;                                // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntensityCurveScale;                               // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlickSpeedScale;                                   // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyToonLight;                                   // 0x03CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ToonLightBaseIntensityScale;                       // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ToonLightIntensityCurveScale;                      // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyToonHardLight;                               // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ToonHardLightBaseIntensityScale;                   // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ToonHardLightIntensityCurveScale;                  // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementSpeedScale;                                // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementPhase;                                     // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementScalar1;                                   // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementScalar2;                                   // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneRoot;                                         // 0x03F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPointLightComponent*                   PointLightComponent;                               // 0x0400(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_408[0xC];                                      // 0x0408(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentBaseIntensity;                              // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentIntensityCurve;                             // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFloatLightActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFloatLightActor")
	}
	static class AKuroFloatLightActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroFloatLightActor>();
	}
};
DUMPER7_ASSERTS_AKuroFloatLightActor;

// Class KuroRenderingRuntimeBPPlugin.InteractiveWaterLeaves
// 0x0010 (0x02C0 - 0x02B0)
class AInteractiveWaterLeaves final : public AActor
{
public:
	class UInteractiveWaterLeavesConfig*          WaterLeavesConfig;                                 // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractiveWaterLeaves")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractiveWaterLeaves")
	}
	static class AInteractiveWaterLeaves* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteractiveWaterLeaves>();
	}
};
DUMPER7_ASSERTS_AInteractiveWaterLeaves;

// Class KuroRenderingRuntimeBPPlugin.KuroScreenFilterDataAsset
// 0x0030 (0x0068 - 0x0038)
class UKuroScreenFilterDataAsset final : public UDataAsset
{
public:
	class UKuroScreenFilterParameter*             ParameterA;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroScreenFilterParameter*             ParameterB;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroScreenFilterParameter*             ParameterC;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroScreenFilterParameter*             ParameterD;                                        // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               ScreenLeakColorGradingLUT;                         // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ColorGradingLUTIntensity;                          // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroScreenFilterDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroScreenFilterDataAsset")
	}
	static class UKuroScreenFilterDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroScreenFilterDataAsset>();
	}
};
DUMPER7_ASSERTS_UKuroScreenFilterDataAsset;

// Class KuroRenderingRuntimeBPPlugin.InteractiveWaterLeavesConfig
// 0x0040 (0x0078 - 0x0038)
class UInteractiveWaterLeavesConfig final : public UPrimaryDataAsset
{
public:
	class UKuroPointCloudCache*                   PointCache;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     LeaveMaterial;                                     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         LeavesNS;                                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeaveScale;                                        // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaveForce;                                         // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoleForce;                                         // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragForce;                                         // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoleRadiusMin;                                     // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoleRadiusMax;                                     // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RefreshRadius;                                     // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SankTime;                                          // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RefreshTime;                                       // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractiveWaterLeavesConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractiveWaterLeavesConfig")
	}
	static class UInteractiveWaterLeavesConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractiveWaterLeavesConfig>();
	}
};
DUMPER7_ASSERTS_UInteractiveWaterLeavesConfig;

// Class KuroRenderingRuntimeBPPlugin.KuroActorCullingLocalVolume
// 0x0018 (0x0300 - 0x02E8)
class AKuroActorCullingLocalVolume final : public AVolume
{
public:
	uint8                                         Pad_2E8[0x18];                                     // 0x02E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroActorCullingLocalVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroActorCullingLocalVolume")
	}
	static class AKuroActorCullingLocalVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroActorCullingLocalVolume>();
	}
};
DUMPER7_ASSERTS_AKuroActorCullingLocalVolume;

// Class KuroRenderingRuntimeBPPlugin.KuroSceneTransitionComponent
// 0x0030 (0x0250 - 0x0220)
class UKuroSceneTransitionComponent final : public USceneComponent
{
public:
	TArray<int32>                                 TransitionIds;                                     // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   TransitionCollection;                              // 0x0228(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroSceneTransitionState                     State;                                             // 0x0234(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_235[0x1B];                                     // 0x0235(0x001B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSceneTransitionEnd();
	void OnSceneTransitionRegistered();
	void OnSceneTransitionStart();
	void ReregisterSceneTransitionComponent();
	void TickSceneTransition(float DeltaTime, float TransitionAge, float TransitionNormalizedProgress);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroSceneTransitionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroSceneTransitionComponent")
	}
	static class UKuroSceneTransitionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroSceneTransitionComponent>();
	}
};
DUMPER7_ASSERTS_UKuroSceneTransitionComponent;

// Class KuroRenderingRuntimeBPPlugin.KuroAnimNotify
// 0x0008 (0x0048 - 0x0040)
class UKuroAnimNotify : public UAnimNotify
{
public:
	int32                                         exportIndex;                                       // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool K2_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);
	bool K2_PostChangeProperty(const class FName PropertyName);
	bool K2_ValidateAssets();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroAnimNotify")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroAnimNotify")
	}
	static class UKuroAnimNotify* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAnimNotify>();
	}
};
DUMPER7_ASSERTS_UKuroAnimNotify;

// Class KuroRenderingRuntimeBPPlugin.KuroAnimNotifyState
// 0x0008 (0x0048 - 0x0040)
class UKuroAnimNotifyState : public UAnimNotifyState
{
public:
	int32                                         exportIndex;                                       // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool K2_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration);
	bool K2_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);
	bool K2_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime);
	bool K2_PostChangeProperty(const class FName PropertyName);
	bool K2_ValidateAssets();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroAnimNotifyState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroAnimNotifyState")
	}
	static class UKuroAnimNotifyState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAnimNotifyState>();
	}
};
DUMPER7_ASSERTS_UKuroAnimNotifyState;

// Class KuroRenderingRuntimeBPPlugin.KuroSceneInteractionMatConDataCache
// 0x1418 (0x1450 - 0x0038)
class UKuroSceneInteractionMatConDataCache final : public UPrimaryDataAsset
{
public:
	int32                                         Version;                                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKuroInterpolateRangeTime_SI           RangeTime;                                         // 0x003C(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseRim;                                           // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseBaseColor;                                     // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAddEmission;                                   // 0x004A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseEmissionChange;                                // 0x004B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDissolve;                                      // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustom;                                        // 0x004D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroMaterialControllerParam_SI_Rim    RimParam;                                          // 0x0050(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroMaterialControllerParam_SI_BaseColor BaseColorParam;                                 // 0x0300(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroMaterialControllerParam_SI_AddEmission AddEmissionParam;                             // 0x05B0(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroMaterialControllerParam_SI_EmissionChange EmissionChangeParam;                       // 0x07D0(0x0340)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroMaterialControllerParam_SI_Dissolve DissolveParam;                                   // 0x0B10(0x08A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKuroMaterialControllerParam_SI_Custom CustomParam;                                       // 0x13B0(0x00A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroSceneInteractionMatConDataCache")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroSceneInteractionMatConDataCache")
	}
	static class UKuroSceneInteractionMatConDataCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroSceneInteractionMatConDataCache>();
	}
};
DUMPER7_ASSERTS_UKuroSceneInteractionMatConDataCache;

// Class KuroRenderingRuntimeBPPlugin.KuroANSCurveTrailDecal
// 0x0058 (0x00A0 - 0x0048)
class UKuroANSCurveTrailDecal final : public UKuroAnimNotifyState
{
public:
	class FName                                   AttachSocketName;                                  // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             AttachTransform;                                   // 0x0060(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UKuroCurveTrailDecalConfig*             Config;                                            // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroANSCurveTrailDecal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroANSCurveTrailDecal")
	}
	static class UKuroANSCurveTrailDecal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroANSCurveTrailDecal>();
	}
};
DUMPER7_ASSERTS_UKuroANSCurveTrailDecal;

// Class KuroRenderingRuntimeBPPlugin.KuroBezierMeshComponent
// 0x00B0 (0x0680 - 0x05D0)
class UKuroBezierMeshComponent final : public UProceduralMeshComponent
{
public:
	uint8                                         Pad_5C8[0xB8];                                     // 0x05C8(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddLayer(float alpha);
	void ClearData();
	void Dissipate(float SubLayersNum);
	int32 GetLayerNum();
	int32 GetMeshHeight();
	TArray<struct FVector> GetMeshPoints();
	TArray<int32> GetMeshTriangles();
	int32 GetMeshWidth();
	TArray<struct FVector> GetPointsArray();
	void SetKeyPoint(int32 Index_0, float X, float Y, float Z);
	void Setup(int32 Width, float InUnitLength);
	void UpdateMesh(int32 Section);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBezierMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBezierMeshComponent")
	}
	static class UKuroBezierMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroBezierMeshComponent>();
	}
};
DUMPER7_ASSERTS_UKuroBezierMeshComponent;

// Class KuroRenderingRuntimeBPPlugin.KuroSceneRainEmitterConfig
// 0x0058 (0x0090 - 0x0038)
class UKuroSceneRainEmitterConfig final : public UPrimaryDataAsset
{
public:
	TArray<struct FKuroRainActorSpawnProperties>  SpawnProperties;                                   // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                CycleBoxExtent;                                    // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragSize;                                          // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Gravity;                                           // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WindSize;                                          // 0x005C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVectorFieldStatic*                     VectorField;                                       // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VectorFieldPosScale;                               // 0x0070(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VectorFieldMoveSpeed;                              // 0x007C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VectorFieldForceSize;                              // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CenterBiasByWind;                                  // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroSceneRainEmitterConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroSceneRainEmitterConfig")
	}
	static class UKuroSceneRainEmitterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroSceneRainEmitterConfig>();
	}
};
DUMPER7_ASSERTS_UKuroSceneRainEmitterConfig;

// Class KuroRenderingRuntimeBPPlugin.KuroBillboardComponent
// 0x0010 (0x00D0 - 0x00C0)
class UKuroBillboardComponent final : public UActorComponent
{
public:
	bool                                          IsUpdateEveryFrame;                                // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBillboardMode                                OrientAxis;                                        // 0x00C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFixSize;                                         // 0x00C2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScaleSize;                                         // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinSize;                                           // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Initialize();

	void Update() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBillboardComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBillboardComponent")
	}
	static class UKuroBillboardComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroBillboardComponent>();
	}
};
DUMPER7_ASSERTS_UKuroBillboardComponent;

// Class KuroRenderingRuntimeBPPlugin.KuroBookPavingActor
// 0x0018 (0x02C8 - 0x02B0)
class AKuroBookPavingActor final : public AActor
{
public:
	TArray<struct FBookPavingDataStruct>          DataList;                                          // 0x02B0(0x0010)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBookPavingActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBookPavingActor")
	}
	static class AKuroBookPavingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroBookPavingActor>();
	}
};
DUMPER7_ASSERTS_AKuroBookPavingActor;

// Class KuroRenderingRuntimeBPPlugin.SunLensFlareConfig
// 0x0030 (0x0068 - 0x0038)
class USunLensFlareConfig : public UPrimaryDataAsset
{
public:
	class UStaticMesh*                            StaticMeshGhost;                                   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MaterialGhost;                                     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMeshHalo;                                    // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MaterialHalo;                                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMeshGlare;                                   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MaterialGlare;                                     // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SunLensFlareConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SunLensFlareConfig")
	}
	static class USunLensFlareConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<USunLensFlareConfig>();
	}
};
DUMPER7_ASSERTS_USunLensFlareConfig;

// Class KuroRenderingRuntimeBPPlugin.UKuroCustomCookActor
// 0x0000 (0x03B8 - 0x03B8)
class AUKuroCustomCookActor : public AKuroGameBudgetBlueprintActor
{
public:
	void BeforeCookForMobile();
	void BeforeCookForPC();
	void BeforeSave();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UKuroCustomCookActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UKuroCustomCookActor")
	}
	static class AUKuroCustomCookActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUKuroCustomCookActor>();
	}
};
DUMPER7_ASSERTS_AUKuroCustomCookActor;

// Class KuroRenderingRuntimeBPPlugin.KuroBPCustomCookActor
// 0x0000 (0x03B8 - 0x03B8)
class AKuroBPCustomCookActor : public AUKuroCustomCookActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBPCustomCookActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBPCustomCookActor")
	}
	static class AKuroBPCustomCookActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroBPCustomCookActor>();
	}
};
DUMPER7_ASSERTS_AKuroBPCustomCookActor;

// Class KuroRenderingRuntimeBPPlugin.KuroVolumetricQualitySettings
// 0x0010 (0x0058 - 0x0048)
class UKuroVolumetricQualitySettings final : public UDeveloperSettings
{
public:
	TArray<class FString>                         VolumetricQuality;                                 // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroVolumetricQualitySettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroVolumetricQualitySettings")
	}
	static class UKuroVolumetricQualitySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroVolumetricQualitySettings>();
	}
};
DUMPER7_ASSERTS_UKuroVolumetricQualitySettings;

// Class KuroRenderingRuntimeBPPlugin.KuroEditorTickActor
// 0x0010 (0x03C8 - 0x03B8)
class AKuroEditorTickActor : public AKuroGameBudgetBlueprintActor
{
public:
	bool                                          bEditorTickBySelected;                             // 0x03B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetActorComponentTickEnabledByFocus;              // 0x03B9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3BA[0x2];                                      // 0x03BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         KuroEditorTickActorId;                             // 0x03BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSyncFolderPathToAttachChildren;                   // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EditorFocusIn();
	void EditorFocusOut();
	void EditorInit();
	void EditorTick(float DeltaSeconds);

	void EditorSetActorComponentsTickEnabled(bool bValue) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroEditorTickActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroEditorTickActor")
	}
	static class AKuroEditorTickActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroEditorTickActor>();
	}
};
DUMPER7_ASSERTS_AKuroEditorTickActor;

// Class KuroRenderingRuntimeBPPlugin.KuroBPEditorTickActor
// 0x0000 (0x03C8 - 0x03C8)
class AKuroBPEditorTickActor : public AKuroEditorTickActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBPEditorTickActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBPEditorTickActor")
	}
	static class AKuroBPEditorTickActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroBPEditorTickActor>();
	}
};
DUMPER7_ASSERTS_AKuroBPEditorTickActor;

// Class KuroRenderingRuntimeBPPlugin.KuroSceneInteractionInfo
// 0x0048 (0x0078 - 0x0030)
class UKuroSceneInteractionInfo final : public UObject
{
public:
	struct FVector                                Location;                                          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 LevelName;                                         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HandleId;                                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroSceneInteractionState                    CurrentState;                                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LoadingLevelComplete;                              // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AKuroSceneInteractionActor*             InteractionActor;                                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelStreamingDynamic*                 LevelStreaming;                                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLevelShown();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroSceneInteractionInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroSceneInteractionInfo")
	}
	static class UKuroSceneInteractionInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroSceneInteractionInfo>();
	}
};
DUMPER7_ASSERTS_UKuroSceneInteractionInfo;

// Class KuroRenderingRuntimeBPPlugin.KuroBPActorComponent
// 0x0000 (0x00C0 - 0x00C0)
class UKuroBPActorComponent : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroBPActorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroBPActorComponent")
	}
	static class UKuroBPActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroBPActorComponent>();
	}
};
DUMPER7_ASSERTS_UKuroBPActorComponent;

// Class KuroRenderingRuntimeBPPlugin.KuroDataDistortionProxyComponent
// 0x0010 (0x00D0 - 0x00C0)
class UKuroDataDistortionProxyComponent final : public UActorComponent
{
public:
	float                                         PhaseBias;                                         // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DurationScale;                                     // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroDataDistortionProxyComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroDataDistortionProxyComponent")
	}
	static class UKuroDataDistortionProxyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroDataDistortionProxyComponent>();
	}
};
DUMPER7_ASSERTS_UKuroDataDistortionProxyComponent;

// Class KuroRenderingRuntimeBPPlugin.KuroChangeMaterialsTextures
// 0x0030 (0x0068 - 0x0038)
class UKuroChangeMaterialsTextures final : public UPrimaryDataAsset
{
public:
	class FString                                 SkeletalMeshName;                                  // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UTexture2D>>      Textures;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroChangeMaterialsTextures")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroChangeMaterialsTextures")
	}
	static class UKuroChangeMaterialsTextures* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroChangeMaterialsTextures>();
	}
};
DUMPER7_ASSERTS_UKuroChangeMaterialsTextures;

// Class KuroRenderingRuntimeBPPlugin.KuroSplitTextureStreamerSettings
// 0x0030 (0x0068 - 0x0038)
class UKuroSplitTextureStreamerSettings final : public UPrimaryDataAsset
{
public:
	TArray<TSoftObjectPtr<class UTexture2D>>      SplitTextureReferences;                            // 0x0038(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
