#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroSimpleCombat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "KuroSimpleCombat_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class KuroSimpleCombat.InstanceCapsuleComponent
// 0x0020 (0x0550 - 0x0530)
class UInstanceCapsuleComponent final : public UPrimitiveComponent
{
public:
	float                                         CapsuleHalfHeight;                                 // 0x0528(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CapsuleRadius;                                     // 0x052C(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBodySetup*                             ShapeBodySetup;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_538[0x18];                                     // 0x0538(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 AddNewInstanceData(const struct FTransform& WorldSpaceInstanceTransform);
	void ClearAllInstanceBodies();
	void UpdateInstanceBodyTransform(int32 InstanceIndex, const struct FTransform& WorldSpaceInstanceTransform);
	void UpdateInstanceTransforms(const TArray<int32>& InstanceIndices, const TArray<struct FTransform>& InTransforms);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InstanceCapsuleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InstanceCapsuleComponent")
	}
	static class UInstanceCapsuleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstanceCapsuleComponent>();
	}
};
DUMPER7_ASSERTS_UInstanceCapsuleComponent;

// Class KuroSimpleCombat.KSC_BaseObject
// 0x0008 (0x0038 - 0x0030)
class UKSC_BaseObject : public UObject
{
public:
	class UKSC_World*                             KscWorld;                                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_BaseObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_BaseObject")
	}
	static class UKSC_BaseObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_BaseObject>();
	}
};
DUMPER7_ASSERTS_UKSC_BaseObject;

// Class KuroSimpleCombat.KSC_AttrSet
// 0x02A8 (0x02E0 - 0x0038)
class UKSC_AttrSet final : public UKSC_BaseObject
{
public:
	class UKSC_SkillComp*                         Owner_;                                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EKSC_AttrType, int32>                    Attrs_;                                            // 0x0040(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<class UObject*, int32>                   MoveReduceAttrs;                                   // 0x0090(0x0050)(Protected, NativeAccessSpecifierProtected)
	class UObject*                                CurMoveReduceObject;                               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x50];                                      // 0x00E8(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EKSC_AttrType, int32>                    AttrsLockLowerBound;                               // 0x0138(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<int32, struct FKSC_AttrBoundLocker>      LowerBoundLockerMap;                               // 0x0188(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D8[0x108];                                    // 0x01D8(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AssignAttrListen(EKSC_AttrType Id, const TDelegate<void(EKSC_AttrType AttrType, int32 Value)>& InDelegate);
	void RemoveAttrListen(EKSC_AttrType Id, const TDelegate<void(EKSC_AttrType AttrType, int32 Value)>& InDelegate);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_AttrSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_AttrSet")
	}
	static class UKSC_AttrSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_AttrSet>();
	}
};
DUMPER7_ASSERTS_UKSC_AttrSet;

// Class KuroSimpleCombat.KSC_BaseActor
// 0x0008 (0x02B8 - 0x02B0)
class AKSC_BaseActor : public AActor
{
public:
	class UKSC_World*                             KscWorld;                                          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_BaseActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_BaseActor")
	}
	static class AKSC_BaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKSC_BaseActor>();
	}
};
DUMPER7_ASSERTS_AKSC_BaseActor;

// Class KuroSimpleCombat.KSC_BossHeadUiHandle
// 0x0010 (0x0048 - 0x0038)
class UKSC_BossHeadUiHandle final : public UKSC_BaseObject
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_BossHeadUiHandle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_BossHeadUiHandle")
	}
	static class UKSC_BossHeadUiHandle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_BossHeadUiHandle>();
	}
};
DUMPER7_ASSERTS_UKSC_BossHeadUiHandle;

// Class KuroSimpleCombat.KSC_Buff
// 0x0028 (0x0060 - 0x0038)
class UKSC_Buff : public UKSC_BaseObject
{
public:
	class UKSC_SkillComp*                         Caster_;                                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKSC_SkillComp*                         Owner_;                                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKSC_DA_Buff*                           DaBuff_;                                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff")
	}
	static class UKSC_Buff* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff;

// Class KuroSimpleCombat.KSC_Buff_AddSkill
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_AddSkill final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_AddSkill*                  DaBuffAddSkill_;                                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_AddSkill")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_AddSkill")
	}
	static class UKSC_Buff_AddSkill* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_AddSkill>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_AddSkill;

// Class KuroSimpleCombat.KSC_Buff_AddTargetFaction
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_AddTargetFaction final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_AddTargetFaction*          DaBuffAddTarget_;                                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_AddTargetFaction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_AddTargetFaction")
	}
	static class UKSC_Buff_AddTargetFaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_AddTargetFaction>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_AddTargetFaction;

// Class KuroSimpleCombat.KSC_Buff_AttrLockLowerBound
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_AttrLockLowerBound final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_AttrLockLowerBound*        DaBuffAttrLockLowerBound_;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_AttrLockLowerBound")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_AttrLockLowerBound")
	}
	static class UKSC_Buff_AttrLockLowerBound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_AttrLockLowerBound>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_AttrLockLowerBound;

// Class KuroSimpleCombat.KSC_Buff_Aura
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_Aura final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Aura*                      DaBuffAura_;                                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_Aura")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_Aura")
	}
	static class UKSC_Buff_Aura* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Aura>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_Aura;

// Class KuroSimpleCombat.KSC_Buff_Stack
// 0x0080 (0x00E0 - 0x0060)
class UKSC_Buff_Stack : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Stack*                     DaBuffStack_;                                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x78];                                      // 0x0068(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_Stack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_Stack")
	}
	static class UKSC_Buff_Stack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Stack>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_Stack;

// Class KuroSimpleCombat.KSC_Buff_AuraWithStack
// 0x0018 (0x00F8 - 0x00E0)
class UKSC_Buff_AuraWithStack final : public UKSC_Buff_Stack
{
public:
	class UKSC_DA_Buff_AuraWithStack*             DaBuffAuraWithStack;                               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x10];                                      // 0x00E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_AuraWithStack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_AuraWithStack")
	}
	static class UKSC_Buff_AuraWithStack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_AuraWithStack>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_AuraWithStack;

// Class KuroSimpleCombat.KSC_Buff_ChainLightning
// 0x0058 (0x00B8 - 0x0060)
class UKSC_Buff_ChainLightning final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ChainLightning*            DaBuff_ChainLightning_;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x50];                                      // 0x0068(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_ChainLightning")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_ChainLightning")
	}
	static class UKSC_Buff_ChainLightning* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ChainLightning>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_ChainLightning;

// Class KuroSimpleCombat.KSC_Buff_Damage
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_Damage final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Damage*                    DaBuffDamage_;                                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_Damage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_Damage")
	}
	static class UKSC_Buff_Damage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Damage>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_Damage;

// Class KuroSimpleCombat.KSC_Buff_DamageAllEnemy
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_DamageAllEnemy final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_DamageAllEnemy*            DaBuffDamageAllEnemy_;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_DamageAllEnemy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_DamageAllEnemy")
	}
	static class UKSC_Buff_DamageAllEnemy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_DamageAllEnemy>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_DamageAllEnemy;

// Class KuroSimpleCombat.KSC_Buff_DiffTransferAddAttr
// 0x0080 (0x0160 - 0x00E0)
class UKSC_Buff_DiffTransferAddAttr final : public UKSC_Buff_Stack
{
public:
	uint8                                         Pad_E0[0x78];                                      // 0x00E0(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_DA_Buff_DiffTransferAddAttr*       TransferAddAttr;                                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAttrChange(EKSC_AttrType AttrType, int32 Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_DiffTransferAddAttr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_DiffTransferAddAttr")
	}
	static class UKSC_Buff_DiffTransferAddAttr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_DiffTransferAddAttr>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_DiffTransferAddAttr;

// Class KuroSimpleCombat.KSC_Buff_ImmuneBuff
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_ImmuneBuff final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ImmuneBuff*                DaBuffImmuneBuff_;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_ImmuneBuff")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_ImmuneBuff")
	}
	static class UKSC_Buff_ImmuneBuff* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ImmuneBuff>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_ImmuneBuff;

// Class KuroSimpleCombat.KSC_Buff_Invisible
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_Invisible final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Invisible*                 DaBuffInvisible_;                                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_Invisible")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_Invisible")
	}
	static class UKSC_Buff_Invisible* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Invisible>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_Invisible;

// Class KuroSimpleCombat.KSC_Buff_LandFireSpawner
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_LandFireSpawner final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_LandFireSpawner*           DaBuffLandFireSpawner_;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_LandFireSpawner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_LandFireSpawner")
	}
	static class UKSC_Buff_LandFireSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_LandFireSpawner>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_LandFireSpawner;

// Class KuroSimpleCombat.KSC_Buff_ListenEvent
// 0x0138 (0x0198 - 0x0060)
class UKSC_Buff_ListenEvent final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ListenEvent*               DaBuffListenEvent_;                                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EKSC_Buff_ListenEvent_ListenType              ListenEvent;                                       // 0x0068(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EKSC_Buff_ListenEvent_Response                ListenEvent_Response;                              // 0x0069(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Probability;                                       // 0x006C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ResponscCount;                                     // 0x0070(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKSC_TagFilter                         ResponseCheckTagFilter;                            // 0x0078(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FKSC_DamageTypeFilter                  DamageTypeFilter;                                  // 0x00A0(0x0030)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EKSC_Event_HitTarget                          CheckTarget;                                       // 0x00D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CheckBulletConfigId;                               // 0x00D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FKSC_TagFilter                         KillTargetTagFilter;                               // 0x00E0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ResponseTag;                                       // 0x0108(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ListenTag;                                         // 0x0128(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ListenTagCount;                                    // 0x0134(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ClearListenTag;                                    // 0x0138(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CheckTagOnBeginBuff;                               // 0x0139(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_DA_Buff*                           AddOrRemoveBuff;                                   // 0x0140(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UKSC_DA_Buff*>                   AddMultiBuff;                                      // 0x0148(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                         BuffStackNum;                                      // 0x0158(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_DA_AdditionalAttack*               AdditionalAttack;                                  // 0x0160(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_168[0x30];                                     // 0x0168(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAttrChange(EKSC_AttrType AttrType, int32 Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_ListenEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_ListenEvent")
	}
	static class UKSC_Buff_ListenEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ListenEvent>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_ListenEvent;

// Class KuroSimpleCombat.KSC_Buff_ModifyAttr
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_ModifyAttr final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ModifyAttr*                DaBuffModifyAttr_;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_ModifyAttr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_ModifyAttr")
	}
	static class UKSC_Buff_ModifyAttr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyAttr>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_ModifyAttr;

// Class KuroSimpleCombat.KSC_Buff_ModifyAttr_BeforeAfterApplyBuff
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_ModifyAttr_BeforeAfterApplyBuff final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ModifyAttr_BeforeAfterApplyBuff* DaBuffModifyAttr_;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_ModifyAttr_BeforeAfterApplyBuff")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_ModifyAttr_BeforeAfterApplyBuff")
	}
	static class UKSC_Buff_ModifyAttr_BeforeAfterApplyBuff* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyAttr_BeforeAfterApplyBuff>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_ModifyAttr_BeforeAfterApplyBuff;

// Class KuroSimpleCombat.KSC_Buff_ModifyAttr_BeforeAfterHit
// 0x00E0 (0x0140 - 0x0060)
class UKSC_Buff_ModifyAttr_BeforeAfterHit final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ModifyAttr_BeforeAfterHit* DaBuffModifyAttr_;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EKSC_Buff_ModifyAttr_BeforeAfterHit_CheckType CheckType;                                         // 0x0068(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKSC_DamageTypeFilter                  DamageTypeFilter;                                  // 0x0070(0x0030)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EKSC_Event_HitTarget                          CheckTarget;                                       // 0x00A0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EKSC_Event_HitTarget                          ModifyTarget;                                      // 0x00A1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKSC_TagFilter                         CheckTagFilter;                                    // 0x00A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CheckCountTag;                                     // 0x00D0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TagCount;                                          // 0x00DC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EKSC_AttrType, int32>                    ModifyMap;                                         // 0x00E0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                         ModifyCount;                                       // 0x0130(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_134[0xC];                                      // 0x0134(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_ModifyAttr_BeforeAfterHit")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_ModifyAttr_BeforeAfterHit")
	}
	static class UKSC_Buff_ModifyAttr_BeforeAfterHit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyAttr_BeforeAfterHit>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_ModifyAttr_BeforeAfterHit;

// Class KuroSimpleCombat.KSC_Move
// 0x00F0 (0x0128 - 0x0038)
class UKSC_Move : public UKSC_BaseObject
{
public:
	class AKSC_Entity*                            Owner_;                                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0xE8];                                      // 0x0040(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Move")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Move")
	}
	static class UKSC_Move* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Move>();
	}
};
DUMPER7_ASSERTS_UKSC_Move;

// Class KuroSimpleCombat.KSC_Move_Follow
// 0x0020 (0x0148 - 0x0128)
class UKSC_Move_Follow final : public UKSC_Move
{
public:
	uint8                                         Pad_128[0x20];                                     // 0x0128(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Move_Follow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Move_Follow")
	}
	static class UKSC_Move_Follow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Move_Follow>();
	}
};
DUMPER7_ASSERTS_UKSC_Move_Follow;

// Class KuroSimpleCombat.KSC_Buff_ModifyAttr_ByWorldAttr
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_ModifyAttr_ByWorldAttr final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ModifyAttr_ByWorldAttr*    DaBuffModifyAttr_;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_ModifyAttr_ByWorldAttr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_ModifyAttr_ByWorldAttr")
	}
	static class UKSC_Buff_ModifyAttr_ByWorldAttr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyAttr_ByWorldAttr>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_ModifyAttr_ByWorldAttr;

// Class KuroSimpleCombat.KSC_Buff_ModifyAttrRatio
// 0x0058 (0x00B8 - 0x0060)
class UKSC_Buff_ModifyAttrRatio final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ModifyAttrRatio*           DaBuffModifyAttrRatio_;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x50];                                      // 0x0068(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_ModifyAttrRatio")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_ModifyAttrRatio")
	}
	static class UKSC_Buff_ModifyAttrRatio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyAttrRatio>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_ModifyAttrRatio;

// Class KuroSimpleCombat.KSC_Buff_ModifyHitDamage
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_ModifyHitDamage final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ModifyHitDamage*           DaBuffModifyHitDamage_;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_ModifyHitDamage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_ModifyHitDamage")
	}
	static class UKSC_Buff_ModifyHitDamage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyHitDamage>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_ModifyHitDamage;

// Class KuroSimpleCombat.KSC_Buff_ModifyLifeRatio
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_ModifyLifeRatio final : public UKSC_Buff
{
public:
	class UKsc_Da_Buff_ModifyLifeRatio*           DaBuffModifyHpPercent_;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_ModifyLifeRatio")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_ModifyLifeRatio")
	}
	static class UKSC_Buff_ModifyLifeRatio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyLifeRatio>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_ModifyLifeRatio;

// Class KuroSimpleCombat.KSC_Buff_ModifyWorldAttr
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_ModifyWorldAttr final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ModifyWorldAttr*           DaBuffModifyAttr_;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_ModifyWorldAttr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_ModifyWorldAttr")
	}
	static class UKSC_Buff_ModifyWorldAttr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ModifyWorldAttr>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_ModifyWorldAttr;

// Class KuroSimpleCombat.KSC_Buff_Period
// 0x0048 (0x00A8 - 0x0060)
class UKSC_Buff_Period : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Period*                    DaBuffPeriod_;                                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x40];                                      // 0x0068(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAttackSpeedChange(EKSC_AttrType AttrType, int32 Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_Period")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_Period")
	}
	static class UKSC_Buff_Period* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Period>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_Period;

// Class KuroSimpleCombat.KSC_Buff_Period_Action
// 0x0008 (0x00B0 - 0x00A8)
class UKSC_Buff_Period_Action final : public UKSC_Buff_Period
{
public:
	class UKSC_DA_Buff_Period_Action*             DaBuffPeriodAction_;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_Period_Action")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_Period_Action")
	}
	static class UKSC_Buff_Period_Action* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Period_Action>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_Period_Action;

// Class KuroSimpleCombat.KSC_Buff_Pull
// 0x0090 (0x00F0 - 0x0060)
class alignas(0x10) UKSC_Buff_Pull final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Pull*                      DaBuffPull_;                                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x88];                                      // 0x0068(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_Pull")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_Pull")
	}
	static class UKSC_Buff_Pull* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Pull>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_Pull;

// Class KuroSimpleCombat.KSC_Move_Stage
// 0x0008 (0x0130 - 0x0128)
class UKSC_Move_Stage : public UKSC_Move
{
public:
	class UKSC_DA_Move_Stage*                     DA_MoveStage;                                      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Move_Stage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Move_Stage")
	}
	static class UKSC_Move_Stage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Move_Stage>();
	}
};
DUMPER7_ASSERTS_UKSC_Move_Stage;

// Class KuroSimpleCombat.KSC_Move_StageRandom
// 0x0028 (0x0158 - 0x0130)
class UKSC_Move_StageRandom final : public UKSC_Move_Stage
{
public:
	class UKSC_DA_MoveStageRandom*                DA_Move;                                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                        MovePoints;                                        // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_148[0x10];                                     // 0x0148(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Move_StageRandom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Move_StageRandom")
	}
	static class UKSC_Move_StageRandom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Move_StageRandom>();
	}
};
DUMPER7_ASSERTS_UKSC_Move_StageRandom;

// Class KuroSimpleCombat.KSC_Buff_Push
// 0x0038 (0x0098 - 0x0060)
class UKSC_Buff_Push final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Push*                      DaBuffPush_;                                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x30];                                      // 0x0068(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_Push")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_Push")
	}
	static class UKSC_Buff_Push* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Push>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_Push;

// Class KuroSimpleCombat.KSC_Buff_RemoveBuffByTags
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_RemoveBuffByTags final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_RemoveBuffByTags*          DaBuff_RemoveBuffByTag_;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_RemoveBuffByTags")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_RemoveBuffByTags")
	}
	static class UKSC_Buff_RemoveBuffByTags* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_RemoveBuffByTags>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_RemoveBuffByTags;

// Class KuroSimpleCombat.KSC_Move_Random
// 0x0048 (0x0170 - 0x0128)
class UKSC_Move_Random final : public UKSC_Move
{
public:
	uint8                                         Pad_128[0x48];                                     // 0x0128(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Move_Random")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Move_Random")
	}
	static class UKSC_Move_Random* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Move_Random>();
	}
};
DUMPER7_ASSERTS_UKSC_Move_Random;

// Class KuroSimpleCombat.KSC_Buff_ShieldEffect
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_ShieldEffect final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_ShieldEffect*              DaBuffShield_;                                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_ShieldEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_ShieldEffect")
	}
	static class UKSC_Buff_ShieldEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_ShieldEffect>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_ShieldEffect;

// Class KuroSimpleCombat.KSC_Buff_Stack_ModifyAttr
// 0x0010 (0x00F0 - 0x00E0)
class UKSC_Buff_Stack_ModifyAttr final : public UKSC_Buff_Stack
{
public:
	class UKSC_DA_Buff_Stack_ModifyAttr*          DaBuffStackModifyAttr_;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_Stack_ModifyAttr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_Stack_ModifyAttr")
	}
	static class UKSC_Buff_Stack_ModifyAttr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Stack_ModifyAttr>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_Stack_ModifyAttr;

// Class KuroSimpleCombat.KSC_GPUHeadUI
// 0x00A0 (0x0350 - 0x02B0)
class AKSC_GPUHeadUI final : public AActor
{
public:
	uint8                                         Pad_2B0[0x10];                                     // 0x02B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 InstanceIndices;                                   // 0x02C0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	TArray<int32>                                 RemovedIndices;                                    // 0x02D0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	TArray<struct FTransform>                     InstanceTransform;                                 // 0x02E0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	TMap<int32, int32>                            EntityToInstanceMap;                               // 0x02F0(0x0050)(Edit, EditConst, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          Comp;                                              // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               MI;                                                // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void InitHeadUI();
	void InitHeadUIInternal(class UInstancedStaticMeshComponent* InComp, class UMaterialInstanceDynamic* InMI);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_GPUHeadUI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_GPUHeadUI")
	}
	static class AKSC_GPUHeadUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKSC_GPUHeadUI>();
	}
};
DUMPER7_ASSERTS_AKSC_GPUHeadUI;

// Class KuroSimpleCombat.KSC_Buff_Stack_ModifyLifeRatio
// 0x0010 (0x00F0 - 0x00E0)
class UKSC_Buff_Stack_ModifyLifeRatio final : public UKSC_Buff_Stack
{
public:
	class UKSC_DA_Buff_Stack_ModifyLifeRatio*     DaBuffStackModifyLifeRatio_;                       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_Stack_ModifyLifeRatio")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_Stack_ModifyLifeRatio")
	}
	static class UKSC_Buff_Stack_ModifyLifeRatio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Stack_ModifyLifeRatio>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_Stack_ModifyLifeRatio;

// Class KuroSimpleCombat.KSC_Buff_StopAction
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_StopAction final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_StopAction*                DaBuffMoveStop_;                                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_StopAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_StopAction")
	}
	static class UKSC_Buff_StopAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_StopAction>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_StopAction;

// Class KuroSimpleCombat.KSC_Move_StageImmovable
// 0x0010 (0x0140 - 0x0130)
class UKSC_Move_StageImmovable final : public UKSC_Move_Stage
{
public:
	class UKSC_DA_MoveStageImmovable*             DA_Move;                                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Move_StageImmovable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Move_StageImmovable")
	}
	static class UKSC_Move_StageImmovable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Move_StageImmovable>();
	}
};
DUMPER7_ASSERTS_UKSC_Move_StageImmovable;

// Class KuroSimpleCombat.KSC_Buff_TransferAddAttr
// 0x0080 (0x0160 - 0x00E0)
class UKSC_Buff_TransferAddAttr final : public UKSC_Buff_Stack
{
public:
	uint8                                         Pad_E0[0x78];                                      // 0x00E0(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_DA_Buff_TransferAddAttr*           TransferAddAttr;                                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAttrChange(EKSC_AttrType AttrType, int32 Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_TransferAddAttr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_TransferAddAttr")
	}
	static class UKSC_Buff_TransferAddAttr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_TransferAddAttr>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_TransferAddAttr;

// Class KuroSimpleCombat.KSC_Buff_Unattackable_Spline
// 0x0008 (0x0068 - 0x0060)
class UKSC_Buff_Unattackable_Spline final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_Unattackable_Spline*       DaBuffUnattackable_;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_Unattackable_Spline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_Unattackable_Spline")
	}
	static class UKSC_Buff_Unattackable_Spline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Unattackable_Spline>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_Unattackable_Spline;

// Class KuroSimpleCombat.KSC_SceneSegment
// 0x0048 (0x0300 - 0x02B8)
class AKSC_SceneSegment final : public AKSC_BaseActor
{
public:
	uint8                                         Pad_2B8[0x48];                                     // 0x02B8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_SceneSegment")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_SceneSegment")
	}
	static class AKSC_SceneSegment* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKSC_SceneSegment>();
	}
};
DUMPER7_ASSERTS_AKSC_SceneSegment;

// Class KuroSimpleCombat.KSC_BuffGateUiHandle
// 0x0010 (0x0048 - 0x0038)
class UKSC_BuffGateUiHandle final : public UKSC_BaseObject
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_BuffGateUiHandle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_BuffGateUiHandle")
	}
	static class UKSC_BuffGateUiHandle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_BuffGateUiHandle>();
	}
};
DUMPER7_ASSERTS_UKSC_BuffGateUiHandle;

// Class KuroSimpleCombat.KSC_BuffId
// 0x0050 (0x0080 - 0x0030)
class UKSC_BuffId final : public UObject
{
public:
	TMap<int32, class UKSC_DA_Buff*>              BuffDa;                                            // 0x0030(0x0050)(NativeAccessSpecifierPrivate)

public:
	void AddBuffDA(const int64 BuffId, class UKSC_DA_Buff* Data);
	void ClearBuffDA();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_BuffId")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_BuffId")
	}
	static class UKSC_BuffId* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_BuffId>();
	}
};
DUMPER7_ASSERTS_UKSC_BuffId;

// Class KuroSimpleCombat.KSC_Move_Straight
// 0x0000 (0x0128 - 0x0128)
class UKSC_Move_Straight final : public UKSC_Move
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Move_Straight")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Move_Straight")
	}
	static class UKSC_Move_Straight* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Move_Straight>();
	}
};
DUMPER7_ASSERTS_UKSC_Move_Straight;

// Class KuroSimpleCombat.KSC_Bullet
// 0x00E8 (0x0120 - 0x0038)
#pragma pack(push, 0x1)
class alignas(0x10) UKSC_Bullet : public UKSC_BaseObject
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_SkillComp*                         Owner_;                                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      Niagara;                                           // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKSC_SkillComp*                         TargetEntity;                                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKSC_BulletTargetContext               TargetContext;                                     // 0x0060(0x0040)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0x78];                                      // 0x00A0(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Bullet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Bullet")
	}
	static class UKSC_Bullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Bullet>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UKSC_Bullet;

// Class KuroSimpleCombat.KSC_BulletPierce
// 0x0030 (0x0150 - 0x0120)
class UKSC_BulletPierce final : public UKSC_Bullet
{
public:
	TArray<class UKSC_SkillComp*>                 Targets_;                                          // 0x0118(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_128[0x28];                                     // 0x0128(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_BulletPierce")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_BulletPierce")
	}
	static class UKSC_BulletPierce* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_BulletPierce>();
	}
};
DUMPER7_ASSERTS_UKSC_BulletPierce;

// Class KuroSimpleCombat.KSC_CompBase
// 0x0018 (0x0050 - 0x0038)
class UKSC_CompBase : public UKSC_BaseObject
{
public:
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_CompBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_CompBase")
	}
	static class UKSC_CompBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_CompBase>();
	}
};
DUMPER7_ASSERTS_UKSC_CompBase;

// Class KuroSimpleCombat.KSC_DA_Entity
// 0x00C0 (0x00F8 - 0x0038)
class UKSC_DA_Entity : public UDataAsset
{
public:
	TSubclassOf<class AKSC_Entity>                RuntimeClass;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     EntityClass;                                       // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_Faction                                  Default_Faction;                                   // 0x0048(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EKSC_Faction>                          Default_IgnoreFactions;                            // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UKSC_DA_SceneComp*                      SceneComp;                                         // 0x0060(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKSC_DA_SkillComp*                      SkillComp;                                         // 0x0068(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKSC_DA_EntityRender*                   Render;                                            // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKSC_DA_Move*                           Move;                                              // 0x0078(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RemoveDelay;                                       // 0x0080(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableHeadUI;                                      // 0x0084(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_HeadUiType                               HeadUiType;                                        // 0x0085(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HeadUiOffset;                                      // 0x0088(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfHeight;                                        // 0x0094(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EnemyUIType;                                       // 0x0098(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EntityTypeName;                                    // 0x009C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FTransform>          SocketTransform;                                   // 0x00A8(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_DA_Entity")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_DA_Entity")
	}
	static class UKSC_DA_Entity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_DA_Entity>();
	}
};
DUMPER7_ASSERTS_UKSC_DA_Entity;

// Class KuroSimpleCombat.KSC_SceneComp
// 0x0190 (0x01E0 - 0x0050)
class alignas(0x10) UKSC_SceneComp final : public UKSC_CompBase
{
public:
	uint8                                         Pad_50[0x178];                                     // 0x0050(0x0178)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_DA_SceneComp*                      Da_SceneComp;                                      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D0[0x10];                                     // 0x01D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_SceneComp")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_SceneComp")
	}
	static class UKSC_SceneComp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_SceneComp>();
	}
};
DUMPER7_ASSERTS_UKSC_SceneComp;

// Class KuroSimpleCombat.KSC_DA_CompBase
