#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroSoHotPatch

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class KuroSoHotPatch.KuroAndroidModelTools
// 0x0000 (0x0030 - 0x0030)
class UKuroAndroidModelTools final : public UBlueprintFunctionLibrary
{
public:
	static class FString GetAndroidVersion();
	static class FString GetAppParallel();
	static class FString GetBrand();
	static class FString GetManufacturer();
	static class FString GetModel();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroAndroidModelTools">();
	}
	static class UKuroAndroidModelTools* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroAndroidModelTools>();
	}
};
static_assert(alignof(UKuroAndroidModelTools) == 0x000008, "Wrong alignment on UKuroAndroidModelTools");
static_assert(sizeof(UKuroAndroidModelTools) == 0x000030, "Wrong size on UKuroAndroidModelTools");

// Class KuroSoHotPatch.KuroOnPatchCallback
// 0x0010 (0x0040 - 0x0030)
class UKuroOnPatchCallback final : public UObject
{
public:
	TMulticastInlineDelegate<void(bool SuccessCount, const class FString& ErrorCode)> Callback;      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UKuroOnPatchCallback* GetInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroOnPatchCallback">();
	}
	static class UKuroOnPatchCallback* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroOnPatchCallback>();
	}
};
static_assert(alignof(UKuroOnPatchCallback) == 0x000008, "Wrong alignment on UKuroOnPatchCallback");
static_assert(sizeof(UKuroOnPatchCallback) == 0x000040, "Wrong size on UKuroOnPatchCallback");
static_assert(offsetof(UKuroOnPatchCallback, Callback) == 0x000030, "Member 'UKuroOnPatchCallback::Callback' has a wrong offset!");

// Class KuroSoHotPatch.KuroSPTools
// 0x0000 (0x0030 - 0x0030)
class UKuroSPTools final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetSoVersionUpdateTime();
	static void SetCDNConfig(const class FString& CDNPrefix, const class FString& CDNPath);
	static void SetChannelId(const class FString& ChannelID);
	static void SetSoVersionUpdateTime(int32 UpdateTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroSPTools">();
	}
	static class UKuroSPTools* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroSPTools>();
	}
};
static_assert(alignof(UKuroSPTools) == 0x000008, "Wrong alignment on UKuroSPTools");
static_assert(sizeof(UKuroSPTools) == 0x000030, "Wrong size on UKuroSPTools");

// Class KuroSoHotPatch.KuroTinkerTools
// 0x0000 (0x0030 - 0x0030)
class UKuroTinkerTools final : public UBlueprintFunctionLibrary
{
public:
	static void CleanPatch();
	static class FString GetCurApplyingVersion();
	static class FString GetCurLoadingVersion();
	static class FString GetCurUsingVersion();
	static bool IsTinkerPackaged();
	static void LoadPatch(const class FString& PatchPath);
	static void SetCurLoadingVersion(const class FString& Version);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroTinkerTools">();
	}
	static class UKuroTinkerTools* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroTinkerTools>();
	}
};
static_assert(alignof(UKuroTinkerTools) == 0x000008, "Wrong alignment on UKuroTinkerTools");
static_assert(sizeof(UKuroTinkerTools) == 0x000030, "Wrong size on UKuroTinkerTools");

}

