#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroFauxPhysics

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "KuroFauxPhysics_structs.hpp"


namespace SDK
{

// Class KuroFauxPhysics.KuroFauxPhysicsComponentBase
// 0x00A0 (0x02C0 - 0x0220)
#pragma pack(push, 0x1)
class alignas(0x10) UKuroFauxPhysicsComponentBase : public USceneComponent
{
public:
	bool                                          bStartDisabled;                                    // 0x0218(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreActorTimeDilation;                          // 0x0219(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopVelocityWhenDisabled;                         // 0x021A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21B[0x1];                                      // 0x021B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreventSleepFrameAfterWake;                        // 0x021C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxStepTime;                                       // 0x0220(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_224[0x94];                                     // 0x0224(0x0094)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddComponentTickBlocker(const struct FKuroInstigator& DisableInstigator);
	void AddDisabler(const struct FKuroInstigator& DisableInstigator);
	void ApplyForce(const struct FVector& Origin, const struct FVector& Force);
	void ApplyImpulse(const struct FVector& Origin, const struct FVector& Impulse);
	void ApplyMovement(const struct FVector& Origin, const struct FVector& Movement);
	void RemoveAllDisablers();
	void RemoveComponentTickBlocker(const struct FKuroInstigator& DisableInstigator);
	void RemoveDisabler(const struct FKuroInstigator& DisableInstigator);
	void ResetForces();
	void ResetInternalState();
	void ResetPhysics();
	void Sleep();
	void Wake();

	bool CanSleep() const;
	bool HasFauxPhysicsControl() const;
	bool IsEnabled() const;
	bool IsSleeping() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFauxPhysicsComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFauxPhysicsComponentBase")
	}
	static class UKuroFauxPhysicsComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFauxPhysicsComponentBase>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UKuroFauxPhysicsComponentBase;

// Class KuroFauxPhysics.KuroFauxPhysicsRotateComponentBase
// 0x0010 (0x02D0 - 0x02C0)
class UKuroFauxPhysicsRotateComponentBase : public UKuroFauxPhysicsComponentBase
{
public:
	float                                         Friction;                                          // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TorqueBounds;                                      // 0x02BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForceScalar;                                       // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpringStrength;                                    // 0x02C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFauxPhysicsRotateComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFauxPhysicsRotateComponentBase")
	}
	static class UKuroFauxPhysicsRotateComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFauxPhysicsRotateComponentBase>();
	}
};
DUMPER7_ASSERTS_UKuroFauxPhysicsRotateComponentBase;

// Class KuroFauxPhysics.KuroFauxPhysicsAxisRotateComponent
// 0x0080 (0x0350 - 0x02D0)
class UKuroFauxPhysicsAxisRotateComponent final : public UKuroFauxPhysicsRotateComponentBase
{
public:
	uint8                                         Pad_2D0[0x8];                                      // 0x02D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalRotationAxis;                                 // 0x02D8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConstrain;                                        // 0x02E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConstrainAngleMin;                                 // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConstrainAngleMax;                                 // 0x02EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConstrainBounce;                                   // 0x02F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ImpactMinStrength;                                 // 0x02F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinTimeBetweenImpacts;                             // 0x02F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(float Strength)> OnMinConstraintHit;                               // 0x0300(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Strength)> OnMaxConstraintHit;                               // 0x0310(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_320[0x30];                                     // 0x0320(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyAngularForce(const float AngularForceRadians);
	void ApplyAngularImpulse(const float AngularImpulseRadians);
	void ApplyAngularMovement(const float AngleRadians);

	float GetCurrentAlphaBetweenConstraints() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFauxPhysicsAxisRotateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFauxPhysicsAxisRotateComponent")
	}
	static class UKuroFauxPhysicsAxisRotateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFauxPhysicsAxisRotateComponent>();
	}
};
DUMPER7_ASSERTS_UKuroFauxPhysicsAxisRotateComponent;

// Class KuroFauxPhysics.KuroPrimitiveComponentVisualizer
// 0x0020 (0x0550 - 0x0530)
class UKuroPrimitiveComponentVisualizer : public UPrimitiveComponent
{
public:
	uint8                                         Pad_528[0x28];                                     // 0x0528(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DrawArc(const struct FVector& Base, const float Angle, const float Radius, const struct FVector& Direction, const struct FLinearColor& Color, const float Thickness, const struct FVector& Normal, int32 Sections, const float InnerRadius, const bool bDrawSides, const uint8 DepthPriority);
	void DrawArrow(const struct FVector& Start, const struct FVector& End, const struct FLinearColor& Color, const float ArrowSize, const float Thickness, bool bScreenSpace, const uint8 DepthPriority);
	void DrawCircle(const struct FVector& Origin, const float Radius, const struct FLinearColor& Color, const float Thickness, const struct FVector& Normal, const int32 LineSegments, const uint8 DepthPriority);
	void DrawDashedLine(const struct FVector& Start, const struct FVector& End, const struct FLinearColor& Color, const float DashSize, const float Thickness, const bool bScreenSpace, const int32 MaxDashes, const uint8 DepthPriority, const float DepthBias);
	void DrawLine(const struct FVector& Start, const struct FVector& End, const struct FLinearColor& Color, const float Thickness, const bool bScreenSpace, const uint8 DepthPriority);
	void DrawWireSphere(const struct FVector& Base, const float Radius, const struct FLinearColor& Color, const float Thickness, const int32 NumSides, const uint8 DepthPriority);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPrimitiveComponentVisualizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPrimitiveComponentVisualizer")
	}
	static class UKuroPrimitiveComponentVisualizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroPrimitiveComponentVisualizer>();
	}
};
DUMPER7_ASSERTS_UKuroPrimitiveComponentVisualizer;

// Class KuroFauxPhysics.KuroFauxPhysicsAxisRotateComponentVisualizer
// 0x0010 (0x0560 - 0x0550)
class UKuroFauxPhysicsAxisRotateComponentVisualizer final : public UKuroPrimitiveComponentVisualizer
{
public:
	uint8                                         Pad_550[0x10];                                     // 0x0550(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFauxPhysicsAxisRotateComponentVisualizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFauxPhysicsAxisRotateComponentVisualizer")
	}
	static class UKuroFauxPhysicsAxisRotateComponentVisualizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFauxPhysicsAxisRotateComponentVisualizer>();
	}
};
DUMPER7_ASSERTS_UKuroFauxPhysicsAxisRotateComponentVisualizer;

// Class KuroFauxPhysics.KuroFauxPhysicsComponentDebug
// 0x0010 (0x00D0 - 0x00C0)
class UKuroFauxPhysicsComponentDebug final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFauxPhysicsComponentDebug")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFauxPhysicsComponentDebug")
	}
	static class UKuroFauxPhysicsComponentDebug* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFauxPhysicsComponentDebug>();
	}
};
DUMPER7_ASSERTS_UKuroFauxPhysicsComponentDebug;

// Class KuroFauxPhysics.KuroFauxPhysicsConeRotateComponent
// 0x0090 (0x0360 - 0x02D0)
class UKuroFauxPhysicsConeRotateComponent final : public UKuroFauxPhysicsRotateComponentBase
{
public:
	uint8                                         Pad_2D0[0x50];                                     // 0x02D0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConeAngle;                                         // 0x0320(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalConeDirection;                                // 0x0324(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConstrainBounce;                                   // 0x0330(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConstrainTwist;                                   // 0x0334(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ImpactMinStrength;                                 // 0x0338(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinTimeBetweenImpacts;                             // 0x033C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Strength)> OnConstraintHit;                                  // 0x0340(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_350[0x10];                                     // 0x0350(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFauxPhysicsConeRotateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFauxPhysicsConeRotateComponent")
	}
	static class UKuroFauxPhysicsConeRotateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFauxPhysicsConeRotateComponent>();
	}
};
DUMPER7_ASSERTS_UKuroFauxPhysicsConeRotateComponent;

// Class KuroFauxPhysics.KuroFauxPhysicsConeRotateComponentVisualizer
// 0x0010 (0x0560 - 0x0550)
class UKuroFauxPhysicsConeRotateComponentVisualizer final : public UKuroPrimitiveComponentVisualizer
{
public:
	uint8                                         Pad_550[0x10];                                     // 0x0550(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFauxPhysicsConeRotateComponentVisualizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFauxPhysicsConeRotateComponentVisualizer")
	}
	static class UKuroFauxPhysicsConeRotateComponentVisualizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFauxPhysicsConeRotateComponentVisualizer>();
	}
};
DUMPER7_ASSERTS_UKuroFauxPhysicsConeRotateComponentVisualizer;

// Class KuroFauxPhysics.KuroFauxPhysicsFreeRotateComponent
// 0x0050 (0x0320 - 0x02D0)
class UKuroFauxPhysicsFreeRotateComponent final : public UKuroFauxPhysicsRotateComponentBase
{
public:
	uint8                                         Pad_2D0[0x40];                                     // 0x02D0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConstrainedAngularVelocityDegrees;                 // 0x0310(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_314[0xC];                                      // 0x0314(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFauxPhysicsFreeRotateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFauxPhysicsFreeRotateComponent")
	}
	static class UKuroFauxPhysicsFreeRotateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFauxPhysicsFreeRotateComponent>();
	}
};
DUMPER7_ASSERTS_UKuroFauxPhysicsFreeRotateComponent;

// Class KuroFauxPhysics.KuroFauxPhysicsFreeRotateComponentVisualizer
// 0x0010 (0x0560 - 0x0550)
class UKuroFauxPhysicsFreeRotateComponentVisualizer final : public UKuroPrimitiveComponentVisualizer
{
public:
	uint8                                         Pad_550[0x10];                                     // 0x0550(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFauxPhysicsFreeRotateComponentVisualizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFauxPhysicsFreeRotateComponentVisualizer")
	}
	static class UKuroFauxPhysicsFreeRotateComponentVisualizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFauxPhysicsFreeRotateComponentVisualizer>();
	}
};
DUMPER7_ASSERTS_UKuroFauxPhysicsFreeRotateComponentVisualizer;

// Class KuroFauxPhysics.KuroVisualizedInterface
// 0x0000 (0x0000 - 0x0000)
class IKuroVisualizedInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroVisualizedInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroVisualizedInterface")
	}
	static class IKuroVisualizedInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IKuroVisualizedInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IKuroVisualizedInterface;

// Class KuroFauxPhysics.KuroVisualizerInterface
// 0x0000 (0x0000 - 0x0000)
class IKuroVisualizerInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroVisualizerInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroVisualizerInterface")
	}
	static class IKuroVisualizerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IKuroVisualizerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IKuroVisualizerInterface;

// Class KuroFauxPhysics.KuroAxisVisualizedInterface
// 0x0000 (0x0000 - 0x0000)
class IKuroAxisVisualizedInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroAxisVisualizedInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroAxisVisualizedInterface")
	}
	static class IKuroAxisVisualizedInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IKuroAxisVisualizedInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IKuroAxisVisualizedInterface;

// Class KuroFauxPhysics.KuroConeVisualizedInterface
// 0x0000 (0x0000 - 0x0000)
class IKuroConeVisualizedInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroConeVisualizedInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroConeVisualizedInterface")
	}
	static class IKuroConeVisualizedInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IKuroConeVisualizedInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IKuroConeVisualizedInterface;

// Class KuroFauxPhysics.KuroFreeVisualizedInterface
// 0x0000 (0x0000 - 0x0000)
class IKuroFreeVisualizedInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFreeVisualizedInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFreeVisualizedInterface")
	}
	static class IKuroFreeVisualizedInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IKuroFreeVisualizedInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IKuroFreeVisualizedInterface;

// Class KuroFauxPhysics.KuroPrimitiveVisualizedInterface
// 0x0000 (0x0000 - 0x0000)
class IKuroPrimitiveVisualizedInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroPrimitiveVisualizedInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroPrimitiveVisualizedInterface")
	}
	static class IKuroPrimitiveVisualizedInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IKuroPrimitiveVisualizedInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IKuroPrimitiveVisualizedInterface;

// Class KuroFauxPhysics.KuroFauxPhysicsTrackTargetComponent
// 0x00A0 (0x0360 - 0x02C0)
class UKuroFauxPhysicsTrackTargetComponent final : public UKuroFauxPhysicsComponentBase
{
public:
	uint8                                         Pad_2B8[0x10];                                     // 0x02B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PredictionFactor;                                  // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitLinearSpeed;                                   // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopTrackTargetDistance;                           // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FVector& CurrentLinearVelocity)> OnStopTrackTarget;   // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                CurrentLinearVelocity;                             // 0x02E8(0x000C)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinTimeToIntercept;                                // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTimeToIntercept;                                // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardOffsetRatio;                                // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETrackMethod                                  TrackMethod;                                       // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_301[0x5F];                                     // 0x0301(0x005F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector CustomGetDirection(const struct FVector& PosA, const struct FVector& VelA, const struct FVector& PosB, const float SpeedB);
	void StartTrackTarget(class APawn* Target);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFauxPhysicsTrackTargetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFauxPhysicsTrackTargetComponent")
	}
	static class UKuroFauxPhysicsTrackTargetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFauxPhysicsTrackTargetComponent>();
	}
};
DUMPER7_ASSERTS_UKuroFauxPhysicsTrackTargetComponent;

// Class KuroFauxPhysics.KuroFauxPhysicsTrackTargetComponentVisualizer
// 0x0010 (0x0560 - 0x0550)
class UKuroFauxPhysicsTrackTargetComponentVisualizer final : public UKuroPrimitiveComponentVisualizer
{
public:
	uint8                                         Pad_550[0x10];                                     // 0x0550(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroFauxPhysicsTrackTargetComponentVisualizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroFauxPhysicsTrackTargetComponentVisualizer")
	}
	static class UKuroFauxPhysicsTrackTargetComponentVisualizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroFauxPhysicsTrackTargetComponentVisualizer>();
	}
};
DUMPER7_ASSERTS_UKuroFauxPhysicsTrackTargetComponentVisualizer;

}

