#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LaunchScene

#include "Basic.hpp"


namespace SDK::Params
{

// Function LaunchScene.LaunchScene_C.ExecuteUbergraph_LaunchScene
// 0x0018 (0x0018 - 0x0000)
struct LaunchScene_C_ExecuteUbergraph_LaunchScene final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPureCSharpEnvironment_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LaunchScene_C_ExecuteUbergraph_LaunchScene) == 0x000008, "Wrong alignment on LaunchScene_C_ExecuteUbergraph_LaunchScene");
static_assert(sizeof(LaunchScene_C_ExecuteUbergraph_LaunchScene) == 0x000018, "Wrong size on LaunchScene_C_ExecuteUbergraph_LaunchScene");
static_assert(offsetof(LaunchScene_C_ExecuteUbergraph_LaunchScene, EntryPoint) == 0x000000, "Member 'LaunchScene_C_ExecuteUbergraph_LaunchScene::EntryPoint' has a wrong offset!");
static_assert(offsetof(LaunchScene_C_ExecuteUbergraph_LaunchScene, CallFunc_IsPureCSharpEnvironment_ReturnValue) == 0x000004, "Member 'LaunchScene_C_ExecuteUbergraph_LaunchScene::CallFunc_IsPureCSharpEnvironment_ReturnValue' has a wrong offset!");
static_assert(offsetof(LaunchScene_C_ExecuteUbergraph_LaunchScene, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'LaunchScene_C_ExecuteUbergraph_LaunchScene::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(LaunchScene_C_ExecuteUbergraph_LaunchScene, CallFunc_GetGameInstance_ReturnValue_1) == 0x000010, "Member 'LaunchScene_C_ExecuteUbergraph_LaunchScene::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");

}

