#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelGamePlayBlueprintFunctionLibrary

#include "Basic.hpp"

#include "KuroMath_structs.hpp"


namespace SDK::Params
{

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.ClearAllScanEffects
// 0x0008 (0x0008 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects) == 0x000008, "Wrong alignment on LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects");
static_assert(sizeof(LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects) == 0x000008, "Wrong size on LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects, __WorldContext) == 0x000000, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects::__WorldContext' has a wrong offset!");

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.SceneInteractionBind
// 0x0030 (0x0030 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind final
{
public:
	class AActor*                                 actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 seqName;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 eventName;                                         // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind) == 0x000008, "Wrong alignment on LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind");
static_assert(sizeof(LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind) == 0x000030, "Wrong size on LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind, actor) == 0x000000, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind::actor' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind, seqName) == 0x000008, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind::seqName' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind, eventName) == 0x000018, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind::eventName' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind, __WorldContext) == 0x000028, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind::__WorldContext' has a wrong offset!");

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.GetScanMaxDistance
// 0x0010 (0x0010 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance) == 0x000008, "Wrong alignment on LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance");
static_assert(sizeof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance) == 0x000010, "Wrong size on LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance, __WorldContext) == 0x000000, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance::__WorldContext' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance, ReturnValue) == 0x000008, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance::ReturnValue' has a wrong offset!");

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.GetScanInteractionEffectMaxDistance
// 0x0010 (0x0010 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance) == 0x000008, "Wrong alignment on LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance");
static_assert(sizeof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance) == 0x000010, "Wrong size on LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance, __WorldContext) == 0x000000, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance::__WorldContext' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance, ReturnValue) == 0x000008, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance::ReturnValue' has a wrong offset!");

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.ApplyScanEffect
// 0x0020 (0x0020 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect final
{
public:
	class AActor*                                 inActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         type;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect) == 0x000008, "Wrong alignment on LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect");
static_assert(sizeof(LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect) == 0x000020, "Wrong size on LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect, inActor) == 0x000000, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect::inActor' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect, type) == 0x000008, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect::type' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect, __WorldContext) == 0x000010, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect, ReturnValue) == 0x000018, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect::ReturnValue' has a wrong offset!");

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.DifferenceSelectedActorsSplines
// 0x0018 (0x0018 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_DifferenceSelectedActorsSplines final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKuroGeometryGeneralPolygonList        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(LevelGamePlayBlueprintFunctionLibrary_C_DifferenceSelectedActorsSplines) == 0x000008, "Wrong alignment on LevelGamePlayBlueprintFunctionLibrary_C_DifferenceSelectedActorsSplines");
static_assert(sizeof(LevelGamePlayBlueprintFunctionLibrary_C_DifferenceSelectedActorsSplines) == 0x000018, "Wrong size on LevelGamePlayBlueprintFunctionLibrary_C_DifferenceSelectedActorsSplines");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_DifferenceSelectedActorsSplines, __WorldContext) == 0x000000, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_DifferenceSelectedActorsSplines::__WorldContext' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_DifferenceSelectedActorsSplines, ReturnValue) == 0x000008, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_DifferenceSelectedActorsSplines::ReturnValue' has a wrong offset!");

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.GetPolygonListFromSplines
// 0x0028 (0x0028 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_GetPolygonListFromSplines final
{
public:
	TArray<class USplineComponent*>               splines;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKuroGeometryGeneralPolygonList        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(LevelGamePlayBlueprintFunctionLibrary_C_GetPolygonListFromSplines) == 0x000008, "Wrong alignment on LevelGamePlayBlueprintFunctionLibrary_C_GetPolygonListFromSplines");
static_assert(sizeof(LevelGamePlayBlueprintFunctionLibrary_C_GetPolygonListFromSplines) == 0x000028, "Wrong size on LevelGamePlayBlueprintFunctionLibrary_C_GetPolygonListFromSplines");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_GetPolygonListFromSplines, splines) == 0x000000, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_GetPolygonListFromSplines::splines' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_GetPolygonListFromSplines, __WorldContext) == 0x000010, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_GetPolygonListFromSplines::__WorldContext' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_GetPolygonListFromSplines, ReturnValue) == 0x000018, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_GetPolygonListFromSplines::ReturnValue' has a wrong offset!");

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.PolygonsOpenPathsDifferenceViaSplines
// 0x0040 (0x0040 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines final
{
public:
	TArray<class USplineComponent*>               subjects;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class USplineComponent*>               openPaths;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	float                                         strokeWidth;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJoinType                                     joinType;                                          // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndType                                      endType;                                           // 0x0025(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKuroGeometryGeneralPolygonList        ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines) == 0x000008, "Wrong alignment on LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines");
static_assert(sizeof(LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines) == 0x000040, "Wrong size on LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines, subjects) == 0x000000, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines::subjects' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines, openPaths) == 0x000010, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines::openPaths' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines, strokeWidth) == 0x000020, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines::strokeWidth' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines, joinType) == 0x000024, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines::joinType' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines, endType) == 0x000025, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines::endType' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines, __WorldContext) == 0x000028, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines::__WorldContext' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines, ReturnValue) == 0x000030, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines::ReturnValue' has a wrong offset!");

}

