#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelGamePlayBlueprintFunctionLibrary

#include "Basic.hpp"

#include "KuroMath_structs.hpp"


namespace SDK::Params
{

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.ClearAllScanEffects
// 0x0008 (0x0008 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects;

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.SceneInteractionBind
// 0x0030 (0x0030 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind final
{
public:
	class AActor*                                 actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 seqName;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 eventName;                                         // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind;

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.GetScanMaxDistance
// 0x0010 (0x0010 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance;

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.GetScanInteractionEffectMaxDistance
// 0x0010 (0x0010 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance;

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.ApplyScanEffect
// 0x0020 (0x0020 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect final
{
public:
	class AActor*                                 inActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         type;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect;

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.DifferenceSelectedActorsSplines
// 0x0018 (0x0018 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_DifferenceSelectedActorsSplines final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKuroGeometryGeneralPolygonList        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_LevelGamePlayBlueprintFunctionLibrary_C_DifferenceSelectedActorsSplines;

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.GetPolygonListFromSplines
// 0x0028 (0x0028 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_GetPolygonListFromSplines final
{
public:
	TArray<class USplineComponent*>               splines;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKuroGeometryGeneralPolygonList        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_LevelGamePlayBlueprintFunctionLibrary_C_GetPolygonListFromSplines;

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.PolygonsOpenPathsDifferenceViaSplines
// 0x0040 (0x0040 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines final
{
public:
	TArray<class USplineComponent*>               subjects;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class USplineComponent*>               openPaths;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	float                                         strokeWidth;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJoinType                                     joinType;                                          // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndType                                      endType;                                           // 0x0025(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKuroGeometryGeneralPolygonList        ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_LevelGamePlayBlueprintFunctionLibrary_C_PolygonsOpenPathsDifferenceViaSplines;

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.UseNewScanSystem
// 0x0010 (0x0010 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_UseNewScanSystem final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_LevelGamePlayBlueprintFunctionLibrary_C_UseNewScanSystem;

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.StartScan
// 0x0008 (0x0008 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_StartScan final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LevelGamePlayBlueprintFunctionLibrary_C_StartScan;

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.GenFurniturePrefabIcon
// 0x0018 (0x0018 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_GenFurniturePrefabIcon final
{
public:
	class FString                                 path;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LevelGamePlayBlueprintFunctionLibrary_C_GenFurniturePrefabIcon;

}

