#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LGUI

#include "Basic.hpp"

#include "LTween_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LGUI_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "KuroDynamicAtlas_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function LGUI.LGUIBehaviour.InstantiateActor
// 0x0018 (0x0018 - 0x0000)
struct LGUIBehaviour_InstantiateActor final
{
public:
	class AActor*                                 OriginObject;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        Parent;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_InstantiateActor;

// Function LGUI.LGUIBehaviour.InstantiatePrefab
// 0x0018 (0x0018 - 0x0000)
struct LGUIBehaviour_InstantiatePrefab final
{
public:
	class ULGUIPrefab*                            OriginObject;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        Parent;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_InstantiatePrefab;

// Function LGUI.LGUIBehaviour.InstantiatePrefabWithTransform
// 0x0040 (0x0040 - 0x0000)
struct LGUIBehaviour_InstantiatePrefabWithTransform final
{
public:
	class ULGUIPrefab*                            OriginObject;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        Parent;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_InstantiatePrefabWithTransform;

// Function LGUI.LGUIBehaviour.LateUpdateBP
// 0x0004 (0x0004 - 0x0000)
struct LGUIBehaviour_LateUpdateBP final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_LateUpdateBP;

// Function LGUI.LGUIBehaviour.OnUIActiveInHierarchyBP
// 0x0001 (0x0001 - 0x0000)
struct LGUIBehaviour_OnUIActiveInHierarchyBP final
{
public:
	bool                                          activeOrInactive;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_OnUIActiveInHierarchyBP;

// Function LGUI.LGUIBehaviour.OnUIChildAcitveInHierarchyBP
// 0x0010 (0x0010 - 0x0000)
struct LGUIBehaviour_OnUIChildAcitveInHierarchyBP final
{
public:
	class UUIItem*                                child;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ativeOrInactive;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LGUIBehaviour_OnUIChildAcitveInHierarchyBP;

// Function LGUI.LGUIBehaviour.OnUIChildAttachmentChangedBP
// 0x0010 (0x0010 - 0x0000)
struct LGUIBehaviour_OnUIChildAttachmentChangedBP final
{
public:
	class UUIItem*                                child;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          attachOrDetach;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LGUIBehaviour_OnUIChildAttachmentChangedBP;

// Function LGUI.LGUIBehaviour.OnUIChildHierarchyIndexChangedBP
// 0x0008 (0x0008 - 0x0000)
struct LGUIBehaviour_OnUIChildHierarchyIndexChangedBP final
{
public:
	class UUIItem*                                child;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_OnUIChildHierarchyIndexChangedBP;

// Function LGUI.LGUIBehaviour.OnUIDimensionsChangedBP
// 0x0002 (0x0002 - 0x0000)
struct LGUIBehaviour_OnUIDimensionsChangedBP final
{
public:
	bool                                          positionChanged;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          sizeChanged;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_OnUIDimensionsChangedBP;

// Function LGUI.LGUIBehaviour.OnUIInteractionStateChangedBP
// 0x0001 (0x0001 - 0x0000)
struct LGUIBehaviour_OnUIInteractionStateChangedBP final
{
public:
	bool                                          interactableOrNot;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_OnUIInteractionStateChangedBP;

// Function LGUI.LGUIBehaviour.SetEnable
// 0x0001 (0x0001 - 0x0000)
struct LGUIBehaviour_SetEnable final
{
public:
	bool                                          value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_SetEnable;

// Function LGUI.LGUIBehaviour.UpdateBP
// 0x0004 (0x0004 - 0x0000)
struct LGUIBehaviour_UpdateBP final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_UpdateBP;

// Function LGUI.LGUIBehaviour.CheckRootUIComponent
// 0x0001 (0x0001 - 0x0000)
struct LGUIBehaviour_CheckRootUIComponent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_CheckRootUIComponent;

// Function LGUI.LGUIBehaviour.GetEnable
// 0x0001 (0x0001 - 0x0000)
struct LGUIBehaviour_GetEnable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_GetEnable;

// Function LGUI.LGUIBehaviour.GetIsActiveAndEnable
// 0x0001 (0x0001 - 0x0000)
struct LGUIBehaviour_GetIsActiveAndEnable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_GetIsActiveAndEnable;

// Function LGUI.LGUIBehaviour.GetRootComponent
// 0x0008 (0x0008 - 0x0000)
struct LGUIBehaviour_GetRootComponent final
{
public:
	class UUIItem*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_GetRootComponent;

// Function LGUI.LGUIBehaviour.GetRootSceneComponent
// 0x0008 (0x0008 - 0x0000)
struct LGUIBehaviour_GetRootSceneComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LGUIBehaviour_GetRootSceneComponent;

// Function LGUI.UILayoutElement.SetConstantSize
// 0x0004 (0x0004 - 0x0000)
struct UILayoutElement_SetConstantSize final
{
public:
	float                                         value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UILayoutElement_SetConstantSize;

// Function LGUI.UILayoutElement.SetLayoutType
// 0x0001 (0x0001 - 0x0000)
struct UILayoutElement_SetLayoutType final
{
public:
	ELayoutElementType                            InType;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UILayoutElement_SetLayoutType;

// Function LGUI.UILayoutElement.SetRatioSize
// 0x0004 (0x0004 - 0x0000)
struct UILayoutElement_SetRatioSize final
{
public:
	float                                         value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UILayoutElement_SetRatioSize;

// Function LGUI.UILayoutElement.GetConstantSize
// 0x0004 (0x0004 - 0x0000)
struct UILayoutElement_GetConstantSize final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UILayoutElement_GetConstantSize;

// Function LGUI.UILayoutElement.GetIgnoreLayout
// 0x0001 (0x0001 - 0x0000)
struct UILayoutElement_GetIgnoreLayout final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UILayoutElement_GetIgnoreLayout;

// Function LGUI.UILayoutElement.GetLayoutType
// 0x0001 (0x0001 - 0x0000)
struct UILayoutElement_GetLayoutType final
{
public:
	ELayoutElementType                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UILayoutElement_GetLayoutType;

// Function LGUI.UILayoutElement.GetRatioSize
// 0x0004 (0x0004 - 0x0000)
struct UILayoutElement_GetRatioSize final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UILayoutElement_GetRatioSize;

// Function LGUI.UIItem.GetAllAttachUIChildren
// 0x0010 (0x0010 - 0x0000)
struct UIItem_GetAllAttachUIChildren final
{
public:
	TArray<class UUIItem*>                        OutArray;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetAllAttachUIChildren;

// Function LGUI.UIItem.GetLGUISpaceAbsolutePosition
// 0x000C (0x000C - 0x0000)
struct UIItem_GetLGUISpaceAbsolutePosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetLGUISpaceAbsolutePosition;

// Function LGUI.UIItem.GetLGUISpaceAbsolutePositionByPivot
// 0x0014 (0x0014 - 0x0000)
struct UIItem_GetLGUISpaceAbsolutePositionByPivot final
{
public:
	struct FVector2D                              Pivot;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetLGUISpaceAbsolutePositionByPivot;

// Function LGUI.UIItem.GetLGUISpaceCenterAbsolutePosition
// 0x000C (0x000C - 0x0000)
struct UIItem_GetLGUISpaceCenterAbsolutePosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetLGUISpaceCenterAbsolutePosition;

// Function LGUI.UIItem.GetOverlapWith
// 0x0010 (0x0010 - 0x0000)
struct UIItem_GetOverlapWith final
{
public:
	class UUIItem*                                UIItem;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIItem_GetOverlapWith;

// Function LGUI.UIItem.GetParentAsUIItem
// 0x0008 (0x0008 - 0x0000)
struct UIItem_GetParentAsUIItem final
{
public:
	class UUIItem*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetParentAsUIItem;

// Function LGUI.UIItem.GetPositionInScreen
// 0x000C (0x000C - 0x0000)
struct UIItem_GetPositionInScreen final
{
public:
	bool                                          bIsScaledByDPI;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetPositionInScreen;

// Function LGUI.UIItem.GetPositionInScreenWithPivot
// 0x0014 (0x0014 - 0x0000)
struct UIItem_GetPositionInScreenWithPivot final
{
public:
	bool                                          bIsScaledByDPI;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SpecifiedPivot;                                    // 0x0004(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetPositionInScreenWithPivot;

// Function LGUI.UIItem.GetPositionInViewPort
// 0x000C (0x000C - 0x0000)
struct UIItem_GetPositionInViewPort final
{
public:
	bool                                          bIsScaledByDPI;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetPositionInViewPort;

// Function LGUI.UIItem.GetPositionInViewPortOld
// 0x000C (0x000C - 0x0000)
struct UIItem_GetPositionInViewPortOld final
{
public:
	bool                                          bIsScaledByDPI;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetPositionInViewPortOld;

// Function LGUI.UIItem.GetPositionInViewportWithPivot
// 0x0014 (0x0014 - 0x0000)
struct UIItem_GetPositionInViewportWithPivot final
{
public:
	bool                                          bIsScaledByDPI;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SpecifiedPivot;                                    // 0x0004(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetPositionInViewportWithPivot;

// Function LGUI.UIItem.GetPositionInViewportWithPivotNormalized
// 0x0014 (0x0014 - 0x0000)
struct UIItem_GetPositionInViewportWithPivotNormalized final
{
public:
	bool                                          bIsScaledByDPI;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SpecifiedPivot;                                    // 0x0004(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetPositionInViewportWithPivotNormalized;

// Function LGUI.UIItem.GetRenderCanvas
// 0x0008 (0x0008 - 0x0000)
struct UIItem_GetRenderCanvas final
{
public:
	class ULGUICanvas*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetRenderCanvas;

// Function LGUI.UIItem.GetUIWorldPosition
// 0x000C (0x000C - 0x0000)
struct UIItem_GetUIWorldPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetUIWorldPosition;

// Function LGUI.UIItem.IsBoundOutOfScreen
// 0x0001 (0x0001 - 0x0000)
struct UIItem_IsBoundOutOfScreen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_IsBoundOutOfScreen;

// Function LGUI.UIItem.IsRenderTargetUI
// 0x0001 (0x0001 - 0x0000)
struct UIItem_IsRenderTargetUI final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_IsRenderTargetUI;

// Function LGUI.UIItem.IsScreenSpaceOverlayUI
// 0x0001 (0x0001 - 0x0000)
struct UIItem_IsScreenSpaceOverlayUI final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_IsScreenSpaceOverlayUI;

// Function LGUI.UIItem.IsWorldSpaceUI
// 0x0001 (0x0001 - 0x0000)
struct UIItem_IsWorldSpaceUI final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_IsWorldSpaceUI;

// Function LGUI.UIItem.PlayUIItemAlphaTween
// 0x000C (0x000C - 0x0000)
struct UIItem_PlayUIItemAlphaTween final
{
public:
	float                                         StartValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndValue;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_PlayUIItemAlphaTween;

// Function LGUI.UIItem.PlayUIItemScaleTween
// 0x000C (0x000C - 0x0000)
struct UIItem_PlayUIItemScaleTween final
{
public:
	float                                         StartValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndValue;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_PlayUIItemScaleTween;

// Function LGUI.UIItem.SetAlpha
// 0x0004 (0x0004 - 0x0000)
struct UIItem_SetAlpha final
{
public:
	float                                         newAlpha;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetAlpha;

// Function LGUI.UIItem.SetAnchorAlign
// 0x0002 (0x0002 - 0x0000)
struct UIItem_SetAnchorAlign final
{
public:
	EUIAnchorHorizontalAlign                      HAlign;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIAnchorVerticalAlign                        VAlign;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetAnchorAlign;

// Function LGUI.UIItem.SetAnchorHAlign
// 0x0001 (0x0001 - 0x0000)
struct UIItem_SetAnchorHAlign final
{
public:
	EUIAnchorHorizontalAlign                      align;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetAnchorHAlign;

// Function LGUI.UIItem.SetAnchorOffset
// 0x0008 (0x0008 - 0x0000)
struct UIItem_SetAnchorOffset final
{
public:
	struct FVector2D                              NewOffset;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetAnchorOffset;

// Function LGUI.UIItem.SetAnchorOffsetX
// 0x0004 (0x0004 - 0x0000)
struct UIItem_SetAnchorOffsetX final
{
public:
	float                                         NewOffset;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetAnchorOffsetX;

// Function LGUI.UIItem.SetAnchorOffsetY
// 0x0004 (0x0004 - 0x0000)
struct UIItem_SetAnchorOffsetY final
{
public:
	float                                         NewOffset;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetAnchorOffsetY;

// Function LGUI.UIItem.SetAnchorVAlign
// 0x0001 (0x0001 - 0x0000)
struct UIItem_SetAnchorVAlign final
{
public:
	EUIAnchorVerticalAlign                        align;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetAnchorVAlign;

// Function LGUI.UIItem.SetBubbleUpToParent
// 0x0001 (0x0001 - 0x0000)
struct UIItem_SetBubbleUpToParent final
{
public:
	bool                                          NewBool;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetBubbleUpToParent;

// Function LGUI.UIItem.SetChangeColor
// 0x0008 (0x0008 - 0x0000)
struct UIItem_SetChangeColor final
{
public:
	bool                                          bUseChangeColor;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 NewColor;                                          // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetChangeColor;

// Function LGUI.UIItem.SetColor
// 0x0004 (0x0004 - 0x0000)
struct UIItem_SetColor final
{
public:
	struct FColor                                 NewColor;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetColor;

// Function LGUI.UIItem.SetDepth
// 0x0008 (0x0008 - 0x0000)
struct UIItem_SetDepth final
{
public:
	int32                                         depth;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          propagateToChildren;                               // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIItem_SetDepth;

// Function LGUI.UIItem.SetDisplayName
// 0x0010 (0x0010 - 0x0000)
struct UIItem_SetDisplayName final
{
public:
	class FString                                 InName;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetDisplayName;

// Function LGUI.UIItem.SetHeight
// 0x0004 (0x0004 - 0x0000)
struct UIItem_SetHeight final
{
public:
	float                                         NewHeight;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetHeight;

// Function LGUI.UIItem.SetHierarchyIndex
// 0x0004 (0x0004 - 0x0000)
struct UIItem_SetHierarchyIndex final
{
public:
	int32                                         InInt;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetHierarchyIndex;

// Function LGUI.UIItem.SetHorizontalStretch
// 0x0008 (0x0008 - 0x0000)
struct UIItem_SetHorizontalStretch final
{
public:
	struct FVector2D                              newStretch;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetHorizontalStretch;

// Function LGUI.UIItem.SetIsUIActive
// 0x0001 (0x0001 - 0x0000)
struct UIItem_SetIsUIActive final
{
public:
	bool                                          active;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetIsUIActive;

// Function LGUI.UIItem.SetLGUISpaceAbsolutePosition
// 0x000C (0x000C - 0x0000)
struct UIItem_SetLGUISpaceAbsolutePosition final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetLGUISpaceAbsolutePosition;

// Function LGUI.UIItem.SetPivot
// 0x0008 (0x0008 - 0x0000)
struct UIItem_SetPivot final
{
public:
	struct FVector2D                              NewPivot;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetPivot;

// Function LGUI.UIItem.SetPivot_Raw
// 0x000C (0x000C - 0x0000)
struct UIItem_SetPivot_Raw final
{
public:
	struct FVector2D                              NewPivot;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAdjustLocation;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIItem_SetPivot_Raw;

// Function LGUI.UIItem.SetRaycastTarget
// 0x0001 (0x0001 - 0x0000)
struct UIItem_SetRaycastTarget final
{
public:
	bool                                          NewBool;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetRaycastTarget;

// Function LGUI.UIItem.SetStretchBottom
// 0x0004 (0x0004 - 0x0000)
struct UIItem_SetStretchBottom final
{
public:
	float                                         newBottom;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetStretchBottom;

// Function LGUI.UIItem.SetStretchLeft
// 0x0004 (0x0004 - 0x0000)
struct UIItem_SetStretchLeft final
{
public:
	float                                         newLeft;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetStretchLeft;

// Function LGUI.UIItem.SetStretchRight
// 0x0004 (0x0004 - 0x0000)
struct UIItem_SetStretchRight final
{
public:
	float                                         newRight;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetStretchRight;

// Function LGUI.UIItem.SetStretchTop
// 0x0004 (0x0004 - 0x0000)
struct UIItem_SetStretchTop final
{
public:
	float                                         newTop;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetStretchTop;

// Function LGUI.UIItem.SetTraceChannel
// 0x0001 (0x0001 - 0x0000)
struct UIItem_SetTraceChannel final
{
public:
	ETraceTypeQuery                               InTraceChannel;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetTraceChannel;

// Function LGUI.UIItem.SetUIActive
// 0x0001 (0x0001 - 0x0000)
struct UIItem_SetUIActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetUIActive;

// Function LGUI.UIItem.SetUIItemAlpha
// 0x0004 (0x0004 - 0x0000)
struct UIItem_SetUIItemAlpha final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetUIItemAlpha;

// Function LGUI.UIItem.SetUIItemScale
// 0x000C (0x000C - 0x0000)
struct UIItem_SetUIItemScale final
{
public:
	struct FVector                                Value;                                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetUIItemScale;

// Function LGUI.UIItem.SetUIParent
// 0x0010 (0x0010 - 0x0000)
struct UIItem_SetUIParent final
{
public:
	class UUIItem*                                InParent;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          KeepWorldTransform;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIItem_SetUIParent;

// Function LGUI.UIItem.SetUIRelativeLocation
// 0x000C (0x000C - 0x0000)
struct UIItem_SetUIRelativeLocation final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetUIRelativeLocation;

// Function LGUI.UIItem.SetUIRelativeRotation
// 0x000C (0x000C - 0x0000)
struct UIItem_SetUIRelativeRotation final
{
public:
	struct FRotator                               NewRotation;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetUIRelativeRotation;

// Function LGUI.UIItem.SetUIRelativeScale3D
// 0x000C (0x000C - 0x0000)
struct UIItem_SetUIRelativeScale3D final
{
public:
	struct FVector                                NewScale3D;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetUIRelativeScale3D;

// Function LGUI.UIItem.SetUIRenderAfterBlur
// 0x0001 (0x0001 - 0x0000)
struct UIItem_SetUIRenderAfterBlur final
{
public:
	bool                                          bAfterBlur;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetUIRenderAfterBlur;

// Function LGUI.UIItem.SetUIRenderBeforeBloom
// 0x0001 (0x0001 - 0x0000)
struct UIItem_SetUIRenderBeforeBloom final
{
public:
	bool                                          bBeforeBloom;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetUIRenderBeforeBloom;

// Function LGUI.UIItem.SetUIRenderBeforeUpScale
// 0x0001 (0x0001 - 0x0000)
struct UIItem_SetUIRenderBeforeUpScale final
{
public:
	bool                                          bBeforeUpScale;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetUIRenderBeforeUpScale;

// Function LGUI.UIItem.SetUIWorldLocation
// 0x000C (0x000C - 0x0000)
struct UIItem_SetUIWorldLocation final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetUIWorldLocation;

// Function LGUI.UIItem.SetUIWorldRotation
// 0x000C (0x000C - 0x0000)
struct UIItem_SetUIWorldRotation final
{
public:
	struct FRotator                               NewRotation;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetUIWorldRotation;

// Function LGUI.UIItem.SetUIWorldScale
// 0x000C (0x000C - 0x0000)
struct UIItem_SetUIWorldScale final
{
public:
	struct FVector                                NewScale;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetUIWorldScale;

// Function LGUI.UIItem.SetVerticalStretch
// 0x0008 (0x0008 - 0x0000)
struct UIItem_SetVerticalStretch final
{
public:
	struct FVector2D                              newStretch;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetVerticalStretch;

// Function LGUI.UIItem.SetWidget
// 0x0054 (0x0054 - 0x0000)
struct UIItem_SetWidget final
{
public:
	struct FUIWidget                              inWidget;                                          // 0x0000(0x0054)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetWidget;

// Function LGUI.UIItem.SetWidth
// 0x0004 (0x0004 - 0x0000)
struct UIItem_SetWidth final
{
public:
	float                                         NewWidth;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_SetWidth;

// Function LGUI.UIItem.GetAlpha
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetAlpha;

// Function LGUI.UIItem.GetAnchorHAlign
// 0x0001 (0x0001 - 0x0000)
struct UIItem_GetAnchorHAlign final
{
public:
	EUIAnchorHorizontalAlign                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetAnchorHAlign;

// Function LGUI.UIItem.GetAnchorOffset
// 0x0008 (0x0008 - 0x0000)
struct UIItem_GetAnchorOffset final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetAnchorOffset;

// Function LGUI.UIItem.GetAnchorOffsetX
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetAnchorOffsetX final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetAnchorOffsetX;

// Function LGUI.UIItem.GetAnchorOffsetY
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetAnchorOffsetY final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetAnchorOffsetY;

// Function LGUI.UIItem.GetAnchorVAlign
// 0x0001 (0x0001 - 0x0000)
struct UIItem_GetAnchorVAlign final
{
public:
	EUIAnchorVerticalAlign                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetAnchorVAlign;

// Function LGUI.UIItem.GetAttachUIChild
// 0x0010 (0x0010 - 0x0000)
struct UIItem_GetAttachUIChild final
{
public:
	int32                                         index;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIItem*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetAttachUIChild;

// Function LGUI.UIItem.GetAttachUIChildren
// 0x0010 (0x0010 - 0x0000)
struct UIItem_GetAttachUIChildren final
{
public:
	TArray<class UUIItem*>                        ReturnValue;                                       // 0x0000(0x0010)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetAttachUIChildren;

// Function LGUI.UIItem.GetCalculatedParentAlpha
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetCalculatedParentAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetCalculatedParentAlpha;

// Function LGUI.UIItem.GetCalculatedParentColor
// 0x000C (0x000C - 0x0000)
struct UIItem_GetCalculatedParentColor final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetCalculatedParentColor;

// Function LGUI.UIItem.GetCanvasScaler
// 0x0008 (0x0008 - 0x0000)
struct UIItem_GetCanvasScaler final
{
public:
	class ULGUICanvasScaler*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetCanvasScaler;

// Function LGUI.UIItem.GetColor
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetColor final
{
public:
	struct FColor                                 ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetColor;

// Function LGUI.UIItem.GetDepth
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetDepth final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetDepth;

// Function LGUI.UIItem.GetDisplayName
// 0x0010 (0x0010 - 0x0000)
struct UIItem_GetDisplayName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetDisplayName;

// Function LGUI.UIItem.GetFlattenHierarchyIndex
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetFlattenHierarchyIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetFlattenHierarchyIndex;

// Function LGUI.UIItem.GetHeight
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetHeight;

// Function LGUI.UIItem.GetHierarchyIndex
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetHierarchyIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetHierarchyIndex;

// Function LGUI.UIItem.GetInheritAlpha
// 0x0001 (0x0001 - 0x0000)
struct UIItem_GetInheritAlpha final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetInheritAlpha;

// Function LGUI.UIItem.GetLocalSpaceBottom
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetLocalSpaceBottom final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetLocalSpaceBottom;

// Function LGUI.UIItem.GetLocalSpaceCenter
// 0x0008 (0x0008 - 0x0000)
struct UIItem_GetLocalSpaceCenter final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetLocalSpaceCenter;

// Function LGUI.UIItem.GetLocalSpaceLeft
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetLocalSpaceLeft final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetLocalSpaceLeft;

// Function LGUI.UIItem.GetLocalSpaceLeftBottomPoint
// 0x0008 (0x0008 - 0x0000)
struct UIItem_GetLocalSpaceLeftBottomPoint final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetLocalSpaceLeftBottomPoint;

// Function LGUI.UIItem.GetLocalSpaceRight
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetLocalSpaceRight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetLocalSpaceRight;

// Function LGUI.UIItem.GetLocalSpaceRightTopPoint
// 0x0008 (0x0008 - 0x0000)
struct UIItem_GetLocalSpaceRightTopPoint final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetLocalSpaceRightTopPoint;

// Function LGUI.UIItem.GetLocalSpaceTop
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetLocalSpaceTop final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetLocalSpaceTop;

// Function LGUI.UIItem.GetPivot
// 0x0008 (0x0008 - 0x0000)
struct UIItem_GetPivot final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetPivot;

// Function LGUI.UIItem.GetRootCanvas
// 0x0008 (0x0008 - 0x0000)
struct UIItem_GetRootCanvas final
{
public:
	class ULGUICanvas*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetRootCanvas;

// Function LGUI.UIItem.GetStretchBottom
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetStretchBottom final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetStretchBottom;

// Function LGUI.UIItem.GetStretchLeft
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetStretchLeft final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetStretchLeft;

// Function LGUI.UIItem.GetStretchRight
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetStretchRight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetStretchRight;

// Function LGUI.UIItem.GetStretchTop
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetStretchTop final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetStretchTop;

// Function LGUI.UIItem.GetTraceChannel
// 0x0001 (0x0001 - 0x0000)
struct UIItem_GetTraceChannel final
{
public:
	ETraceTypeQuery                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetTraceChannel;

// Function LGUI.UIItem.GetUIItemType
// 0x0001 (0x0001 - 0x0000)
struct UIItem_GetUIItemType final
{
public:
	EUIItemType                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetUIItemType;

// Function LGUI.UIItem.GetWidget
// 0x0054 (0x0054 - 0x0000)
struct UIItem_GetWidget final
{
public:
	struct FUIWidget                              ReturnValue;                                       // 0x0000(0x0054)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetWidget;

// Function LGUI.UIItem.GetWidth
// 0x0004 (0x0004 - 0x0000)
struct UIItem_GetWidth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_GetWidth;

// Function LGUI.UIItem.IsBubbleUpToParent
// 0x0001 (0x0001 - 0x0000)
struct UIItem_IsBubbleUpToParent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_IsBubbleUpToParent;

// Function LGUI.UIItem.IsRaycastTarget
// 0x0001 (0x0001 - 0x0000)
struct UIItem_IsRaycastTarget final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_IsRaycastTarget;

// Function LGUI.UIItem.IsUIActiveInHierarchy
// 0x0001 (0x0001 - 0x0000)
struct UIItem_IsUIActiveInHierarchy final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIItem_IsUIActiveInHierarchy;

// Function LGUI.UIItem.IsUIActiveSelf
// 0x0001 (0x0001 - 0x0000)
struct UIItem_IsUIActiveSelf final
{
