#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LGUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Enum LGUI.EButtonAudioStateTransferType
// NumValues: 0x0007
enum class EButtonAudioStateTransferType : uint8
{
	None                                     = 0,
	NormalToHighLight                        = 1,
	HighlightToNormal                        = 2,
	HighLightToPress                         = 3,
	PressToRelease                           = 4,
	DisabledPress                            = 5,
	EButtonAudioStateTransferType_MAX        = 6,
};

// Enum LGUI.EToggleState
// NumValues: 0x0004
enum class EToggleState : uint8
{
	ETT_UnChecked                            = 0,
	ETT_Checked                              = 1,
	ETT_UnDetermined                         = 2,
	ETT_MAX                                  = 3,
};

// Enum LGUI.EToggleAudioTransitionState
// NumValues: 0x0007
enum class EToggleAudioTransitionState : uint8
{
	ETT_None                                 = 0,
	ETT_NormalToHighLight                    = 1,
	ETT_HighlightedPress                     = 2,
	ETT_UncheckedClick                       = 3,
	ETT_CheckedClick                         = 4,
	ETT_DisabledPress                        = 5,
	ETT_MAX                                  = 6,
};

// Enum LGUI.ELGUIPointerInputType
// NumValues: 0x0004
enum class ELGUIPointerInputType : uint8
{
	Pointer                                  = 0,
	Navigation                               = 1,
	None                                     = 2,
	ELGUIPointerInputType_MAX                = 3,
};

// Enum LGUI.ELGUINavigationDirection
// NumValues: 0x0008
enum class ELGUINavigationDirection : uint8
{
	None                                     = 0,
	Left                                     = 1,
	Right                                    = 2,
	Up                                       = 3,
	Down                                     = 4,
	Next                                     = 5,
	Prev                                     = 6,
	ELGUINavigationDirection_MAX             = 7,
};

// Enum LGUI.NavigationComponentState
// NumValues: 0x0005
enum class ENavigationComponentState : uint8
{
	Select                                   = 0,
	NoSelect                                 = 1,
	Hide                                     = 2,
	Show                                     = 3,
	NavigationComponentState_MAX             = 4,
};

// Enum LGUI.UINavigationGroupMode
// NumValues: 0x0006
enum class EUINavigationGroupMode : uint8
{
	Awake                                    = 0,
	Destroy                                  = 1,
	Active                                   = 2,
	Hide                                     = 3,
	Navigation                               = 4,
	UINavigationGroupMode_MAX                = 5,
};

// Enum LGUI.EInputKeyType
// NumValues: 0x0005
enum class EInputKeyType : uint8
{
	None                                     = 0,
	KeyboardOrMouse                          = 1,
	Gamepad                                  = 2,
	Touch                                    = 3,
	EInputKeyType_MAX                        = 4,
};

// Enum LGUI.ESceneComponentRayDirection
// NumValues: 0x0007
enum class ESceneComponentRayDirection : uint8
{
	PositiveX                                = 0,
	NagtiveX                                 = 1,
	PositiveY                                = 2,
	NagtiveY                                 = 3,
	PositiveZ                                = 4,
	NagtiveZ                                 = 5,
	ESceneComponentRayDirection_MAX          = 6,
};

// Enum LGUI.EUIRaycastSortType
// NumValues: 0x0003
enum class EUIRaycastSortType : uint8
{
	DependOnUIDepth                          = 0,
	DependOnDistance                         = 1,
	EUIRaycastSortType_MAX                   = 2,
};

// Enum LGUI.EMouseButtonType
// NumValues: 0x000D
enum class EMouseButtonType : uint8
{
	Left                                     = 0,
	Middle                                   = 1,
	Right                                    = 2,
	UserDefined1                             = 3,
	UserDefined2                             = 4,
	UserDefined3                             = 5,
	UserDefined4                             = 6,
	UserDefined5                             = 7,
	UserDefined6                             = 8,
	UserDefined7                             = 9,
	UserDefined8                             = 10,
	NavigationChange                         = 11,
	EMouseButtonType_MAX                     = 12,
};

// Enum LGUI.EPointerEventType
// NumValues: 0x0011
enum class EPointerEventType : uint8
{
	Click                                    = 0,
	Enter                                    = 1,
	Exit                                     = 2,
	Down                                     = 3,
	Up                                       = 4,
	BeginDrag                                = 5,
	Drag                                     = 6,
	EndDrag                                  = 7,
	Scroll                                   = 8,
	DragEnter_DEPRECATED                     = 9,
	DragExit_DEPRECATED                      = 10,
	DragDrop                                 = 11,
	Select                                   = 12,
	Deselect                                 = 13,
	Navigate                                 = 14,
	Simulation                               = 15,
	EPointerEventType_MAX                    = 16,
};

// Enum LGUI.ELGUIEventFireType
// NumValues: 0x0004
enum class ELGUIEventFireType : uint8
{
	TargetActorAndAllItsComponents           = 0,
	OnlyTargetComponent                      = 1,
	OnlyTargetActor                          = 2,
	ELGUIEventFireType_MAX                   = 3,
};

// Enum LGUI.ELGUICanvasOverrideParameters
// NumValues: 0x0009
enum class ELGUICanvasOverrideParameters : uint8
{
	DefaltMaterials                          = 0,
	PixelPerfect                             = 1,
	DynamicPixelsPerUnit                     = 2,
	ClipType                                 = 3,
	AdditionalShaderChannels                 = 4,
	OnlyOwnerSee                             = 5,
	OwnerNoSee                               = 6,
	OverrideDisable                          = 7,
	ELGUICanvasOverrideParameters_MAX        = 8,
};

// Enum LGUI.ELGUICanvasAdditionalChannelType
// NumValues: 0x0009
enum class ELGUICanvasAdditionalChannelType : uint8
{
	Normal                                   = 0,
	Tangent                                  = 1,
	UV1                                      = 2,
	UV2                                      = 3,
	UV3                                      = 4,
	UV4                                      = 5,
	UV5                                      = 6,
	UV6                                      = 7,
	ELGUICanvasAdditionalChannelType_MAX     = 8,
};

// Enum LGUI.ELGUICanvasClipType
// NumValues: 0x0004
enum class ELGUICanvasClipType : uint8
{
	None                                     = 0,
	Rect                                     = 1,
	Texture                                  = 2,
	ELGUICanvasClipType_MAX                  = 3,
};

// Enum LGUI.ELGUIRenderMode
// NumValues: 0x0003
enum class ELGUIRenderMode : uint8
{
	ScreenSpaceOverlay                       = 0,
	WorldSpace                               = 1,
	ELGUIRenderMode_MAX                      = 2,
};

// Enum LGUI.LGUIScreenMatchMode
// NumValues: 0x0004
enum class ELGUIScreenMatchMode : uint8
{
	MatchWidthOrHeight                       = 0,
	Expand                                   = 1,
	Shrink                                   = 2,
	LGUIScreenMatchMode_MAX                  = 3,
};

// Enum LGUI.LGUIScaleMode
// NumValues: 0x0003
enum class ELGUIScaleMode : uint8
{
	ConstantPixelSize                        = 0,
	ScaleWithScreenSize                      = 1,
	LGUIScaleMode_MAX                        = 2,
};

// Enum LGUI.LGUIDrawableEventParameterType
// NumValues: 0x001A
enum class ELGUIDrawableEventParameterType : uint8
{
	None                                     = 0,
	Empty                                    = 1,
	Bool                                     = 2,
	Float                                    = 3,
	Double                                   = 4,
	Int8                                     = 5,
	UInt8                                    = 6,
	Int16                                    = 7,
	UInt16                                   = 8,
	Int32                                    = 9,
	UInt32                                   = 10,
	Int64                                    = 11,
	UInt64                                   = 12,
	Vector2                                  = 13,
	Vector3                                  = 14,
	Vector4                                  = 15,
	Color                                    = 16,
	LinearColor                              = 17,
	Quaternion                               = 18,
	String                                   = 19,
	Object                                   = 20,
	Actor                                    = 21,
	PointerEvent                             = 22,
	Class                                    = 23,
	Rotator                                  = 24,
	LGUIDrawableEventParameterType_MAX       = 25,
};

// Enum LGUI.Culture
// NumValues: 0x0014
enum class ECulture : uint8
{
	en                                       = 0,
	fr                                       = 1,
	it                                       = 2,
	de                                       = 3,
	es                                       = 4,
	es_419                                   = 5,
	ru                                       = 6,
	pl                                       = 7,
	ar                                       = 8,
	ko                                       = 9,
	ja                                       = 10,
	zh_Hans                                  = 11,
	zh_Hant                                  = 12,
	tr                                       = 13,
	pt                                       = 14,
	pt_BR                                    = 15,
	id                                       = 16,
	vi                                       = 17,
	th                                       = 18,
	Culture_MAX                              = 19,
};

// Enum LGUI.ELGUIDynamicFontDataType
// NumValues: 0x0003
enum class ELGUIDynamicFontDataType : uint8
{
	CustomFontFile                           = 0,
	UnrealFont                               = 1,
	ELGUIDynamicFontDataType_MAX             = 2,
};

// Enum LGUI.EPrefabVersion
// NumValues: 0x0007
enum class EPrefabVersion : uint8
{
	EPV_NoneVersion                          = 0,
	EPV_BasicVersion                         = 1,
	EPV_NestPrefab                           = 2,
	EPV_OtherPrefabActorReference            = 3,
	EPV_LastVersionPlusOne                   = 4,
	EPV_LastVersion                          = 3,
	EPV_MAX                                  = 5,
};

// Enum LGUI.ELGUIScreenSpaceUIAntiAliasing
// NumValues: 0x0006
enum class ELGUIScreenSpaceUIAntiAliasing : uint8
{
	Hidden                                   = 0,
	Disabled                                 = 1,
	SampleCount_2x                           = 2,
	SampleCount_4x                           = 4,
	SampleCount_8x                           = 8,
	ELGUIScreenSpaceUIAntiAliasing_MAX       = 9,
};

// Enum LGUI.ELGUIAtlasPackingType
// NumValues: 0x0003
enum class ELGUIAtlasPackingType : uint8
{
	Dynamic                                  = 0,
	Static                                   = 1,
	ELGUIAtlasPackingType_MAX                = 2,
};

// Enum LGUI.ELGUIAtlasTextureSizeType
// NumValues: 0x0007
enum class ELGUIAtlasTextureSizeType : uint8
{
	SIZE_256x256                             = 0,
	SIZE_512x512                             = 1,
	SIZE_1024x1024                           = 2,
	SIZE_2048x2048                           = 3,
	SIZE_4096x4096                           = 4,
	SIZE_8192x8192                           = 5,
	SIZE_MAX_0                               = 6,
};

// Enum LGUI.UITextOverflowType
// NumValues: 0x0007
enum class EUITextOverflowType : uint8
{
	HorizontalOverflow                       = 0,
	VerticalOverflow                         = 1,
	ClampContent                             = 2,
	HorizontalMinMax                         = 3,
	MaxHeightWidth                           = 4,
	BestFitClamp                             = 5,
	UITextOverflowType_MAX                   = 6,
};

// Enum LGUI.UITextFontStyle
// NumValues: 0x0005
enum class EUITextFontStyle : uint8
{
	None                                     = 0,
	Bold                                     = 1,
	Italic                                   = 2,
	BoldAndItalic                            = 3,
	UITextFontStyle_MAX                      = 4,
};

// Enum LGUI.UITextParagraphVerticalAlign
// NumValues: 0x0004
enum class EUITextParagraphVerticalAlign : uint8
{
	Top                                      = 0,
	Middle                                   = 1,
	Bottom                                   = 2,
	UITextParagraphVerticalAlign_MAX         = 3,
};

// Enum LGUI.UITextParagraphHorizontalAlign
// NumValues: 0x0004
enum class EUITextParagraphHorizontalAlign : uint8
{
	Left                                     = 0,
	Center                                   = 1,
	Right                                    = 2,
	UITextParagraphHorizontalAlign_MAX       = 3,
};

// Enum LGUI.ELGUIWorldSpaceInteractionSource
// NumValues: 0x0004
enum class ELGUIWorldSpaceInteractionSource : uint8
{
	World                                    = 0,
	Mouse                                    = 1,
	CenterScreen                             = 2,
	ELGUIWorldSpaceInteractionSource_MAX     = 3,
};

// Enum LGUI.ESequenceLoadState
// NumValues: 0x0004
enum class ESequenceLoadState : uint8
{
	SLS_None                                 = 0,
	SLS_Loading                              = 1,
	SLS_Loaded                               = 2,
	SLS_MAX                                  = 3,
};

// Enum LGUI.EUI2DLineRenderer_EndType
// NumValues: 0x0004
enum class EUI2DLineRenderer_EndType : uint8
{
	None                                     = 0,
	Cap                                      = 1,
	ConnectStartAndEnd                       = 2,
	EUI2DLineRenderer_MAX                    = 3,
};

// Enum LGUI.UIArtTextHorizontalAlign
// NumValues: 0x0004
enum class EUIArtTextHorizontalAlign : uint8
{
	Left                                     = 0,
	Center                                   = 1,
	Right                                    = 2,
	UIArtTextHorizontalAlign_MAX             = 3,
};

// Enum LGUI.EUIRenderableType
// NumValues: 0x0008
enum class EUIRenderableType : uint8
{
	None                                     = 0,
	UIBatchGeometryRenderable                = 1,
	UIPostProcessRenderable                  = 2,
	UIDirectMeshRenderable                   = 3,
	UINiagaraRenderable                      = 4,
	UISpineRenderable                        = 5,
	UIDynamicBathMesh                        = 6,
	EUIRenderableType_MAX                    = 7,
};

// Enum LGUI.EComboBoxPosition
// NumValues: 0x0004
enum class EComboBoxPosition : uint8
{
	Top                                      = 0,
	Middle                                   = 1,
	Bottom                                   = 2,
	EComboBoxPosition_MAX                    = 3,
};

// Enum LGUI.EUICustomDepthStencilMaskSourceType
// NumValues: 0x0003
enum class EUICustomDepthStencilMaskSourceType : uint8
{
	CustomDepth                              = 0,
	CustomStencil                            = 1,
	EUICustomDepthStencilMaskSourceType_MAX  = 2,
};

// Enum LGUI.EUIDropdownHorizontalPosition
// NumValues: 0x0005
enum class EUIDropdownHorizontalPosition : uint8
{
	Left                                     = 0,
	Center                                   = 1,
	Right                                    = 2,
	Automatic                                = 3,
	EUIDropdownHorizontalPosition_MAX        = 4,
};

// Enum LGUI.EUIDropdownVerticalPosition
// NumValues: 0x0005
enum class EUIDropdownVerticalPosition : uint8
{
	Bottom                                   = 0,
	Middle                                   = 1,
	Top                                      = 2,
	Automatic                                = 3,
	EUIDropdownVerticalPosition_MAX          = 4,
};

// Enum LGUI.EScrollItemState
// NumValues: 0x0004
enum class EScrollItemState : uint8
{
	DeActive                                 = 0,
	Updating                                 = 1,
	Completed                                = 2,
	EScrollItemState_MAX                     = 3,
};

// Enum LGUI.EUIEffectGradientColorDirection
// NumValues: 0x0006
enum class EUIEffectGradientColorDirection : uint8
{
	BottomToTop                              = 0,
	TopToBottom                              = 1,
	LeftToRight                              = 2,
	RightToLeft                              = 3,
	FourCornor                               = 4,
	EUIEffectGradientColorDirection_MAX      = 5,
};

// Enum LGUI.EToggleStateSwitch
// NumValues: 0x0007
enum class EToggleStateSwitch : uint8
{
	None                                     = 0,
	CheckedToUnChecked                       = 1,
	UnCheckedToChecked                       = 2,
	AnyToUnDetermined                        = 3,
	UnDeterminedToChecked                    = 4,
	UnDeterminedToUnChecked                  = 5,
	EToggleStateSwitch_MAX                   = 6,
};

// Enum LGUI.EToggleAnimationType
// NumValues: 0x0014
enum class EToggleAnimationType : uint8
{
	ETT_None                                 = 0,
	ETT_UnCheckedHover                       = 1,
	ETT_UnCheckedClick                       = 2,
	ETT_UnCheckedExit                        = 3,
	ETT_CheckedHover                         = 4,
	ETT_CheckedClick                         = 5,
	ETT_CheckedExit                          = 6,
	ETT_UnDeterminedHover                    = 7,
	ETT_UnDeterminedClick                    = 8,
	ETT_UnDeterminedExit                     = 9,
	ETT_SwitchToUnChecked                    = 10,
	ETT_SwitchToChecked                      = 11,
	ETT_AfterCheckedLoop                     = 12,
	ETT_SwitchToUndetermined                 = 13,
	ETT_HoverOtherOnChecked                  = 14,
	ETT_ExitHoverOtherOnChecked              = 15,
	ETT_CheckedDown                          = 16,
	ETT_UnCheckedDown                        = 17,
	ETT_UnDeterminedDown                     = 18,
	ETT_MAX                                  = 19,
};

// Enum LGUI.EToggleChangeStateResult
// NumValues: 0x0004
enum class EToggleChangeStateResult : uint8
{
	ECS_Success                              = 0,
	ECS_FailBySameResult                     = 1,
	ECS_FailByCanExecuteChange               = 2,
	ECS_MAX                                  = 3,
};

// Enum LGUI.EToggleStateInAnimation
// NumValues: 0x0006
enum class EToggleStateInAnimation : uint8
{
	None                                     = 0,
	UnChecked                                = 1,
	Checked                                  = 2,
	UnDetermined                             = 3,
	UnChecked_RelativeToSwitch               = 4,
	EToggleStateInAnimation_MAX              = 5,
};

// Enum LGUI.EToggleTransitionState
// NumValues: 0x000A
enum class EToggleTransitionState : uint8
{
	ETT_UnCheckedUnHover                     = 0,
	ETT_UnCheckedHover                       = 1,
	ETT_UnCheckedPressed                     = 2,
	ETT_CheckedUnHover                       = 3,
	ETT_CheckedHover                         = 4,
	ETT_CheckedPressed                       = 5,
	ETT_UnDeterminedUnHover                  = 6,
	ETT_UnDeterminedHover                    = 7,
	ETT_UnDeterminedPressed                  = 8,
	ETT_MAX                                  = 9,
};

// Enum LGUI.ESpriteTransitionType
// NumValues: 0x0003
enum class ESpriteTransitionType : uint8
{
	ESTT_ColorOnly                           = 0,
	ESTT_ColorAndSprite                      = 1,
	ESTT_MAX                                 = 2,
};

// Enum LGUI.ETextureTransitionType
// NumValues: 0x0003
enum class ETextureTransitionType : uint8
{
	ESTT_ColorOnly                           = 0,
	ESTT_ColorAndTexture                     = 1,
	ESTT_MAX                                 = 2,
};

// Enum LGUI.EFlyoutMenuHorizontalAlignment
// NumValues: 0x0004
enum class EFlyoutMenuHorizontalAlignment : uint8
{
	Left                                     = 0,
	Center                                   = 1,
	Right                                    = 2,
	EFlyoutMenuHorizontalAlignment_MAX       = 3,
};

// Enum LGUI.EFlyoutMenuVerticalPosition
// NumValues: 0x0003
enum class EFlyoutMenuVerticalPosition : uint8
{
	Top                                      = 0,
	Bottom                                   = 1,
	EFlyoutMenuVerticalPosition_MAX          = 2,
};

// Enum LGUI.EGridFitType
// NumValues: 0x0006
enum class EGridFitType : uint8
{
	EFT_None                                 = 0,
	EFT_HeightWidthFit                       = 1,
	EFT_HeightFit                            = 2,
	EFT_WidthFit                             = 3,
	EFT_FillByLast                           = 4,
	EFT_MAX                                  = 5,
};

// Enum LGUI.EUIGridLayoutStartCorner
// NumValues: 0x0005
enum class EUIGridLayoutStartCorner : uint8
{
	UpperLeft                                = 0,
	UpperRight                               = 1,
	LowerLeft                                = 2,
	LowerRight                               = 3,
	EUIGridLayoutStartCorner_MAX             = 4,
};

// Enum LGUI.EUIGuideMarkType
// NumValues: 0x0005
enum class EUIGuideMarkType : uint8
{
	Parent                                   = 0,
	Route                                    = 1,
	Child                                    = 2,
	ChildWithoutRoute                        = 3,
	EUIGuideMarkType_MAX                     = 4,
};

// Enum LGUI.UiItemCornerType
// NumValues: 0x0005
enum class EUiItemCornerType : uint8
{
	BottomLeft                               = 0,
	TopLeft                                  = 1,
	TopRight                                 = 2,
	BottomRight                              = 3,
	UiItemCornerType_MAX                     = 4,
};

// Enum LGUI.UIItemType
// NumValues: 0x0004
enum class EUIItemType : uint8
{
	None                                     = 0,
	UIItem                                   = 1,
	UIBatchGeometryRenderable                = 2,
	UIItemType_MAX                           = 3,
};

// Enum LGUI.ELGUILayoutAlignmentType
// NumValues: 0x000A
enum class ELGUILayoutAlignmentType : uint8
{
	UpperLeft                                = 0,
	UpperCenter                              = 1,
	UpperRight                               = 2,
	MiddleLeft                               = 3,
	MiddleCenter                             = 4,
	MiddleRight                              = 5,
	LowerLeft                                = 6,
	LowerCenter                              = 7,
	LowerRight                               = 8,
	ELGUILayoutAlignmentType_MAX             = 9,
};

// Enum LGUI.ELayoutElementType
// NumValues: 0x0007
enum class ELayoutElementType : uint8
{
	AutoSize                                 = 0,
	IgnoreLayout                             = 1,
	ConstantSize                             = 2,
	RatioSize                                = 3,
	IgnoreControlSize                        = 4,
	ControlTextMaxWidthHeight                = 5,
	ELayoutElementType_MAX                   = 6,
};

// Enum LGUI.EUILayoutChangePositionAnimationType
// NumValues: 0x0003
enum class EUILayoutChangePositionAnimationType : uint8
{
	Immediately                              = 0,
	EaseAnimation                            = 1,
	EUILayoutChangePositionAnimationType_MAX = 2,
};

// Enum LGUI.ELGUILayoutDirectionType
// NumValues: 0x0003
enum class ELGUILayoutDirectionType : uint8
{
	Vertical                                 = 0,
	Horizontal                               = 1,
	ELGUILayoutDirectionType_MAX             = 2,
};

// Enum LGUI.UINavigationPriorityMode
// NumValues: 0x0006
enum class EUINavigationPriorityMode : uint8
{
	Distance                                 = 0,
	Direction                                = 1,
	DistanceDirection                        = 2,
	DirectionAngle                           = 3,
	DistanceOnlySameScroll                   = 4,
	UINavigationPriorityMode_MAX             = 5,
};

// Enum LGUI.UINavigationWrapMode
// NumValues: 0x0004
enum class EUINavigationWrapMode : uint8
{
	None                                     = 0,
	Wrap                                     = 1,
	Next                                     = 2,
	UINavigationWrapMode_MAX                 = 3,
};

// Enum LGUI.UIPolygonUVType
// NumValues: 0x0004
enum class EUIPolygonUVType : uint8
{
	SpriteRect                               = 0,
	HeightCenter                             = 1,
	StretchSpriteHeight                      = 2,
	UIPolygonUVType_MAX                      = 3,
};

// Enum LGUI.ESafeZoneAdaptionStrategy
// NumValues: 0x0005
enum class ESafeZoneAdaptionStrategy : uint8
{
	ESZAS_NoPadding                          = 0,
	ESZAS_SettledPadding                     = 1,
	ESZAS_SymSettledPadding                  = 2,
	ESZAS_CustomPadding                      = 3,
	ESZAS_MAX                                = 4,
};

// Enum LGUI.UIScrollbarDirectionType
// NumValues: 0x0005
enum class EUIScrollbarDirectionType : uint8
{
	LeftToRight                              = 0,
	RightToLeft                              = 1,
	BottomToTop                              = 2,
	TopToBottom                              = 3,
	UIScrollbarDirectionType_MAX             = 4,
};

// Enum LGUI.EOutOfBoundsType
// NumValues: 0x0004
enum class EOutOfBoundsType : uint8
{
	NotOut                                   = 0,
	OutOfBegin                               = 1,
	OutOfEnd                                 = 2,
	EOutOfBoundsType_MAX                     = 3,
};

// Enum LGUI.EScrollViewScrollbarVisibility
// NumValues: 0x0004
enum class EScrollViewScrollbarVisibility : uint8
{
	Permanent                                = 0,
	AutoHide                                 = 1,
	AutoHideAndExpandViewport                = 2,
	EScrollViewScrollbarVisibility_MAX       = 3,
};

// Enum LGUI.EStateTransferType
// NumValues: 0x000A
enum class EStateTransferType : uint8
{
	ESTTT_None                               = 0,
	ESTTT_NormalToHighLight                  = 1,
	ESTTT_HighlightToNormal                  = 2,
	ESTTT_HighLightToPress                   = 3,
	ESTTT_PressToHighLight                   = 4,
	ESTTT_HighLightToSelect                  = 5,
	ESTTT_SelectToNormal                     = 6,
	ESTTT_PressToNormal                      = 7,
	ESTTT_NormalToPress                      = 8,
	ESTTT_MAX                                = 9,
};

// Enum LGUI.EAnimationPlayMode
// NumValues: 0x0004
enum class EAnimationPlayMode : uint8
{
	EMOM_None                                = 0,
	EMOM_ReverseAnimation                    = 1,
	EMOM_CustomAnimation                     = 2,
	EMOM_MAX                                 = 3,
};

// Enum LGUI.EUISelectableInteractionState
// NumValues: 0x0006
enum class EUISelectableInteractionState : uint8
{
	None                                     = 0,
	PointerEnter                             = 1,
	PointerExit                              = 2,
	PointerDown                              = 3,
	PointerUp                                = 4,
	EUISelectableInteractionState_MAX        = 5,
};

// Enum LGUI.EUISelectableNavigationMode
// NumValues: 0x0004
enum class EUISelectableNavigationMode : uint8
{
	None                                     = 0,
	Auto                                     = 1,
	Explicit                                 = 2,
	EUISelectableNavigationMode_MAX          = 3,
};

// Enum LGUI.EUISelectableSelectionState
// NumValues: 0x0006
enum class EUISelectableSelectionState : uint8
{
	Normal                                   = 0,
	Highlighted                              = 1,
	Pressed                                  = 2,
	Disabled                                 = 3,
	Selected                                 = 4,
	EUISelectableSelectionState_MAX          = 5,
};

// Enum LGUI.UISelectableTransitionType
// NumValues: 0x0006
enum class EUISelectableTransitionType : uint8
{
	None                                     = 0,
	ColorTint                                = 1,
	SpriteSwap                               = 2,
	TransitionComponent                      = 3,
	ChangeActor                              = 4,
	UISelectableTransitionType_MAX           = 5,
};

// Enum LGUI.EStateTransitionType
// NumValues: 0x0003
enum class EStateTransitionType : uint8
{
	ImmediateSet                             = 0,
	Gradually                                = 1,
	EStateTransitionType_MAX                 = 2,
};

// Enum LGUI.EUISizeControlByAspectRatioMode
// NumValues: 0x0007
enum class EUISizeControlByAspectRatioMode : uint8
{
	None                                     = 0,
	WidthControlHeight                       = 1,
	HeightControlWidth                       = 2,
	FitInParent                              = 3,
	EnvelopeParent                           = 4,
	EnvelopeParentMin                        = 5,
	EUISizeControlByAspectRatioMode_MAX      = 6,
};

// Enum LGUI.UISliderDirectionType
// NumValues: 0x0005
enum class EUISliderDirectionType : uint8
{
	LeftToRight                              = 0,
	RightToLeft                              = 1,
	BottomToTop                              = 2,
	TopToBottom                              = 3,
	UISliderDirectionType_MAX                = 4,
};

// Enum LGUI.UISpriteFillOriginType_Radial360
// NumValues: 0x0005
enum class EUISpriteFillOriginType_Radial360 : uint8
{
	Bottom                                   = 0,
	Right                                    = 1,
	Top                                      = 2,
	Left                                     = 3,
	UISpriteFillOriginType_MAX               = 4,
};

// Enum LGUI.UISpriteFillOriginType_Radial180
// NumValues: 0x0005
enum class EUISpriteFillOriginType_Radial180 : uint8
{
	Bottom                                   = 0,
	Left                                     = 1,
	Top                                      = 2,
	Right                                    = 3,
	UISpriteFillOriginType_MAX               = 4,
};

// Enum LGUI.UISpriteFillOriginType_Radial90
// NumValues: 0x0005
enum class EUISpriteFillOriginType_Radial90 : uint8
{
	BottomLeft                               = 0,
	TopLeft                                  = 1,
	TopRight                                 = 2,
	BottomRight                              = 3,
	UISpriteFillOriginType_MAX               = 4,
};

// Enum LGUI.UISpriteFillMethod
// NumValues: 0x0006
enum class EUISpriteFillMethod : uint8
{
	Horizontal                               = 0,
	Vertical                                 = 1,
	Radial90                                 = 2,
	Radial180                                = 3,
	Radial360                                = 4,
	UISpriteFillMethod_MAX                   = 5,
};

// Enum LGUI.UISpriteType
// NumValues: 0x000B
enum class EUISpriteType : uint8
{
	Normal                                   = 0,
	Sliced                                   = 1,
	SlicedFrame                              = 2,
	Tiled                                    = 3,
	Filled                                   = 4,
	FilledSliced                             = 5,
	FilledSlicedFrame                        = 6,
	SliceEx                                  = 7,
	FillStartEnd                             = 8,
	FillStartEndEx                           = 9,
	UISpriteType_MAX                         = 10,
};

// Enum LGUI.UIStaticMeshVertexColorType
// NumValues: 0x0004
enum class EUIStaticMeshVertexColorType : uint8
{
	MultiplyWithUIColor                      = 0,
	ReplaceByUIColor                         = 1,
	NotAffectByUIColor                       = 2,
	UIStaticMeshVertexColorType_MAX          = 3,
};

// Enum LGUI.ELGUITextInputType
// NumValues: 0x0006
enum class ELGUITextInputType : uint8
{
	Standard                                 = 0,
	IntegerNumber                            = 1,
	DecimalNumber                            = 2,
	Password                                 = 3,
	CustomFunction                           = 4,
	ELGUITextInputType_MAX                   = 5,
};

// Enum LGUI.UITextureType
// NumValues: 0x0007
enum class EUITextureType : uint8
{
	Normal                                   = 0,
	Sliced                                   = 1,
	SlicedFrame                              = 2,
	Tiled                                    = 3,
	Filled                                   = 4,
	SlicedEx                                 = 5,
	UITextureType_MAX                        = 6,
};

// Enum LGUI.UIToggleTransitionType
// NumValues: 0x0006
enum class EUIToggleTransitionType : uint8
{
	None                                     = 0,
	Fade                                     = 1,
	ColorTint                                = 2,
	TransitionComponent                      = 3,
	ActiveActor                              = 4,
	UIToggleTransitionType_MAX               = 5,
};

// Enum LGUI.UIAnchorVerticalAlign
// NumValues: 0x0006
enum class EUIAnchorVerticalAlign : uint8
{
	None                                     = 0,
	Top                                      = 1,
	Middle                                   = 2,
	Bottom                                   = 3,
	Stretch                                  = 4,
	UIAnchorVerticalAlign_MAX                = 5,
};

// Enum LGUI.UIAnchorHorizontalAlign
// NumValues: 0x0006
enum class EUIAnchorHorizontalAlign : uint8
{
	None                                     = 0,
	Left                                     = 1,
	Center                                   = 2,
	Right                                    = 3,
	Stretch                                  = 4,
	UIAnchorHorizontalAlign_MAX              = 5,
};

// ScriptStruct LGUI.RenderableSlot
// 0x0020 (0x0020 - 0x0000)
struct FRenderableSlot final
{
public:
	class UUIBatchGeometryRenderable*             Renderable;                                        // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x18];                                       // 0x0008(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRenderableSlot;

// ScriptStruct LGUI.UIArtTextInfo
// 0x0018 (0x0018 - 0x0000)
struct FUIArtTextInfo final
{
public:
	class FString                                 Character;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULGUISpriteData_BaseObject*             SpriteData;                                        // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUIArtTextInfo;

// ScriptStruct LGUI.RenderableCollection
// 0x0010 (0x0010 - 0x0000)
struct FRenderableCollection final
{
public:
	TArray<struct FRenderableSlot>                RenderableSlots;                                   // 0x0000(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRenderableCollection;

// ScriptStruct LGUI.LGUIAtlasData
// 0x0070 (0x0070 - 0x0000)
struct FLGUIAtlasData final
{
public:
	TArray<TWeakObjectPtr<class UUISpriteBase>>   renderSpriteArray;                                 // 0x0000(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class UTexture2D*                             atlasTexture;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x30];                                      // 0x0018(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULGUISpriteData*>                spriteDataArray;                                   // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIAtlasData;

// ScriptStruct LGUI.AudioPlayInfo
// 0x0048 (0x0048 - 0x0000)
struct FAudioPlayInfo final
{
public:
	struct FSoftObjectPath                        AkAudioEvent;                                      // 0x0000(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& eventName)> OnPostAudioEvent;                                // 0x0020(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAudioPlayInfo;

// ScriptStruct LGUI.LGUIMaterialArrayContainer
// 0x0010 (0x0010 - 0x0000)
struct FLGUIMaterialArrayContainer final
{
public:
	TArray<class UMaterialInstanceDynamic*>       MaterialList;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLGUIMaterialArrayContainer;

// ScriptStruct LGUI.LGUIDrawableEventData
// 0x0080 (0x0080 - 0x0000)
struct FLGUIDrawableEventData final
{
public:
	class AActor*                                 targetActor;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 componentClass;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   componentName;                                     // 0x0010(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   functionName;                                      // 0x001C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELGUIDrawableEventParameterType               ParamType;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 ParamBuffer;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UObject*                                ReferenceObject;                                   // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReferenceActor;                                    // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReferenceClass;                                    // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReferenceString;                                   // 0x0058(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseNativeParameter;                                // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFunction*                              CacheFunction;                                     // 0x0070(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                                CacheTarget;                                       // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FLGUIDrawableEventData;

// ScriptStruct LGUI.LGUIComponentReference
// 0x0028 (0x0028 - 0x0000)
struct FLGUIComponentReference final
{
public:
	TWeakObjectPtr<class AActor>                  targetActor;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UActorComponent>            targetComponentClass;                              // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   targetComonentName;                                // 0x0010(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UActorComponent>         componentInstance;                                 // 0x001C(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIComponentReference;

// ScriptStruct LGUI.RegisterRuntimeData
// 0x0020 (0x0020 - 0x0000)
struct FRegisterRuntimeData final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 TargetComponentClass;                              // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ComponentName;                                     // 0x0010(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRegisterRuntimeData;

// ScriptStruct LGUI.ComponentRegistryEditorData
// 0x0050 (0x0050 - 0x0000)
struct FComponentRegistryEditorData final
{
public:
	class FString                                 ExportName;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRegisterRuntimeData                   RuntimeCacheData;                                  // 0x0010(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ActorPath;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorType;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FComponentRegistryEditorData;

// ScriptStruct LGUI.RegisteredComponents
// 0x0010 (0x0010 - 0x0000)
struct FRegisteredComponents final
{
public:
	TArray<struct FComponentRegistryEditorData>   RegisteredData;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRegisteredComponents;

// ScriptStruct LGUI.SequenceInfo
// 0x0038 (0x0038 - 0x0000)
struct FSequenceInfo final
{
public:
	struct FSoftObjectPath                        LevelSequence;                                     // 0x0000(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAsHardRef;                                     // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ChildrenInteractiveDuringPlaying;                  // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BlockAllEventWhilePlaying;                         // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackSettings    PlaySetting;                                       // 0x0024(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSequenceInfo;

// ScriptStruct LGUI.UIItemInfo
// 0x0001 (0x0001 - 0x0000)
struct FUIItemInfo final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FUIItemInfo;

// ScriptStruct LGUI.LGUIDelegateHandleWrapper
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FLGUIDelegateHandleWrapper final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDelegateHandleWrapper;

// ScriptStruct LGUI.LGUIDrawableEvent
// 0x0018 (0x0018 - 0x0000)
struct FLGUIDrawableEvent
{
public:
	TArray<struct FLGUIDrawableEventData>         eventList;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	ELGUIDrawableEventParameterType               supportParameterType;                              // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent;

// ScriptStruct LGUI.LGUIDrawableEvent_Rotator
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Rotator final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Rotator;

// ScriptStruct LGUI.LGUIDrawableEvent_Class
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Class final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Class;

// ScriptStruct LGUI.LGUIDrawableEvent_PointerEvent
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_PointerEvent final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_PointerEvent;

// ScriptStruct LGUI.LGUIDrawableEvent_Actor
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Actor final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Actor;

// ScriptStruct LGUI.LGUIDrawableEvent_Object
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Object final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Object;

// ScriptStruct LGUI.LGUIDrawableEvent_String
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_String final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_String;

// ScriptStruct LGUI.LGUIDrawableEvent_Quaternion
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Quaternion final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Quaternion;

// ScriptStruct LGUI.LGUIDrawableEvent_LinearColor
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_LinearColor final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_LinearColor;

// ScriptStruct LGUI.LGUIDrawableEvent_Color
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Color final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Color;

// ScriptStruct LGUI.LGUIDrawableEvent_Vector4
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Vector4 final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Vector4;

// ScriptStruct LGUI.LGUIDrawableEvent_Vector3
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Vector3 final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Vector3;

// ScriptStruct LGUI.LGUIDrawableEvent_Vector2
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Vector2 final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Vector2;

// ScriptStruct LGUI.LGUIDrawableEvent_UInt64
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_UInt64 final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_UInt64;

// ScriptStruct LGUI.LGUIDrawableEvent_Int64
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Int64 final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Int64;

// ScriptStruct LGUI.LGUIDrawableEvent_UInt32
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_UInt32 final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_UInt32;

// ScriptStruct LGUI.LGUIDrawableEvent_Int32
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Int32 final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Int32;

// ScriptStruct LGUI.LGUIDrawableEvent_UInt16
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_UInt16 final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_UInt16;

// ScriptStruct LGUI.LGUIDrawableEvent_Int16
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Int16 final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Int16;

// ScriptStruct LGUI.LGUIDrawableEvent_UInt8
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_UInt8 final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_UInt8;

// ScriptStruct LGUI.LGUIDrawableEvent_Int8
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Int8 final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Int8;

// ScriptStruct LGUI.LGUIDrawableEvent_Double
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Double final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Double;

// ScriptStruct LGUI.LGUIDrawableEvent_Float
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Float final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Float;

// ScriptStruct LGUI.LGUIDrawableEvent_Bool
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Bool final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Bool;

// ScriptStruct LGUI.LGUIDrawableEvent_Empty
// 0x0018 (0x0030 - 0x0018)
struct FLGUIDrawableEvent_Empty final : public FLGUIDrawableEvent
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUIDrawableEvent_Empty;

// ScriptStruct LGUI.LGUISubFontData
// 0x0030 (0x0030 - 0x0000)
struct FLGUISubFontData final
{
public:
	class UFontFace*                              unrealFont;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInt32Range>                    CharacterRanges;                                   // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	ECulture                                      Cultures;                                          // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VerticalOffset;                                    // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLGUISubFontData;

// ScriptStruct LGUI.LGUICharData
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FLGUICharData final
{
public:
	uint16                                        width;                                             // 0x0000(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        height;                                            // 0x0002(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         xoffset;                                           // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         yoffset;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         xadvance;                                          // 0x000C(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         uv0X;                                              // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         uv0Y;                                              // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         uv3X;                                              // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         uv3Y;                                              // 0x001C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasRendered;                                      // 0x0020(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x1];                                       // 0x0021(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
