#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LGUI_BMFGenImporter

#include "Basic.hpp"

#include "LGUI_BMFGenImporter_structs.hpp"
#include "LGUI_structs.hpp"
#include "LGUI_classes.hpp"


namespace SDK
{

// Class LGUI_BMFGenImporter.LGUIBitmapFontGeneratorData
// 0x00B0 (0x0130 - 0x0080)
class ULGUIBitmapFontGeneratorData final : public ULGUIFontData_BaseObject
{
public:
	class FString                                 fntFileSourcePath;                                 // 0x0080(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ELGUIBitmapFontGeneratorTextureType           convertTextureType;                                // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 name;                                              // 0x0098(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        size;                                              // 0x00A8(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        lineHeight;                                        // 0x00AA(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        base;                                              // 0x00AC(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        scaleW;                                            // 0x00AE(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        scaleH;                                            // 0x00B0(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        charCount;                                         // 0x00B2(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             texture;                                           // 0x00B8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<uint16, struct FLGUICharData>            charDataMap;                                       // 0x00C0(0x0050)(Edit, EditConst, NativeAccessSpecifierPrivate)
	float                                         fixedVerticalOffset;                               // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         italicAngle;                                       // 0x0114(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         boldRatio;                                         // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class UUIText>>         renderTextArray;                                   // 0x0120(0x0010)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGUIBitmapFontGeneratorData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGUIBitmapFontGeneratorData")
	}
	static class ULGUIBitmapFontGeneratorData* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIBitmapFontGeneratorData>();
	}
};
DUMPER7_ASSERTS_ULGUIBitmapFontGeneratorData;

}

