#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LGUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "LGUI_structs.hpp"
#include "LTween_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Niagara_classes.hpp"
#include "InputCore_structs.hpp"
#include "KuroCurve_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class LGUI.LGUIBehaviour
// 0x0040 (0x0100 - 0x00C0)
class ULGUIBehaviour : public UActorComponent
{
public:
	bool                                          enable;                                            // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaTime)>              OnLateUpdate;                                      // 0x00C8(0x0028)(Edit, ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x4];                                       // 0x00F0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UUIItem>                 RootUIComp;                                        // 0x00F4(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AwakeBP();
	class AActor* InstantiateActor(class AActor* OriginObject, class USceneComponent* Parent);
	class AActor* InstantiatePrefab(class ULGUIPrefab* OriginObject, class USceneComponent* Parent);
	class AActor* InstantiatePrefabWithTransform(class ULGUIPrefab* OriginObject, class USceneComponent* Parent, const struct FVector& Location, const struct FRotator& Rotation, const struct FVector& Scale);
	void LateUpdateBP(float DeltaTime);
	void OnDestroyBP();
	void OnDisableBP();
	void OnEnableBP();
	void OnUIActiveInHierarchyBP(bool activeOrInactive);
	void OnUIAttachmentChangedBP();
	void OnUIChildAcitveInHierarchyBP(class UUIItem* child, bool ativeOrInactive);
	void OnUIChildAttachmentChangedBP(class UUIItem* child, bool attachOrDetach);
	void OnUIChildHierarchyIndexChangedBP(class UUIItem* child);
	void OnUIDimensionsChangedBP(bool positionChanged, bool sizeChanged);
	void OnUIInteractionStateChangedBP(bool interactableOrNot);
	void SetEnable(bool value);
	void StartBP();
	void UpdateBP(float DeltaTime);

	bool CheckRootUIComponent() const;
	bool GetEnable() const;
	bool GetIsActiveAndEnable() const;
	class UUIItem* GetRootComponent() const;
	class USceneComponent* GetRootSceneComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGUIBehaviour")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGUIBehaviour")
	}
	static class ULGUIBehaviour* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIBehaviour>();
	}
};
DUMPER7_ASSERTS_ULGUIBehaviour;

// Class LGUI.UILayoutElement
// 0x0018 (0x0118 - 0x0100)
class UUILayoutElement final : public ULGUIBehaviour
{
public:
	class UUILayoutBase*                          ParentLayout;                                      // 0x0100(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ELayoutElementType                            LayoutElementType;                                 // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConstantSize;                                      // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RatioSize;                                         // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetConstantSize(float value);
	void SetLayoutType(ELayoutElementType InType);
	void SetRatioSize(float value);

	float GetConstantSize() const;
	bool GetIgnoreLayout() const;
	ELayoutElementType GetLayoutType() const;
	float GetRatioSize() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UILayoutElement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UILayoutElement")
	}
	static class UUILayoutElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUILayoutElement>();
	}
};
DUMPER7_ASSERTS_UUILayoutElement;

// Class LGUI.LGUIPrefabActor
// 0x0008 (0x02B8 - 0x02B0)
class ALGUIPrefabActor final : public AActor
{
public:
	class ULGUIPrefabHelperComponent*             PrefabComponent;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGUIPrefabActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGUIPrefabActor")
	}
	static class ALGUIPrefabActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALGUIPrefabActor>();
	}
};
DUMPER7_ASSERTS_ALGUIPrefabActor;

// Class LGUI.GuideHookRegistry
// 0x0050 (0x0110 - 0x00C0)
class UGuideHookRegistry final : public UActorComponent
{
public:
	TMap<class FString, TWeakObjectPtr<class AActor>> GuideHookComponents;                           // 0x00C0(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GuideHookRegistry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GuideHookRegistry")
	}
	static class UGuideHookRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuideHookRegistry>();
	}
};
DUMPER7_ASSERTS_UGuideHookRegistry;

// Class LGUI.LGUIPrefabCheckerInterface
// 0x0000 (0x0000 - 0x0000)
class ILGUIPrefabCheckerInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGUIPrefabCheckerInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGUIPrefabCheckerInterface")
	}
	static class ILGUIPrefabCheckerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILGUIPrefabCheckerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ILGUIPrefabCheckerInterface;

// Class LGUI.KuroWorldMapUIParams
// 0x0020 (0x00E0 - 0x00C0)
class UKuroWorldMapUIParams final : public UActorComponent
{
public:
	int32                                         MarkMenuRectSize;                                  // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              FocusMark_AnchoredPosition;                        // 0x00C4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TweenTime;                                         // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   TweenTypeEase;                                     // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GamePadTweenTime;                                  // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GamePadMoveSpeed;                                  // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroWorldMapUIParams")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroWorldMapUIParams")
	}
	static class UKuroWorldMapUIParams* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroWorldMapUIParams>();
	}
};
DUMPER7_ASSERTS_UKuroWorldMapUIParams;

// Class LGUI.UIItem
// 0x0340 (0x0560 - 0x0220)
class UUIItem : public USceneComponent
{
public:
	uint8                                         Pad_218[0xD8];                                     // 0x0218(0x00D8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIWidget                              widget;                                            // 0x02F0(0x0054)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_344[0x1C];                                     // 0x0344(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIItem*>                        UIChildren;                                        // 0x0360(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          inheritAlpha;                                      // 0x0370(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInheritColor;                                     // 0x0371(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_372[0x2];                                      // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 Color;                                             // 0x0374(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Alpha;                                             // 0x0378(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Width;                                             // 0x037C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Height;                                            // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          useChangeColor;                                    // 0x0384(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 changeColor;                                       // 0x0388(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FSequenceInfo>     LevelSequences;                                    // 0x0390(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<struct FSoftObjectPath, struct FLGUILevelSequenceBindings> LevelSequenceBindings;           // 0x03E0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        HardRefAssets;                                     // 0x0430(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_440[0xC];                                      // 0x0440(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  RenderCanvasActor;                                 // 0x044C(0x0008)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_454[0x6D];                                     // 0x0454(0x006D)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsRenderAfterBlur;                                // 0x04C1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRenderBeforeBloom;                              // 0x04C2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRenderBeforeUpScale;                            // 0x04C3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRenderAsMask;                                   // 0x04C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReadMask;                                       // 0x04C5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C6[0x1];                                      // 0x04C6(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsUIActive;                                       // 0x04C7(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bClipOutOfViewport;                                // 0x04C8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         hierarchyIndex;                                    // 0x04D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         flattenHierarchyIndex;                             // 0x04D4(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AdditionalIndexDelta;                              // 0x04D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 displayName;                                       // 0x04E0(0x0010)(Edit, ZeroConstructor, EditConst, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRaycastTarget;                                    // 0x04F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBubbleUpToParent;                                 // 0x04F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETraceTypeQuery                               traceChannel;                                      // 0x04F2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4F3[0x65];                                     // 0x04F3(0x0065)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AUIBaseActor>            DebugCollisionLine;                                // 0x0558(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void GetAllAttachUIChildren(TArray<class UUIItem*>* OutArray);
	const struct FVector GetLGUISpaceAbsolutePosition();
	const struct FVector GetLGUISpaceAbsolutePositionByPivot(const struct FVector2D& Pivot);
	const struct FVector GetLGUISpaceCenterAbsolutePosition();
	bool GetOverlapWith(class UUIItem* UIItem);
	class UUIItem* GetParentAsUIItem();
	struct FVector2D GetPositionInScreen(bool bIsScaledByDPI);
	struct FVector2D GetPositionInScreenWithPivot(bool bIsScaledByDPI, const struct FVector2D& SpecifiedPivot);
	struct FVector2D GetPositionInViewPort(bool bIsScaledByDPI);
	struct FVector2D GetPositionInViewPortOld(bool bIsScaledByDPI);
	struct FVector2D GetPositionInViewportWithPivot(bool bIsScaledByDPI, const struct FVector2D& SpecifiedPivot);
	struct FVector2D GetPositionInViewportWithPivotNormalized(bool bIsScaledByDPI, const struct FVector2D& SpecifiedPivot);
	class ULGUICanvas* GetRenderCanvas();
	struct FVector GetUIWorldPosition();
	bool IsBoundOutOfScreen();
	bool IsRenderTargetUI();
	bool IsScreenSpaceOverlayUI();
	bool IsWorldSpaceUI();
	void PlayUIItemAlphaTween(float StartValue, float EndValue, float Duration);
	void PlayUIItemScaleTween(float StartValue, float EndValue, float Duration);
	void ReverseChildrenIndex();
	void SetAlpha(float newAlpha);
	void SetAnchorAlign(EUIAnchorHorizontalAlign HAlign, EUIAnchorVerticalAlign VAlign);
	void SetAnchorHAlign(EUIAnchorHorizontalAlign align);
	void SetAnchorOffset(const struct FVector2D& NewOffset);
	void SetAnchorOffsetX(float NewOffset);
	void SetAnchorOffsetY(float NewOffset);
	void SetAnchorVAlign(EUIAnchorVerticalAlign align);
	void SetAsFirstHierarchy();
	void SetAsLastHierarchy();
	void SetBubbleUpToParent(bool NewBool);
	void SetChangeColor(bool bUseChangeColor, const struct FColor& NewColor);
	void SetColor(const struct FColor& NewColor);
	void SetDepth(int32 depth, bool propagateToChildren);
	void SetDisplayName(const class FString& InName);
	void SetHeight(float NewHeight);
	void SetHierarchyIndex(int32 InInt);
	void SetHorizontalStretch(const struct FVector2D& newStretch);
	void SetIsUIActive(bool active);
	void SetLGUISpaceAbsolutePosition(const struct FVector& Pos);
	void SetPivot(const struct FVector2D& NewPivot);
	void SetPivot_Raw(const struct FVector2D& NewPivot, bool bAdjustLocation);
	void SetRaycastTarget(bool NewBool);
	void SetStretchBottom(float newBottom);
	void SetStretchLeft(float newLeft);
	void SetStretchRight(float newRight);
	void SetStretchTop(float newTop);
	void SetTraceChannel(ETraceTypeQuery InTraceChannel);
	void SetUIActive(bool bActive);
	void SetUIItemAlpha(float Value);
	void SetUIItemScale(const struct FVector& Value);
	void SetUIParent(class UUIItem* InParent, bool KeepWorldTransform);
	void SetUIRelativeLocation(const struct FVector& NewLocation);
	void SetUIRelativeRotation(const struct FRotator& NewRotation);
	void SetUIRelativeScale3D(const struct FVector& NewScale3D);
	void SetUIRenderAfterBlur(bool bAfterBlur);
	void SetUIRenderBeforeBloom(bool bBeforeBloom);
	void SetUIRenderBeforeUpScale(bool bBeforeUpScale);
	void SetUIWorldLocation(const struct FVector& NewLocation);
	void SetUIWorldRotation(const struct FRotator& NewRotation);
	void SetUIWorldScale(const struct FVector& NewScale);
	void SetVerticalStretch(const struct FVector2D& newStretch);
	void SetWidget(const struct FUIWidget& inWidget);
	void SetWidth(float NewWidth);

	float GetAlpha() const;
	EUIAnchorHorizontalAlign GetAnchorHAlign() const;
	struct FVector2D GetAnchorOffset() const;
	float GetAnchorOffsetX() const;
	float GetAnchorOffsetY() const;
	EUIAnchorVerticalAlign GetAnchorVAlign() const;
	class UUIItem* GetAttachUIChild(int32 index) const;
	const TArray<class UUIItem*> GetAttachUIChildren() const;
	float GetCalculatedParentAlpha() const;
	struct FVector GetCalculatedParentColor() const;
	class ULGUICanvasScaler* GetCanvasScaler() const;
	struct FColor GetColor() const;
	int32 GetDepth() const;
	class FString GetDisplayName() const;
	int32 GetFlattenHierarchyIndex() const;
	float GetHeight() const;
	int32 GetHierarchyIndex() const;
	bool GetInheritAlpha() const;
	float GetLocalSpaceBottom() const;
	struct FVector2D GetLocalSpaceCenter() const;
	float GetLocalSpaceLeft() const;
	struct FVector2D GetLocalSpaceLeftBottomPoint() const;
	float GetLocalSpaceRight() const;
	struct FVector2D GetLocalSpaceRightTopPoint() const;
	float GetLocalSpaceTop() const;
	struct FVector2D GetPivot() const;
	class ULGUICanvas* GetRootCanvas() const;
	float GetStretchBottom() const;
	float GetStretchLeft() const;
	float GetStretchRight() const;
	float GetStretchTop() const;
	ETraceTypeQuery GetTraceChannel() const;
	EUIItemType GetUIItemType() const;
	const struct FUIWidget GetWidget() const;
	float GetWidth() const;
	bool IsBubbleUpToParent() const;
	bool IsRaycastTarget() const;
	bool IsUIActiveInHierarchy() const;
	bool IsUIActiveSelf() const;
	bool IsUsedCustomMinMaxAnchor() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIItem")
	}
	static class UUIItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIItem>();
	}
};
DUMPER7_ASSERTS_UUIItem;

// Class LGUI.UIBaseRenderable
// 0x0050 (0x05B0 - 0x0560)
#pragma pack(push, 0x1)
class alignas(0x10) UUIBaseRenderable : public UUIItem
{
public:
	uint8                                         Pad_560[0x14];                                     // 0x0560(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BatchDepth;                                        // 0x0574(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LayerDepth;                                        // 0x0578(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExtraBatchDepth;                                   // 0x057C(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRenderAfterBlurPartial;                         // 0x0580(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_581[0x17];                                     // 0x0581(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsAlphaZeroClip;                                  // 0x0598(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_599[0x3];                                      // 0x0599(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AUI2DLineActor>          DebugBoundingBoxLine;                              // 0x059C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LogBatchDepthParents();
	void SetUIRenderAfterBlurPartial(bool bAfterBlurPartial);
	void TestAdjustSingleNode();

	EUIRenderableType GetUIRenderableType() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIBaseRenderable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIBaseRenderable")
	}
	static class UUIBaseRenderable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBaseRenderable>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UUIBaseRenderable;

// Class LGUI.UIBatchGeometryRenderable
// 0x01F0 (0x07A0 - 0x05B0)
class UUIBatchGeometryRenderable : public UUIBaseRenderable
{
public:
	uint8                                         Pad_5A8[0xE0];                                     // 0x05A8(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      CustomScalarParameterTMap;                         // 0x0688(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, class UTexture*>            CustomTextureParameterTMap;                        // 0x06D8(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FLinearColor>        CustomVectorParameterTMap;                         // 0x0728(0x0050)(NativeAccessSpecifierPublic)
	class UMaterialInterface*                     CustomUIMaterial;                                  // 0x0778(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSelfRender;                                     // 0x0780(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsGray;                                           // 0x0781(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsColorRevert;                                    // 0x0782(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRaycastComplex;                                   // 0x0783(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_784[0x4];                                      // 0x0784(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIDrawcallMesh*                        uiMesh;                                            // 0x0788(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               uiMaterial;                                        // 0x0790(0x0008)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_798[0x8];                                      // 0x0798(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearCustomMaterialParameterInMap();
	bool GetRaycastComplex();
	void SetCustomMaterialScalarParameter(class FName paramterName, float value);
	void SetCustomMaterialTextureParameter(class FName ParameterName, class UTexture* value);
	void SetCustomMaterialVectorParameter(class FName paramterName, const struct FLinearColor& Value);
	void SetCustomUIMaterial(class UMaterialInterface* inMat);
	void SetIsColorRevert(bool value);
	void SetIsGray(bool value);
	void SetIsSelfRender(bool value);
	void SetKuroRenderingMaterial(class UMaterialInstanceDynamic* inMat);
	void SetRaycastComplex(bool newValue);

	class UMaterialInterface* GetCustomUIMaterial() const;
	bool GetIsSelfRender() const;
	class UMaterialInterface* GetKuroRenderingMaterial() const;
	class UMaterialInstanceDynamic* GetMaterialInstanceDynamic() const;
	bool IsColorRevert() const;
	bool IsGray() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIBatchGeometryRenderable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIBatchGeometryRenderable")
	}
	static class UUIBatchGeometryRenderable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBatchGeometryRenderable>();
	}
};
DUMPER7_ASSERTS_UUIBatchGeometryRenderable;

// Class LGUI.UISpriteBase
// 0x0020 (0x07C0 - 0x07A0)
#pragma pack(push, 0x1)
class alignas(0x10) UUISpriteBase : public UUIBatchGeometryRenderable
{
public:
	class ULGUISpriteData_BaseObject*             sprite;                                            // 0x07A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNotUseDynamicSpriteAtlas;                         // 0x07A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7A9[0xF];                                      // 0x07A9(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetSizeFromSpriteData();
	void SetSprite(class ULGUISpriteData_BaseObject* newSprite, bool setSize);

	class ULGUISpriteData_BaseObject* GetSprite() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UISpriteBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UISpriteBase")
	}
	static class UUISpriteBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUISpriteBase>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UUISpriteBase;

// Class LGUI.UIPolygon
// 0x0020 (0x07E0 - 0x07C0)
class UUIPolygon final : public UUISpriteBase
{
public:
	bool                                          FullCycle;                                         // 0x07B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7B9[0x3];                                      // 0x07B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartAngle;                                        // 0x07BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndAngle;                                          // 0x07C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Sides;                                             // 0x07C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUIPolygonUVType                              UVType;                                            // 0x07C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C9[0x7];                                      // 0x07C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 VertexOffsetArray;                                 // 0x07D0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	class ULTweener* EndAngleTo(float endValue, float duration, float delay, ELTweenEase easeType);
	void SetEndAngle(float value);
	void SetSides(int32 value);
	void SetStartAngle(float value);
	void SetUVType(EUIPolygonUVType value);
	void SetVertexOffsetArray(const TArray<float>& value);
	class ULTweener* StartAngleTo(float endValue, float duration, float delay, ELTweenEase easeType);

	float GetEndAngle() const;
	int32 GetSides() const;
	float GetStartAngle() const;
	EUIPolygonUVType GetUVType() const;
	const TArray<float> GetVertexOffsetArray() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIPolygon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIPolygon")
	}
	static class UUIPolygon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIPolygon>();
	}
};
DUMPER7_ASSERTS_UUIPolygon;

// Class LGUI.PrefabActorHierarchyData
// 0x0000 (0x0030 - 0x0030)
class UPrefabActorHierarchyData final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabActorHierarchyData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabActorHierarchyData")
	}
	static class UPrefabActorHierarchyData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabActorHierarchyData>();
	}
};
DUMPER7_ASSERTS_UPrefabActorHierarchyData;

// Class LGUI.LGUIBaseRayEmitter
// 0x0030 (0x00F0 - 0x00C0)
class ULGUIBaseRayEmitter : public UActorComponent
{
public:
	float                                         clickThreshold;                                    // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          holdToDrag;                                        // 0x00C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         holdToDragTime;                                    // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x24];                                      // 0x00CC(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetClickThreshold();
	void GetInitialValue(float* OutClickThreshold, bool* OutHoldToDrag, float* OutHoldToDragTime);
	void SetClickThreshold(float value);
	void SetInitialValue(float InClickThreshold, bool InHoldToDrag, float InHoldToDragTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGUIBaseRayEmitter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGUIBaseRayEmitter")
	}
	static class ULGUIBaseRayEmitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIBaseRayEmitter>();
	}
};
DUMPER7_ASSERTS_ULGUIBaseRayEmitter;

// Class LGUI.LGUIPrefabHelperObject
// 0x0000 (0x0030 - 0x0030)
class ULGUIPrefabHelperObject final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGUIPrefabHelperObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGUIPrefabHelperObject")
	}
	static class ULGUIPrefabHelperObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIPrefabHelperObject>();
	}
};
DUMPER7_ASSERTS_ULGUIPrefabHelperObject;

// Class LGUI.LGUI_CenterScreenRayemitter
// 0x0008 (0x00F8 - 0x00F0)
class ULGUI_CenterScreenRayemitter final : public ULGUIBaseRayEmitter
{
public:
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGUI_CenterScreenRayemitter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGUI_CenterScreenRayemitter")
	}
	static class ULGUI_CenterScreenRayemitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUI_CenterScreenRayemitter>();
	}
};
DUMPER7_ASSERTS_ULGUI_CenterScreenRayemitter;

// Class LGUI.UIScrollViewComponent
// 0x0180 (0x0280 - 0x0100)
class UUIScrollViewComponent : public ULGUIBehaviour
{
public:
	uint8                                         Pad_100[0x20];                                     // 0x0100(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AUIBaseActor>            Content;                                           // 0x0120(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          Horizontal;                                        // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          Vertical;                                          // 0x0129(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScrollSensitivity;                                 // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          AllowEventBubbleUp;                                // 0x0130(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DecelerationRate;                                  // 0x0134(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELTweenEase                                   ScrollToEaseType;                                  // 0x0138(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScrollToDuration;                                  // 0x013C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Elasticity;                                        // 0x0140(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ScrollOutOfRangeModulus;                           // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUnderSizeScrollEnabled;                           // 0x0148(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CanScroll;                                         // 0x0149(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          RayCastTargetForScrollView;                        // 0x014A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ULGUIPointerEventData* eventData)> OnPointerBeginDragCallBack;              // 0x0150(0x0028)(Edit, ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	TDelegate<void(class ULGUIPointerEventData* eventData)> OnPointerEndDragCallBack;                // 0x0178(0x0028)(Edit, ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	TDelegate<void(class ULGUIPointerEventData* EventData)> OnScrollViewDownUpCallback;              // 0x01A0(0x0028)(Edit, ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UUIItem>                 ContentUIItem;                                     // 0x01C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UUIItem>                 ContentParentUIItem;                               // 0x01D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D8[0x70];                                     // 0x01D8(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              Tweener;                                           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_250[0x8];                                      // 0x0250(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FVector2D& InVector2)> OnScrollValueChange;                          // 0x0258(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)

public:
	static float GetDecelerationRateDegbug();
	static float GetElasticityDegbug();
	static float GetScrollOutOfRangeModulusDebug();
	static float GetScrollSensitivityDebug();
	static bool GetScrollUseDebug();
	static void SetDecelerationRateDebug(float value);
	static void SetElasticityDebug(float value);
	static void SetScrollOutOfRangeModulusDebug(float value);
	static void SetScrollSensitivityDebug(float value);
	static void SetScrollUseDebug(bool value);

	void SetCanScroll(bool bCanScroll);
	void SetHorizontal(bool Value);
	void SetHorizontalVelocity(float Value);
	void SetRayCastTargetForScrollView(bool newRayCastTarget);
	void SetScrollProgress(float Value);
	void SetScrollProgressIncrement(float Value);
	void SetScrollValue(const struct FVector2D& Value);
	void SetUnderSizeScrollEnabled(bool bEnabled);
	void SetVelocity(float Value);
	void SetVertical(bool Value);
	void SetVerticalVelocity(float Value);
	void StopMovement();

	bool CheckContentUnderSize() const;
	bool GetCanScroll() const;
	class AUIBaseActor* GetContent() const;
	bool GetHorizontal() const;
	bool GetRayCastTargetForScrollView() const;
	bool GetUnderSizeScrollEnabled() const;
	struct FVector2D GetVelocity() const;
	bool GetVertical() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIScrollViewComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIScrollViewComponent")
	}
	static class UUIScrollViewComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIScrollViewComponent>();
	}
};
DUMPER7_ASSERTS_UUIScrollViewComponent;

// Class LGUI.UIScrollViewWithScrollbarComponent
// 0x0048 (0x02C8 - 0x0280)
class UUIScrollViewWithScrollbarComponent : public UUIScrollViewComponent
{
public:
	TWeakObjectPtr<class AUIBaseActor>            Viewport;                                          // 0x0280(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AUIBaseActor>            HorizontalScrollbar;                               // 0x0288(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EScrollViewScrollbarVisibility                HorizontalScrollbarVisibility;                     // 0x0290(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AUIBaseActor>            VerticalScrollbar;                                 // 0x0294(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EScrollViewScrollbarVisibility                VerticalScrollbarVisibility;                       // 0x029C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UUIScrollbarComponent>   HorizontalScrollbarComp;                           // 0x02A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UUIScrollbarComponent>   VerticalScrollbarComp;                             // 0x02A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B0[0x2];                                      // 0x02B0(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          IsChangeNavigation;                                // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B3[0x11];                                     // 0x02B3(0x0011)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          AllowScrollEventBubbleUp;                          // 0x02C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindParentUIItem(class UUISelectableComponent* Component);
	class UUISelectableComponent* FindNavigationComponent(class UUISelectableComponent* Component, const struct FVector& Direction, EUINavigationWrapMode Mode, bool bHasOtherNode);
	void GetOutOfBottomBoundsType(class UUIItem* UIItem, EOutOfBoundsType* OutOfTopOrBottomType, EOutOfBoundsType* OutOfLeftOrRightType, float ErrorTolerance);
	void ResetIsChangeNavigation();
	void ScrollTo(class UUIItem* UIItem, bool bTweenAnim);
	void ScrollToBottom(struct FVector2D* NewPosition, class UUIItem* UIItem, bool bTweenAnim);
	void ScrollToBottomLater(class UUIItem* UIItem, bool bTweenAnim);
	void ScrollToEnd();
	void ScrollToLeft(struct FVector2D* NewPosition, class UUIItem* UIItem, bool bTweenAnim);
	void ScrollToLeftLater(class UUIItem* UIItem, bool bTweenAnim);
	void ScrollToRight(struct FVector2D* NewPosition, class UUIItem* UIItem, bool bTweenAnim);
	void ScrollToRightLater(class UUIItem* UIItem, bool bTweenAnim);
	void ScrollToSelectableComponent(class UUISelectableComponent* Component);
	void ScrollToTop(struct FVector2D* NewPosition, class UUIItem* UIItem, bool bTweenAnim);
	void ScrollToTopLater(class UUIItem* UIItem, bool bTweenAnim);
	void SetHorizontalScrollbarVisibility(EScrollViewScrollbarVisibility value);
	void SetVerticalScrollbarVisibility(EScrollViewScrollbarVisibility value);
	void UnBindParentUIItem(class UUISelectableComponent* Component);

	class AUIBaseActor* GetHorizontalScrollbar() const;
	EScrollViewScrollbarVisibility GetHorizontalScrollbarVisibility() const;
	class AUIBaseActor* GetVerticalScrollbar() const;
	EScrollViewScrollbarVisibility GetVerticalScrollbarVisibility() const;
	class AUIBaseActor* GetViewport() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIScrollViewWithScrollbarComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIScrollViewWithScrollbarComponent")
	}
	static class UUIScrollViewWithScrollbarComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIScrollViewWithScrollbarComponent>();
	}
};
DUMPER7_ASSERTS_UUIScrollViewWithScrollbarComponent;

// Class LGUI.UIMultiTemplateScrollViewComponent
// 0x01A0 (0x0468 - 0x02C8)
class UUIMultiTemplateScrollViewComponent final : public UUIScrollViewWithScrollbarComponent
{
public:
	TArray<struct FMultiTemplateScrollViewTemplateInfo> TemplateInfoArray;                           // 0x02C8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	float                                         ViewportSizeTolerance;                             // 0x02D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2DC[0xBC];                                     // 0x02DC(0x00BC)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AreaSpacing;                                       // 0x0398(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 GridIndex, class AUIBaseActor* Actor)> OnItemCreate;                        // 0x03A0(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void(int32 GridIndex, class AUIBaseActor* Actor)> OnItemRefresh;                       // 0x03C8(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void(int32 GridIndex, class AUIBaseActor* Actor)> OnItemClear;                         // 0x03F0(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_418[0x50];                                     // 0x0418(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 FindNavigationIndex(class UUISelectableComponent* Component, const struct FVector& Direction, EUINavigationWrapMode WrapMode, EUINavigationPriorityMode PriorityMode, float NavigateTolerance, float NavigateToleranceReverse);
	int32 GetGridIndexByChildComponent(class UUISelectableComponent* Component);
	class UUIItem* GetGridItem(int32 GridIndex);
	class UUIItem* GetGridItemByChildComponent(class UUISelectableComponent* Component);
	class UUISelectableComponent* GetNavigationComponentByGridIndex(int32 GridIndex);
	bool IsAllItemDisplayed();
	bool IsInDisplayRange(int32 GridIndex, bool OnlyCheckData);
	void Refresh();
	void RefreshByData(const TArray<int32>& InTemplateIndexArray, bool KeepContentPosition, int32 ScrollToItemIndex);
	void ScrollToGridIndex(int32 GridIndex, bool bScrollToTop);
	void ScrollToGridIndexLater(int32 GridIndex, bool bScrollToTop);
	void TryScrollToGridIndex(int32 GridIndex, bool bScrollToTop);

	bool CheckScrollViewValid() const;
	void GetAreaGridIndexRange(int32 InAreaIndex, int32* OutStartGridIndex, int32* OutEndGridIndex) const;
	struct FMargin GetAreaPadding(int32 InAreaIndex) const;
	void GetAreaSize(int32 InAreaIndex, float* OutWidth, float* OutHeight) const;
	int32 GetEndDisplayGridIndex() const;
	struct FVector2D GetGridSpacingInArea(int32 InAreaIndex) const;
	int32 GetGridTemplateIndexInArea(int32 InAreaIndex) const;
	float GetLineHeightWhenVertical(int32 InLineIndex) const;
	float GetLineWidthWhenHorizontal(int32 InLineIndex) const;
	int32 GetStartDisplayGridIndex() const;
	void SetContentOffsetAlignGrid(int32 GridIndex, bool bClamp, bool bScrollToTop) const;
	void SetContentOffsetXWhenHorizontal(float NewOffset, bool bClamp) const;
	void SetContentOffsetYWhenVertical(float NewOffset, bool bClamp) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIMultiTemplateScrollViewComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIMultiTemplateScrollViewComponent")
	}
	static class UUIMultiTemplateScrollViewComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIMultiTemplateScrollViewComponent>();
	}
};
DUMPER7_ASSERTS_UUIMultiTemplateScrollViewComponent;

// Class LGUI.LGUIPrefabHelperActor
// 0x0000 (0x02B0 - 0x02B0)
class ALGUIPrefabHelperActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGUIPrefabHelperActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGUIPrefabHelperActor")
	}
	static class ALGUIPrefabHelperActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALGUIPrefabHelperActor>();
	}
};
DUMPER7_ASSERTS_ALGUIPrefabHelperActor;

// Class LGUI.LGUI_MainViewportMouseRayEmitter
// 0x0008 (0x00F8 - 0x00F0)
class ULGUI_MainViewportMouseRayEmitter final : public ULGUIBaseRayEmitter
{
public:
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGUI_MainViewportMouseRayEmitter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGUI_MainViewportMouseRayEmitter")
	}
	static class ULGUI_MainViewportMouseRayEmitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUI_MainViewportMouseRayEmitter>();
	}
};
DUMPER7_ASSERTS_ULGUI_MainViewportMouseRayEmitter;

// Class LGUI.LGUIPrefabHelperComponent
// 0x0000 (0x0220 - 0x0220)
class ULGUIPrefabHelperComponent final : public USceneComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGUIPrefabHelperComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGUIPrefabHelperComponent")
	}
	static class ULGUIPrefabHelperComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIPrefabHelperComponent>();
	}
};
DUMPER7_ASSERTS_ULGUIPrefabHelperComponent;

// Class LGUI.LGUIBaseInputModule
// 0x0000 (0x00C0 - 0x00C0)
class ULGUIBaseInputModule : public UActorComponent
{
public:
	void ClearEvent();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGUIBaseInputModule")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGUIBaseInputModule")
	}
	static class ULGUIBaseInputModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIBaseInputModule>();
	}
};
DUMPER7_ASSERTS_ULGUIBaseInputModule;

// Class LGUI.LGUI_PointerInputModule
// 0x0060 (0x0120 - 0x00C0)
class ULGUI_PointerInputModule : public ULGUIBaseInputModule
{
public:
	class ULGUIEventSystem*                       eventSystem;                                       // 0x00C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x58];                                      // 0x00C8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EInputKeyType GetCurrentInputKeyType();
	class UUIItem* GetNowHitComponent();
	class ULGUIPointerEventData* GetPointerEventData(int32 PointerId, bool CreateIfNotExist);
	void InputNavigation(ELGUINavigationDirection direction, bool pressOrRelease);
	void InputTriggerForNavigation(bool triggerPress);
	bool IsPointerEventDataLineTrace(class ULGUIPointerEventData* InPointerEventData);
	struct FLGUIDelegateHandleWrapper RegisterInputChangeEvent(const TDelegate<void(ELGUIPointerInputType type)>& pointerInputChange);
	void SetClickThreshold(float Value);
	void SetCurrentInputKeyType(EInputKeyType InputKeyType);
	void SwitchToNavigationInputType();
	void UnregisterInputChangeEvent(const struct FLGUIDelegateHandleWrapper& delegateHandle);
	void UpdateNavigation(class USceneComponent* NewSelectable);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGUI_PointerInputModule")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGUI_PointerInputModule")
	}
	static class ULGUI_PointerInputModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUI_PointerInputModule>();
	}
};
DUMPER7_ASSERTS_ULGUI_PointerInputModule;

// Class LGUI.LGUI_SceneCapture2DMouseRayEmitter
// 0x0018 (0x0108 - 0x00F0)
class ULGUI_SceneCapture2DMouseRayEmitter final : public ULGUIBaseRayEmitter
{
public:
	class ASceneCapture2D*                        SceneCaptureActor;                                 // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneCaptureComponent2D*               sceneCaptureComp;                                  // 0x00F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void DeprojectViewPointToWorldForSceneCapture2D(class USceneCaptureComponent2D* InSceneCapture2D, const struct FVector2D& InViewPoint01, struct FVector* OutRayOrigin, struct FVector* OutRayDirection);
	static bool ProjectWorldToViewPointForSceneCapture2D(class USceneCaptureComponent2D* InSceneCapture2D, const struct FVector& InWorldPosition, struct FVector2D* OutViewPoint);

	class USceneCaptureComponent2D* GetSceneCapture2DComponent();
	void SetSceneCapture2DComponent(class USceneCaptureComponent2D* InComp);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGUI_SceneCapture2DMouseRayEmitter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGUI_SceneCapture2DMouseRayEmitter")
	}
	static class ULGUI_SceneCapture2DMouseRayEmitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUI_SceneCapture2DMouseRayEmitter>();
	}
};
DUMPER7_ASSERTS_ULGUI_SceneCapture2DMouseRayEmitter;

// Class LGUI.LGUI_SceneComponentRayEmitter
// 0x0018 (0x0108 - 0x00F0)
class ULGUI_SceneComponentRayEmitter final : public ULGUIBaseRayEmitter
{
public:
