#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MIDIDevice

#include "Basic.hpp"

#include "MIDIDevice_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MIDIDevice.MIDIDeviceController
// 0x0038 (0x0068 - 0x0030)
class UMIDIDeviceController final : public UObject
{
public:
	TMulticastInlineDelegate<void(class UMIDIDeviceController* MIDIDeviceController, int32 Timestamp, EMIDIEventType EventType, int32 Channel, int32 ControlID, int32 Velocity, int32 RawEventType)> OnMIDIEvent; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         DeviceID;                                          // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DeviceName;                                        // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MIDIDeviceController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MIDIDeviceController")
	}
	static class UMIDIDeviceController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMIDIDeviceController>();
	}
};
DUMPER7_ASSERTS_UMIDIDeviceController;

// Class MIDIDevice.MIDIDeviceInputController
// 0x0098 (0x00C8 - 0x0030)
class UMIDIDeviceInputController final : public UObject
{
public:
	TMulticastInlineDelegate<void(class UMIDIDeviceInputController* MIDIDeviceController, int32 Timestamp, int32 Channel, int32 Note, int32 Velocity)> OnMIDINoteOn; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UMIDIDeviceInputController* MIDIDeviceController, int32 Timestamp, int32 Channel, int32 Note, int32 Velocity)> OnMIDINoteOff; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UMIDIDeviceInputController* MIDIDeviceController, int32 Timestamp, int32 Channel, int32 Pitch)> OnMIDIPitchBend; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UMIDIDeviceInputController* MIDIDeviceController, int32 Timestamp, int32 Channel, int32 Note, int32 Amount)> OnMIDIAftertouch; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UMIDIDeviceInputController* MIDIDeviceController, int32 Timestamp, int32 Channel, int32 Type, int32 Value)> OnMIDIControlChange; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UMIDIDeviceInputController* MIDIDeviceController, int32 Timestamp, int32 Channel, int32 ControlID, int32 Velocity)> OnMIDIProgramChange; // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UMIDIDeviceInputController* MIDIDeviceController, int32 Timestamp, int32 Channel, int32 Amount)> OnMIDIChannelAftertouch; // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         DeviceID;                                          // 0x00A0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DeviceName;                                        // 0x00A8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MIDIDeviceInputController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MIDIDeviceInputController")
	}
	static class UMIDIDeviceInputController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMIDIDeviceInputController>();
	}
};
DUMPER7_ASSERTS_UMIDIDeviceInputController;

// Class MIDIDevice.MIDIDeviceManager
// 0x0000 (0x0030 - 0x0030)
class UMIDIDeviceManager final : public UBlueprintFunctionLibrary
{
public:
	static class UMIDIDeviceController* CreateMIDIDeviceController(const int32 DeviceID, const int32 MIDIBufferSize);
	static class UMIDIDeviceInputController* CreateMIDIDeviceInputController(const int32 DeviceID, const int32 MIDIBufferSize);
	static class UMIDIDeviceOutputController* CreateMIDIDeviceOutputController(const int32 DeviceID);
	static void FindAllMIDIDeviceInfo(TArray<struct FMIDIDeviceInfo>* OutMIDIInputDevices, TArray<struct FMIDIDeviceInfo>* OutMIDIOutputDevices);
	static void FindMIDIDevices(TArray<struct FFoundMIDIDevice>* OutMIDIDevices);
	static void GetDefaultIMIDIInputDeviceID(int32* DeviceID);
	static void GetDefaultIMIDIOutputDeviceID(int32* DeviceID);
	static void GetMIDIInputDeviceIDByName(const class FString& DeviceName, int32* DeviceID);
	static void GetMIDIOutputDeviceIDByName(const class FString& DeviceName, int32* DeviceID);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MIDIDeviceManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MIDIDeviceManager")
	}
	static class UMIDIDeviceManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMIDIDeviceManager>();
	}
};
DUMPER7_ASSERTS_UMIDIDeviceManager;

// Class MIDIDevice.MIDIDeviceOutputController
// 0x0020 (0x0050 - 0x0030)
class UMIDIDeviceOutputController final : public UObject
{
public:
	int32                                         DeviceID;                                          // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DeviceName;                                        // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SendMIDIChannelAftertouch(int32 Channel, float Amount);
	void SendMIDIControlChange(int32 Channel, int32 Type, int32 Value);
	void SendMIDIEvent(EMIDIEventType EventType, int32 Channel, int32 data1, int32 data2);
	void SendMIDINoteAftertouch(int32 Channel, int32 Note, float Amount);
	void SendMIDINoteOff(int32 Channel, int32 Note, int32 Velocity);
	void SendMIDINoteOn(int32 Channel, int32 Note, int32 Velocity);
	void SendMIDIPitchBend(int32 Channel, int32 Pitch);
	void SendMIDIProgramChange(int32 Channel, int32 ProgramNumber);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MIDIDeviceOutputController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MIDIDeviceOutputController")
	}
	static class UMIDIDeviceOutputController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMIDIDeviceOutputController>();
	}
};
DUMPER7_ASSERTS_UMIDIDeviceOutputController;

}

