#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieScene

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class MovieScene.MovieSceneCompiledData
// 0x03D0 (0x0400 - 0x0030)
class UMovieSceneCompiledData final : public UObject
{
public:
	struct FMovieSceneEvaluationTemplate          EvaluationTemplate;                                // 0x0030(0x0160)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FMovieSceneSequenceHierarchy           Hierarchy;                                         // 0x0190(0x0118)(NativeAccessSpecifierPrivate)
	struct FMovieSceneEntityComponentField        EntityComponentField;                              // 0x02A8(0x00F0)(NativeAccessSpecifierPrivate)
	struct FMovieSceneEvaluationField             TrackTemplateField;                                // 0x0398(0x0030)(NativeAccessSpecifierPrivate)
	TArray<struct FFrameTime>                     DeterminismFences;                                 // 0x03C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FGuid                                  CompiledSignature;                                 // 0x03D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  CompilerVersion;                                   // 0x03E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMovieSceneSequenceCompilerMaskStruct  AccumulatedMask;                                   // 0x03F8(0x0001)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FMovieSceneSequenceCompilerMaskStruct  AllocatedMask;                                     // 0x03F9(0x0001)(NoDestructor, NativeAccessSpecifierPrivate)
	EMovieSceneSequenceFlags                      AccumulatedFlags;                                  // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3FB[0x5];                                      // 0x03FB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneCompiledData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneCompiledData")
	}
	static class UMovieSceneCompiledData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCompiledData>();
	}
};
DUMPER7_ASSERTS_UMovieSceneCompiledData;

// Class MovieScene.MovieSceneSignedObject
// 0x0028 (0x0058 - 0x0030)
class UMovieSceneSignedObject : public UObject
{
public:
	struct FGuid                                  Signature;                                         // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSignedObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSignedObject")
	}
	static class UMovieSceneSignedObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSignedObject>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSignedObject;

// Class MovieScene.MovieSceneSection
// 0x00A0 (0x00F8 - 0x0058)
class UMovieSceneSection : public UMovieSceneSignedObject
{
public:
	struct FMovieSceneSectionEvalOptions          EvalOptions;                                       // 0x0058(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneEasingSettings              Easing;                                            // 0x0060(0x0040)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovieSceneFrameRange                  SectionRange;                                      // 0x00A0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFrameNumber                           PreRollFrames;                                     // 0x00B0(0x0004)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameNumber                           PostRollFrames;                                    // 0x00B4(0x0004)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         RowIndex;                                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         OverlapPriority;                                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bIsActive : 1;                                     // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsLocked : 1;                                     // 0x00C0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x00C4(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndTime;                                           // 0x00C8(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PreRollTime;                                       // 0x00CC(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PostRollTime;                                      // 0x00D0(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIsInfinite : 1;                                   // 0x00D4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSupportsInfiniteRange;                            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FOptionalMovieSceneBlendType           BlendType;                                         // 0x00D9(0x0002)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_DB[0x1D];                                      // 0x00DB(0x001D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBlendType(EMovieSceneBlendType InBlendType);
	void SetCompletionMode(EMovieSceneCompletionMode InCompletionMode);
	void SetIsActive(bool bInIsActive);
	void SetIsLocked(bool bInIsLocked);
	void SetOverlapPriority(int32 NewPriority);
	void SetPostRollFrames(int32 InPostRollFrames);
	void SetPreRollFrames(int32 InPreRollFrames);
	void SetRowIndex(int32 NewRowIndex);

	struct FOptionalMovieSceneBlendType GetBlendType() const;
	EMovieSceneCompletionMode GetCompletionMode() const;
	struct FFrameNumberRangeBound GetEndFrame() const;
	int32 GetOverlapPriority() const;
	int32 GetPostRollFrames() const;
	int32 GetPreRollFrames() const;
	int32 GetRowIndex() const;
	struct FFrameNumberRangeBound GetStartFrame() const;
	bool IsActive() const;
	bool IsLocked() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSection")
	}
	static class UMovieSceneSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSection;

// Class MovieScene.MovieSceneSubSection
// 0x0078 (0x0170 - 0x00F8)
class UMovieSceneSubSection : public UMovieSceneSection
{
public:
	struct FMovieSceneSectionParameters           Parameters;                                        // 0x00F8(0x0024)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	float                                         StartOffset;                                       // 0x011C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimeScale;                                         // 0x0120(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PrerollTime;                                       // 0x0124(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMovieSceneSequence*                    SubSequence;                                       // 0x0128(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TLazyObjectPtr<class AActor>                  ActorToRecord;                                     // 0x0130(0x001C)(Edit, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TargetSequenceName;                                // 0x0150(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDirectoryPath                         TargetPathToRecordTo;                              // 0x0160(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	void SetSequence(class UMovieSceneSequence* Sequence);

	class UMovieSceneSequence* GetSequence() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSubSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSubSection")
	}
	static class UMovieSceneSubSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSubSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSubSection;

// Class MovieScene.MovieSceneBindingOverrides
// 0x0068 (0x0098 - 0x0030)
class UMovieSceneBindingOverrides final : public UObject
{
public:
	TArray<struct FMovieSceneBindingOverrideData> BindingData;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x58];                                      // 0x0040(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBindingOverrides")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBindingOverrides")
	}
	static class UMovieSceneBindingOverrides* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBindingOverrides>();
	}
};
DUMPER7_ASSERTS_UMovieSceneBindingOverrides;

// Class MovieScene.MovieSceneEntitySystem
// 0x0018 (0x0048 - 0x0030)
class UMovieSceneEntitySystem : public UObject
{
public:
	class UMovieSceneEntitySystemLinker*          Linker;                                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEntitySystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEntitySystem")
	}
	static class UMovieSceneEntitySystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntitySystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneEntitySystem;

// Class MovieScene.MovieSceneSpawnablesSystem
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneSpawnablesSystem final : public UMovieSceneEntitySystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSpawnablesSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSpawnablesSystem")
	}
	static class UMovieSceneSpawnablesSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSpawnablesSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSpawnablesSystem;

// Class MovieScene.MovieSceneTrackInstance
// 0x0028 (0x0058 - 0x0030)
class UMovieSceneTrackInstance : public UObject
{
public:
	class UObject*                                AnimatedObject;                                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsMasterTrackInstance;                            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneEntitySystemLinker*          Linker;                                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneTrackInstanceInput>  Inputs;                                            // 0x0048(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTrackInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTrackInstance")
	}
	static class UMovieSceneTrackInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrackInstance>();
	}
};
DUMPER7_ASSERTS_UMovieSceneTrackInstance;

// Class MovieScene.MovieSceneTrack
// 0x0040 (0x0098 - 0x0058)
class UMovieSceneTrack : public UMovieSceneSignedObject
{
public:
	struct FMovieSceneTrackEvalOptions            EvalOptions;                                       // 0x0058(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           TrackTags;                                         // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x1];                                       // 0x0070(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsEvalDisabled;                                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  EvaluationFieldGuid;                               // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneTrackEvaluationField        EvaluationField;                                   // 0x0088(0x0010)(ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTrack")
	}
	static class UMovieSceneTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneTrack;

// Class MovieScene.MovieSceneBlenderSystem
// 0x0020 (0x0068 - 0x0048)
class UMovieSceneBlenderSystem : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBlenderSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBlenderSystem")
	}
	static class UMovieSceneBlenderSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBlenderSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneBlenderSystem;

// Class MovieScene.MovieSceneSequencePlayer
// 0x06C8 (0x06F8 - 0x0030)
class UMovieSceneSequencePlayer : public UObject
{
public:
	uint8                                         Pad_30[0x3E8];                                     // 0x0030(0x03E8)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPlay;                                            // 0x0418(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlayReverse;                                     // 0x0428(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnStop;                                            // 0x0438(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPause;                                           // 0x0448(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnInterrupt;                                       // 0x0458(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFinished;                                        // 0x0468(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_478[0x30];                                     // 0x0478(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	EMovieScenePlayerStatus                       Status;                                            // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bReversePlayback : 1;                              // 0x04AC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 KeyFrames;                                         // 0x04B0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C0[0x8];                                      // 0x04C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneSequence*                    Sequence;                                          // 0x04C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFrameNumber                           StartTime;                                         // 0x04D0(0x0004)(Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DurationFrames;                                    // 0x04D4(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DurationSubFrames;                                 // 0x04D8(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentNumLoops;                                   // 0x04DC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMovieSceneSequencePlaybackSettings    PlaybackSettings;                                  // 0x04E0(0x0014)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance;                           // 0x04F8(0x00F8)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F0[0x68];                                     // 0x05F0(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequenceReplProperties      NetSyncProps;                                      // 0x0658(0x0010)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TScriptInterface<class IMovieScenePlaybackClient> PlaybackClient;                                // 0x0668(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UMovieSceneSequenceTickManager*         TickManager;                                       // 0x0678(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_680[0x78];                                     // 0x0680(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ChangePlaybackDirection();
	void CleanPauseOnFrame();
	void ClearKeyFrames();
	TArray<class UObject*> GetBoundObjects(const struct FMovieSceneObjectBindingID& ObjectBinding);
	bool GetDisableCameraCuts();
	TArray<struct FMovieSceneObjectBindingID> GetObjectBindings(class UObject* InObject);
	void GoToEndAndStop(EUpdatePositionMethod UpdateMethod);
	void JumpToFrame(const struct FFrameTime& NewPosition);
	bool JumpToMarkedFrame(const class FString& InLabel);
	void JumpToSeconds(float TimeInSeconds);
	void Pause();
	void PauseOnNextFrame();
	void Play();
	void PlayLooping(int32 NumLoops);
	void PlayReverse();
	void PlayReverseLooping(int32 NumLoops);
	void PlayTo(const struct FMovieSceneSequencePlaybackParams& PlaybackParams);
	void PlayTo_Circle(const struct FMovieSceneSequencePlaybackParams& InPlaybackParams, const bool InAutoDirect, const bool InIsForward);
	void PlayTo_Loop(const struct FMovieSceneSequencePlaybackParams& InPlaybackParams, const class FString& StartMarkedFrame);
	void PlayToFrame(const struct FFrameTime& NewPosition);
	bool PlayToMarkedFrame(const class FString& InLabel);
	void PlayToSeconds(float TimeInSeconds);
	void RPC_ExplicitServerUpdateEvent(EUpdatePositionMethod Method, const struct FFrameTime& RelevantTime);
	void RPC_OnStopEvent(const struct FFrameTime& StoppedTime);
	void Scrub();
	void ScrubToFrame(const struct FFrameTime& NewPosition);
	bool ScrubToMarkedFrame(const class FString& InLabel);
	void ScrubToSeconds(float TimeInSeconds);
	void SetDisableCameraCuts(bool bInDisableCameraCuts);
	void SetFrameRange(int32 StartFrame, int32 Duration, float SubFrames);
	void SetFrameRate(const struct FFrameRate& FrameRate);
	void SetKeyFrames(const TArray<int32>& InKeyFrames);
	void SetPlaybackPosition(const struct FMovieSceneSequencePlaybackParams& PlaybackParams);
	void SetPlaybackPositionWithNoEval(const struct FMovieSceneSequencePlaybackParams& PlaybackParams);
	void SetPlayRate(float PlayRate);
	void SetTimeRange(float StartTime_0, float Duration);
	void Stop();
	void StopAtCurrentTime();

	struct FQualifiedFrameTime GetCurrentTime() const;
	struct FQualifiedFrameTime GetDuration() const;
	struct FQualifiedFrameTime GetEndTime() const;
	int32 GetFrameDuration() const;
	struct FFrameRate GetFrameRate() const;
	float GetPlayRate() const;
	struct FQualifiedFrameTime GetStartTime() const;
	bool IsPaused() const;
	bool IsPlaying() const;
	bool IsReversed() const;
	bool IsStopped() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSequencePlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSequencePlayer")
	}
	static class UMovieSceneSequencePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSequencePlayer>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSequencePlayer;

// Class MovieScene.TestMovieSceneTrack
// 0x0020 (0x00B8 - 0x0098)
class UTestMovieSceneTrack final : public UMovieSceneTrack
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bHighPassFilter;                                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             SectionArray;                                      // 0x00A8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TestMovieSceneTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TestMovieSceneTrack")
	}
	static class UTestMovieSceneTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestMovieSceneTrack>();
	}
};
DUMPER7_ASSERTS_UTestMovieSceneTrack;

// Class MovieScene.MovieSceneNameableTrack
// 0x0000 (0x0098 - 0x0098)
class UMovieSceneNameableTrack : public UMovieSceneTrack
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNameableTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNameableTrack")
	}
	static class UMovieSceneNameableTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNameableTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNameableTrack;

// Class MovieScene.MovieSceneSequenceTickManager
// 0x00D0 (0x0100 - 0x0030)
class UMovieSceneSequenceTickManager final : public UObject
{
public:
	TArray<class AActor*>                         SequenceActors;                                    // 0x0030(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class UMovieSceneEntitySystemLinker*          Linker;                                            // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0xA8];                                      // 0x0048(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         RemoveSequenceActors;                              // 0x00F0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSequenceTickManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSequenceTickManager")
	}
	static class UMovieSceneSequenceTickManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSequenceTickManager>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSequenceTickManager;

// Class MovieScene.MovieSceneSequence
// 0x0010 (0x0068 - 0x0058)
class UMovieSceneSequence : public UMovieSceneSignedObject
{
public:
	class UMovieSceneCompiledData*                CompiledData;                                      // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMovieSceneCompletionMode                     DefaultCompletionMode;                             // 0x0060(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bParentContextsAreSignificant;                     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPlayableDirectly;                                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMovieSceneSequenceFlags                      SequenceFlags;                                     // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FMovieSceneObjectBindingID FindBindingByTag(class FName InBindingName) const;
	const TArray<struct FMovieSceneObjectBindingID> FindBindingsByBothTags(const TArray<class FName>& InBindingNames) const;
	const TArray<struct FMovieSceneObjectBindingID> FindBindingsByTag(class FName InBindingName) const;
	class UMovieSceneTrack* FindMasterTrackByTag(class FName InTrackTagName) const;
	const TArray<class UMovieSceneTrack*> FindMasterTracksByBothTags(const TArray<class FName>& InTrackTagNames) const;
	const TArray<class UMovieSceneTrack*> FindMasterTracksByTag(class FName InTrackTagName) const;
	bool HasBindingTag(class FName InBindingName, bool IncludeSubSequence) const;
	bool HasMasterTrackTag(class FName InTrackTagName, bool IncludeSubSequence) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSequence")
	}
	static class UMovieSceneSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSequence>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSequence;

// Class MovieScene.MovieSceneSubTrack
// 0x0010 (0x00A8 - 0x0098)
class UMovieSceneSubTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0098(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSubTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSubTrack")
	}
	static class UMovieSceneSubTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSubTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSubTrack;

// Class MovieScene.MovieSceneCustomClockSource
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneCustomClockSource final
{
public:
	struct FFrameTime OnRequestCurrentTime(const struct FQualifiedFrameTime& InCurrentTime, float InPlayRate);
	void OnStartPlaying(const struct FQualifiedFrameTime& InStartTime);
	void OnStopPlaying(const struct FQualifiedFrameTime& InStopTime);
	void OnTick(float DeltaSeconds, float InPlayRate);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneCustomClockSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneCustomClockSource")
	}
	static class IMovieSceneCustomClockSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneCustomClockSource>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneCustomClockSource;

// Class MovieScene.MovieSceneEntityProvider
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneEntityProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEntityProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEntityProvider")
	}
	static class IMovieSceneEntityProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneEntityProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneEntityProvider;

// Class MovieScene.MovieScenePlaybackClient
// 0x0000 (0x0000 - 0x0000)
class IMovieScenePlaybackClient final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieScenePlaybackClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieScenePlaybackClient")
	}
	static class IMovieScenePlaybackClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieScenePlaybackClient>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieScenePlaybackClient;

// Class MovieScene.MovieSceneTrackTemplateProducer
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneTrackTemplateProducer final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTrackTemplateProducer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTrackTemplateProducer")
	}
	static class IMovieSceneTrackTemplateProducer* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneTrackTemplateProducer>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneTrackTemplateProducer;

// Class MovieScene.NodeAndChannelMappings
// 0x0000 (0x0000 - 0x0000)
class INodeAndChannelMappings final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NodeAndChannelMappings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NodeAndChannelMappings")
	}
	static class INodeAndChannelMappings* GetDefaultObj()
	{
		return GetDefaultObjImpl<INodeAndChannelMappings>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_INodeAndChannelMappings;

// Class MovieScene.MovieSceneNodeGroup
// 0x0000 (0x0030 - 0x0030)
class UMovieSceneNodeGroup final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNodeGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNodeGroup")
	}
	static class UMovieSceneNodeGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNodeGroup>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNodeGroup;

// Class MovieScene.MovieSceneNodeGroupCollection
// 0x0000 (0x0030 - 0x0030)
class UMovieSceneNodeGroupCollection final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNodeGroupCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNodeGroupCollection")
	}
	static class UMovieSceneNodeGroupCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNodeGroupCollection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNodeGroupCollection;

// Class MovieScene.MovieScene
// 0x0150 (0x01A8 - 0x0058)
class UMovieScene final : public UMovieSceneSignedObject
{
public:
	TArray<struct FMovieSceneSpawnable>           Spawnables;                                        // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieScenePossessable>         Possessables;                                      // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneBinding>             ObjectBindings;                                    // 0x0078(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneObjectBindingIDs> BindingGroups;                             // 0x0088(0x0050)(NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneTrack*>               MasterTracks;                                      // 0x00D8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneMasterTracks> MasterTracksGroups;                            // 0x00E8(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UMovieSceneTrack*                       CameraCutTrack;                                    // 0x0138(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMovieSceneFrameRange                  SelectionRange;                                    // 0x0140(0x0010)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FMovieSceneFrameRange                  PlaybackRange;                                     // 0x0150(0x0010)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FFrameRate                             TickResolution;                                    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameRate                             DisplayRate;                                       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMovieSceneEvaluationType                     EvaluationType;                                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EUpdateClockSource                            ClockSource;                                       // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CustomClockSourcePath;                             // 0x0178(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneMarkedFrame>         MarkedFrames;                                      // 0x0198(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	TArray<class FName> AllTags() const;
	TArray<class FName> AllTrackTags() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieScene")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieScene")
	}
	static class UMovieScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene>();
	}
};
DUMPER7_ASSERTS_UMovieScene;

// Class MovieScene.MovieSceneBindingOwnerInterface
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneBindingOwnerInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBindingOwnerInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBindingOwnerInterface")
	}
	static class IMovieSceneBindingOwnerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBindingOwnerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneBindingOwnerInterface;

// Class MovieScene.MovieSceneBoolSection
// 0x0098 (0x0190 - 0x00F8)
class UMovieSceneBoolSection : public UMovieSceneSection
{
public:
	bool                                          DefaultValue;                                      // 0x00F8(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneBoolChannel                 BoolCurve;                                         // 0x0100(0x0090)(Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBoolSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBoolSection")
	}
	static class UMovieSceneBoolSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBoolSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneBoolSection;

// Class MovieScene.MovieSceneEntityInstantiatorSystem
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneEntityInstantiatorSystem : public UMovieSceneEntitySystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEntityInstantiatorSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEntityInstantiatorSystem")
	}
	static class UMovieSceneEntityInstantiatorSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntityInstantiatorSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneEntityInstantiatorSystem;

// Class MovieScene.MovieSceneGenericBoundObjectInstantiator
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneGenericBoundObjectInstantiator final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneGenericBoundObjectInstantiator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneGenericBoundObjectInstantiator")
	}
	static class UMovieSceneGenericBoundObjectInstantiator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGenericBoundObjectInstantiator>();
	}
};
DUMPER7_ASSERTS_UMovieSceneGenericBoundObjectInstantiator;

// Class MovieScene.MovieSceneBoundSceneComponentInstantiator
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneBoundSceneComponentInstantiator final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBoundSceneComponentInstantiator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBoundSceneComponentInstantiator")
	}
	static class UMovieSceneBoundSceneComponentInstantiator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBoundSceneComponentInstantiator>();
	}
};
DUMPER7_ASSERTS_UMovieSceneBoundSceneComponentInstantiator;

// Class MovieScene.MovieSceneSceneComponentImpersonator
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneSceneComponentImpersonator final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSceneComponentImpersonator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSceneComponentImpersonator")
	}
	static class IMovieSceneSceneComponentImpersonator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneSceneComponentImpersonator>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneSceneComponentImpersonator;

// Class MovieScene.MovieSceneCompiledDataManager
// 0x0208 (0x0238 - 0x0030)
class UMovieSceneCompiledDataManager final : public UObject
{
public:
	uint8                                         Pad_30[0xB0];                                      // 0x0030(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FMovieSceneSequenceHierarchy> Hierarchies;                                    // 0x00E0(0x0050)(NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovieSceneEvaluationTemplate> TrackTemplates;                                // 0x0130(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovieSceneEvaluationField> TrackTemplateFields;                              // 0x0180(0x0050)(NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovieSceneEntityComponentField> EntityComponentFields;                       // 0x01D0(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_220[0x18];                                     // 0x0220(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneCompiledDataManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneCompiledDataManager")
	}
	static class UMovieSceneCompiledDataManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCompiledDataManager>();
	}
};
DUMPER7_ASSERTS_UMovieSceneCompiledDataManager;

// Class MovieScene.MovieSceneFloatDecomposer
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneFloatDecomposer final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneFloatDecomposer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneFloatDecomposer")
	}
	static class IMovieSceneFloatDecomposer* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneFloatDecomposer>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneFloatDecomposer;

// Class MovieScene.MovieSceneBuiltInEasingFunction
// 0x0010 (0x0040 - 0x0030)
class UMovieSceneBuiltInEasingFunction final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EMovieSceneBuiltInEasing                      Type;                                              // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBuiltInEasingFunction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBuiltInEasingFunction")
	}
	static class UMovieSceneBuiltInEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBuiltInEasingFunction>();
	}
};
DUMPER7_ASSERTS_UMovieSceneBuiltInEasingFunction;

// Class MovieScene.MovieSceneEasingExternalCurve
// 0x0010 (0x0040 - 0x0030)
class UMovieSceneEasingExternalCurve final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Curve;                                             // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEasingExternalCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEasingExternalCurve")
	}
	static class UMovieSceneEasingExternalCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEasingExternalCurve>();
	}
};
DUMPER7_ASSERTS_UMovieSceneEasingExternalCurve;

// Class MovieScene.MovieSceneEasingFunction
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneEasingFunction final
{
public:
	float OnEvaluate(float Interp) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEasingFunction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEasingFunction")
	}
	static class IMovieSceneEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneEasingFunction>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneEasingFunction;

// Class MovieScene.MovieSceneEntitySystemLinker
// 0x0438 (0x0468 - 0x0030)
class UMovieSceneEntitySystemLinker final : public UObject
{
public:
	uint8                                         Pad_30[0x218];                                     // 0x0030(0x0218)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneEntitySystemGraph           SystemGraph;                                       // 0x0248(0x0138)(NativeAccessSpecifierPublic)
	uint8                                         Pad_380[0xE8];                                     // 0x0380(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEntitySystemLinker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEntitySystemLinker")
	}
	static class UMovieSceneEntitySystemLinker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntitySystemLinker>();
	}
};
DUMPER7_ASSERTS_UMovieSceneEntitySystemLinker;

// Class MovieScene.MovieSceneEvalTimeSystem
// 0x0010 (0x0058 - 0x0048)
class UMovieSceneEvalTimeSystem final : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEvalTimeSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEvalTimeSystem")
	}
	static class UMovieSceneEvalTimeSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEvalTimeSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneEvalTimeSystem;

// Class MovieScene.MovieSceneFolder
// 0x0050 (0x0080 - 0x0030)
class UMovieSceneFolder final : public UObject
{
public:
	class FName                                   FolderName;                                        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneFolder*>              ChildFolders;                                      // 0x0040(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneTrack*>               ChildMasterTracks;                                 // 0x0050(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class FString>                         ChildObjectBindingStrings;                         // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneFolder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneFolder")
	}
	static class UMovieSceneFolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneFolder>();
	}
};
DUMPER7_ASSERTS_UMovieSceneFolder;

// Class MovieScene.MovieSceneKeyProxy
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneKeyProxy final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneKeyProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneKeyProxy")
	}
	static class IMovieSceneKeyProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneKeyProxy>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneKeyProxy;

// Class MovieScene.MovieSceneMasterInstantiatorSystem
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneMasterInstantiatorSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneMasterInstantiatorSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneMasterInstantiatorSystem")
	}
	static class UMovieSceneMasterInstantiatorSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneMasterInstantiatorSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneMasterInstantiatorSystem;

// Class MovieScene.MovieScenePreAnimatedStateSystemInterface
// 0x0000 (0x0000 - 0x0000)
class IMovieScenePreAnimatedStateSystemInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieScenePreAnimatedStateSystemInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieScenePreAnimatedStateSystemInterface")
	}
	static class IMovieScenePreAnimatedStateSystemInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieScenePreAnimatedStateSystemInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieScenePreAnimatedStateSystemInterface;

// Class MovieScene.MovieSceneCachePreAnimatedStateSystem
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneCachePreAnimatedStateSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneCachePreAnimatedStateSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneCachePreAnimatedStateSystem")
	}
	static class UMovieSceneCachePreAnimatedStateSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCachePreAnimatedStateSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneCachePreAnimatedStateSystem;

// Class MovieScene.MovieSceneRestorePreAnimatedStateSystem
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneRestorePreAnimatedStateSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneRestorePreAnimatedStateSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneRestorePreAnimatedStateSystem")
	}
	static class UMovieSceneRestorePreAnimatedStateSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneRestorePreAnimatedStateSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneRestorePreAnimatedStateSystem;

// Class MovieScene.MovieSceneSpawnSection
// 0x0008 (0x0198 - 0x0190)
class UMovieSceneSpawnSection final : public UMovieSceneBoolSection
{
public:
	uint8                                         Pad_190[0x8];                                      // 0x0190(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSpawnSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSpawnSection")
	}
	static class UMovieSceneSpawnSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSpawnSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSpawnSection;

// Class MovieScene.MovieSceneSpawnTrack
// 0x0020 (0x00B8 - 0x0098)
class UMovieSceneSpawnTrack final : public UMovieSceneTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0098(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                  ObjectGuid;                                        // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSpawnTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSpawnTrack")
	}
	static class UMovieSceneSpawnTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSpawnTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSpawnTrack;

// Class MovieScene.TestMovieSceneSection
// 0x0000 (0x00F8 - 0x00F8)
class UTestMovieSceneSection final : public UMovieSceneSection
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TestMovieSceneSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TestMovieSceneSection")
	}
	static class UTestMovieSceneSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestMovieSceneSection>();
	}
};
DUMPER7_ASSERTS_UTestMovieSceneSection;

// Class MovieScene.TestMovieSceneSequence
// 0x0008 (0x0070 - 0x0068)
class UTestMovieSceneSequence final : public UMovieSceneSequence
{
public:
	class UMovieScene*                            MovieScene;                                        // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TestMovieSceneSequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TestMovieSceneSequence")
	}
	static class UTestMovieSceneSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestMovieSceneSequence>();
	}
};
DUMPER7_ASSERTS_UTestMovieSceneSequence;

// Class MovieScene.TestMovieSceneSubTrack
// 0x0010 (0x00B8 - 0x00A8)
class UTestMovieSceneSubTrack final : public UMovieSceneSubTrack
{
public:
	TArray<class UMovieSceneSection*>             SectionArray;                                      // 0x00A8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TestMovieSceneSubTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TestMovieSceneSubTrack")
	}
	static class UTestMovieSceneSubTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestMovieSceneSubTrack>();
	}
};
DUMPER7_ASSERTS_UTestMovieSceneSubTrack;

// Class MovieScene.TestMovieSceneSubSection
// 0x0000 (0x0170 - 0x0170)
class UTestMovieSceneSubSection final : public UMovieSceneSubSection
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TestMovieSceneSubSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TestMovieSceneSubSection")
	}
	static class UTestMovieSceneSubSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestMovieSceneSubSection>();
	}
};
DUMPER7_ASSERTS_UTestMovieSceneSubSection;

// Class MovieScene.MovieSceneTrackInstanceInstantiator
// 0x00B0 (0x00F8 - 0x0048)
