#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Niagara_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Niagara.NiagaraComponent.AdvanceSimulation
// 0x0008 (0x0008 - 0x0000)
struct NiagaraComponent_AdvanceSimulation final
{
public:
	int32                                         TickCount;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TickDeltaSeconds;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_AdvanceSimulation) == 0x000004, "Wrong alignment on NiagaraComponent_AdvanceSimulation");
static_assert(sizeof(NiagaraComponent_AdvanceSimulation) == 0x000008, "Wrong size on NiagaraComponent_AdvanceSimulation");
static_assert(offsetof(NiagaraComponent_AdvanceSimulation, TickCount) == 0x000000, "Member 'NiagaraComponent_AdvanceSimulation::TickCount' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_AdvanceSimulation, TickDeltaSeconds) == 0x000004, "Member 'NiagaraComponent_AdvanceSimulation::TickDeltaSeconds' has a wrong offset!");

// Function Niagara.NiagaraComponent.AdvanceSimulationByTime
// 0x0008 (0x0008 - 0x0000)
struct NiagaraComponent_AdvanceSimulationByTime final
{
public:
	float                                         SimulateTime;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TickDeltaSeconds;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_AdvanceSimulationByTime) == 0x000004, "Wrong alignment on NiagaraComponent_AdvanceSimulationByTime");
static_assert(sizeof(NiagaraComponent_AdvanceSimulationByTime) == 0x000008, "Wrong size on NiagaraComponent_AdvanceSimulationByTime");
static_assert(offsetof(NiagaraComponent_AdvanceSimulationByTime, SimulateTime) == 0x000000, "Member 'NiagaraComponent_AdvanceSimulationByTime::SimulateTime' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_AdvanceSimulationByTime, TickDeltaSeconds) == 0x000004, "Member 'NiagaraComponent_AdvanceSimulationByTime::TickDeltaSeconds' has a wrong offset!");

// Function Niagara.NiagaraComponent.GetActualEffectType
// 0x0008 (0x0008 - 0x0000)
struct NiagaraComponent_GetActualEffectType final
{
public:
	class UNiagaraEffectType*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_GetActualEffectType) == 0x000008, "Wrong alignment on NiagaraComponent_GetActualEffectType");
static_assert(sizeof(NiagaraComponent_GetActualEffectType) == 0x000008, "Wrong size on NiagaraComponent_GetActualEffectType");
static_assert(offsetof(NiagaraComponent_GetActualEffectType, ReturnValue) == 0x000000, "Member 'NiagaraComponent_GetActualEffectType::ReturnValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.GetDataInterface
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_GetDataInterface final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraDataInterface*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_GetDataInterface) == 0x000008, "Wrong alignment on NiagaraComponent_GetDataInterface");
static_assert(sizeof(NiagaraComponent_GetDataInterface) == 0x000018, "Wrong size on NiagaraComponent_GetDataInterface");
static_assert(offsetof(NiagaraComponent_GetDataInterface, Name_0) == 0x000000, "Member 'NiagaraComponent_GetDataInterface::Name_0' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_GetDataInterface, ReturnValue) == 0x000010, "Member 'NiagaraComponent_GetDataInterface::ReturnValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.GetNiagaraParticlePositions_DebugOnly
// 0x0020 (0x0020 - 0x0000)
struct NiagaraComponent_GetNiagaraParticlePositions_DebugOnly final
{
public:
	class FString                                 InEmitterName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_GetNiagaraParticlePositions_DebugOnly) == 0x000008, "Wrong alignment on NiagaraComponent_GetNiagaraParticlePositions_DebugOnly");
static_assert(sizeof(NiagaraComponent_GetNiagaraParticlePositions_DebugOnly) == 0x000020, "Wrong size on NiagaraComponent_GetNiagaraParticlePositions_DebugOnly");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticlePositions_DebugOnly, InEmitterName) == 0x000000, "Member 'NiagaraComponent_GetNiagaraParticlePositions_DebugOnly::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticlePositions_DebugOnly, ReturnValue) == 0x000010, "Member 'NiagaraComponent_GetNiagaraParticlePositions_DebugOnly::ReturnValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.GetNiagaraParticleValues_DebugOnly
// 0x0030 (0x0030 - 0x0000)
struct NiagaraComponent_GetNiagaraParticleValues_DebugOnly final
{
public:
	class FString                                 InEmitterName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InValueName;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_GetNiagaraParticleValues_DebugOnly) == 0x000008, "Wrong alignment on NiagaraComponent_GetNiagaraParticleValues_DebugOnly");
static_assert(sizeof(NiagaraComponent_GetNiagaraParticleValues_DebugOnly) == 0x000030, "Wrong size on NiagaraComponent_GetNiagaraParticleValues_DebugOnly");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticleValues_DebugOnly, InEmitterName) == 0x000000, "Member 'NiagaraComponent_GetNiagaraParticleValues_DebugOnly::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticleValues_DebugOnly, InValueName) == 0x000010, "Member 'NiagaraComponent_GetNiagaraParticleValues_DebugOnly::InValueName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticleValues_DebugOnly, ReturnValue) == 0x000020, "Member 'NiagaraComponent_GetNiagaraParticleValues_DebugOnly::ReturnValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.GetNiagaraParticleValueVec3_DebugOnly
// 0x0030 (0x0030 - 0x0000)
struct NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly final
{
public:
	class FString                                 InEmitterName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InValueName;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly) == 0x000008, "Wrong alignment on NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly");
static_assert(sizeof(NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly) == 0x000030, "Wrong size on NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly, InEmitterName) == 0x000000, "Member 'NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly, InValueName) == 0x000010, "Member 'NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly::InValueName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly, ReturnValue) == 0x000020, "Member 'NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly::ReturnValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.GetRuntimeEffectType
// 0x0008 (0x0008 - 0x0000)
struct NiagaraComponent_GetRuntimeEffectType final
{
public:
	class UNiagaraEffectType*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_GetRuntimeEffectType) == 0x000008, "Wrong alignment on NiagaraComponent_GetRuntimeEffectType");
static_assert(sizeof(NiagaraComponent_GetRuntimeEffectType) == 0x000008, "Wrong size on NiagaraComponent_GetRuntimeEffectType");
static_assert(offsetof(NiagaraComponent_GetRuntimeEffectType, ReturnValue) == 0x000000, "Member 'NiagaraComponent_GetRuntimeEffectType::ReturnValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.HasAnyEmittersComplete
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_HasAnyEmittersComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_HasAnyEmittersComplete) == 0x000001, "Wrong alignment on NiagaraComponent_HasAnyEmittersComplete");
static_assert(sizeof(NiagaraComponent_HasAnyEmittersComplete) == 0x000001, "Wrong size on NiagaraComponent_HasAnyEmittersComplete");
static_assert(offsetof(NiagaraComponent_HasAnyEmittersComplete, ReturnValue) == 0x000000, "Member 'NiagaraComponent_HasAnyEmittersComplete::ReturnValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.HasSkeletalMeshDataInterface
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_HasSkeletalMeshDataInterface final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_HasSkeletalMeshDataInterface) == 0x000001, "Wrong alignment on NiagaraComponent_HasSkeletalMeshDataInterface");
static_assert(sizeof(NiagaraComponent_HasSkeletalMeshDataInterface) == 0x000001, "Wrong size on NiagaraComponent_HasSkeletalMeshDataInterface");
static_assert(offsetof(NiagaraComponent_HasSkeletalMeshDataInterface, ReturnValue) == 0x000000, "Member 'NiagaraComponent_HasSkeletalMeshDataInterface::ReturnValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.ResetOverrideParametersAndActivate
// 0x0020 (0x0020 - 0x0000)
struct NiagaraComponent_ResetOverrideParametersAndActivate final
{
public:
	bool                                          bReset;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ExceptOverrideName;                                // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraComponent_ResetOverrideParametersAndActivate) == 0x000008, "Wrong alignment on NiagaraComponent_ResetOverrideParametersAndActivate");
static_assert(sizeof(NiagaraComponent_ResetOverrideParametersAndActivate) == 0x000020, "Wrong size on NiagaraComponent_ResetOverrideParametersAndActivate");
static_assert(offsetof(NiagaraComponent_ResetOverrideParametersAndActivate, bReset) == 0x000000, "Member 'NiagaraComponent_ResetOverrideParametersAndActivate::bReset' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_ResetOverrideParametersAndActivate, ExceptOverrideName) == 0x000008, "Member 'NiagaraComponent_ResetOverrideParametersAndActivate::ExceptOverrideName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_ResetOverrideParametersAndActivate, ReturnValue) == 0x000018, "Member 'NiagaraComponent_ResetOverrideParametersAndActivate::ReturnValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SeekToDesiredAge
// 0x0004 (0x0004 - 0x0000)
struct NiagaraComponent_SeekToDesiredAge final
{
public:
	float                                         InDesiredAge;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SeekToDesiredAge) == 0x000004, "Wrong alignment on NiagaraComponent_SeekToDesiredAge");
static_assert(sizeof(NiagaraComponent_SeekToDesiredAge) == 0x000004, "Wrong size on NiagaraComponent_SeekToDesiredAge");
static_assert(offsetof(NiagaraComponent_SeekToDesiredAge, InDesiredAge) == 0x000000, "Member 'NiagaraComponent_SeekToDesiredAge::InDesiredAge' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetAgeUpdateMode
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetAgeUpdateMode final
{
public:
	ENiagaraAgeUpdateMode                         InAgeUpdateMode;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetAgeUpdateMode) == 0x000001, "Wrong alignment on NiagaraComponent_SetAgeUpdateMode");
static_assert(sizeof(NiagaraComponent_SetAgeUpdateMode) == 0x000001, "Wrong size on NiagaraComponent_SetAgeUpdateMode");
static_assert(offsetof(NiagaraComponent_SetAgeUpdateMode, InAgeUpdateMode) == 0x000000, "Member 'NiagaraComponent_SetAgeUpdateMode::InAgeUpdateMode' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetAllowScalability
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetAllowScalability final
{
public:
	bool                                          bAllow;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetAllowScalability) == 0x000001, "Wrong alignment on NiagaraComponent_SetAllowScalability");
static_assert(sizeof(NiagaraComponent_SetAllowScalability) == 0x000001, "Wrong size on NiagaraComponent_SetAllowScalability");
static_assert(offsetof(NiagaraComponent_SetAllowScalability, bAllow) == 0x000000, "Member 'NiagaraComponent_SetAllowScalability::bAllow' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetAsset
// 0x0008 (0x0008 - 0x0000)
struct NiagaraComponent_SetAsset final
{
public:
	class UNiagaraSystem*                         InAsset;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetAsset) == 0x000008, "Wrong alignment on NiagaraComponent_SetAsset");
static_assert(sizeof(NiagaraComponent_SetAsset) == 0x000008, "Wrong size on NiagaraComponent_SetAsset");
static_assert(offsetof(NiagaraComponent_SetAsset, InAsset) == 0x000000, "Member 'NiagaraComponent_SetAsset::InAsset' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetAutoDestroy
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetAutoDestroy final
{
public:
	bool                                          bInAutoDestroy;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetAutoDestroy) == 0x000001, "Wrong alignment on NiagaraComponent_SetAutoDestroy");
static_assert(sizeof(NiagaraComponent_SetAutoDestroy) == 0x000001, "Wrong size on NiagaraComponent_SetAutoDestroy");
static_assert(offsetof(NiagaraComponent_SetAutoDestroy, bInAutoDestroy) == 0x000000, "Member 'NiagaraComponent_SetAutoDestroy::bInAutoDestroy' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetCanRenderWhileSeeking
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetCanRenderWhileSeeking final
{
public:
	bool                                          bInCanRenderWhileSeeking;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetCanRenderWhileSeeking) == 0x000001, "Wrong alignment on NiagaraComponent_SetCanRenderWhileSeeking");
static_assert(sizeof(NiagaraComponent_SetCanRenderWhileSeeking) == 0x000001, "Wrong size on NiagaraComponent_SetCanRenderWhileSeeking");
static_assert(offsetof(NiagaraComponent_SetCanRenderWhileSeeking, bInCanRenderWhileSeeking) == 0x000000, "Member 'NiagaraComponent_SetCanRenderWhileSeeking::bInCanRenderWhileSeeking' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetDesiredAge
// 0x0004 (0x0004 - 0x0000)
struct NiagaraComponent_SetDesiredAge final
{
public:
	float                                         InDesiredAge;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetDesiredAge) == 0x000004, "Wrong alignment on NiagaraComponent_SetDesiredAge");
static_assert(sizeof(NiagaraComponent_SetDesiredAge) == 0x000004, "Wrong size on NiagaraComponent_SetDesiredAge");
static_assert(offsetof(NiagaraComponent_SetDesiredAge, InDesiredAge) == 0x000000, "Member 'NiagaraComponent_SetDesiredAge::InDesiredAge' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetEmitterQualityLevelBias
// 0x0004 (0x0004 - 0x0000)
struct NiagaraComponent_SetEmitterQualityLevelBias final
{
public:
	int32                                         InBias;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetEmitterQualityLevelBias) == 0x000004, "Wrong alignment on NiagaraComponent_SetEmitterQualityLevelBias");
static_assert(sizeof(NiagaraComponent_SetEmitterQualityLevelBias) == 0x000004, "Wrong size on NiagaraComponent_SetEmitterQualityLevelBias");
static_assert(offsetof(NiagaraComponent_SetEmitterQualityLevelBias, InBias) == 0x000000, "Member 'NiagaraComponent_SetEmitterQualityLevelBias::InBias' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetForceSolo
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetForceSolo final
{
public:
	bool                                          bInForceSolo;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetForceSolo) == 0x000001, "Wrong alignment on NiagaraComponent_SetForceSolo");
static_assert(sizeof(NiagaraComponent_SetForceSolo) == 0x000001, "Wrong size on NiagaraComponent_SetForceSolo");
static_assert(offsetof(NiagaraComponent_SetForceSolo, bInForceSolo) == 0x000000, "Member 'NiagaraComponent_SetForceSolo::bInForceSolo' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetGpuComputeDebug
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetGpuComputeDebug final
{
public:
	bool                                          bEnableDebug;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetGpuComputeDebug) == 0x000001, "Wrong alignment on NiagaraComponent_SetGpuComputeDebug");
static_assert(sizeof(NiagaraComponent_SetGpuComputeDebug) == 0x000001, "Wrong size on NiagaraComponent_SetGpuComputeDebug");
static_assert(offsetof(NiagaraComponent_SetGpuComputeDebug, bEnableDebug) == 0x000000, "Member 'NiagaraComponent_SetGpuComputeDebug::bEnableDebug' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetKuroCustomTexture
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetKuroCustomTexture final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Texture;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetKuroCustomTexture) == 0x000008, "Wrong alignment on NiagaraComponent_SetKuroCustomTexture");
static_assert(sizeof(NiagaraComponent_SetKuroCustomTexture) == 0x000018, "Wrong size on NiagaraComponent_SetKuroCustomTexture");
static_assert(offsetof(NiagaraComponent_SetKuroCustomTexture, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetKuroCustomTexture::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetKuroCustomTexture, Texture) == 0x000010, "Member 'NiagaraComponent_SetKuroCustomTexture::Texture' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetKuroMaterial
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetKuroMaterial final
{
public:
	class FName                                   InEmitterName;                                     // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Mat;                                               // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetKuroMaterial) == 0x000008, "Wrong alignment on NiagaraComponent_SetKuroMaterial");
static_assert(sizeof(NiagaraComponent_SetKuroMaterial) == 0x000018, "Wrong size on NiagaraComponent_SetKuroMaterial");
static_assert(offsetof(NiagaraComponent_SetKuroMaterial, InEmitterName) == 0x000000, "Member 'NiagaraComponent_SetKuroMaterial::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetKuroMaterial, Mat) == 0x000010, "Member 'NiagaraComponent_SetKuroMaterial::Mat' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetKuroMaterialScalarParametre
// 0x0010 (0x0010 - 0x0000)
struct NiagaraComponent_SetKuroMaterialScalarParametre final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         val;                                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetKuroMaterialScalarParametre) == 0x000004, "Wrong alignment on NiagaraComponent_SetKuroMaterialScalarParametre");
static_assert(sizeof(NiagaraComponent_SetKuroMaterialScalarParametre) == 0x000010, "Wrong size on NiagaraComponent_SetKuroMaterialScalarParametre");
static_assert(offsetof(NiagaraComponent_SetKuroMaterialScalarParametre, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetKuroMaterialScalarParametre::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetKuroMaterialScalarParametre, val) == 0x00000C, "Member 'NiagaraComponent_SetKuroMaterialScalarParametre::val' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetKuroMaterialVectorParametre
// 0x001C (0x001C - 0x0000)
struct NiagaraComponent_SetKuroMaterialVectorParametre final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           vec;                                               // 0x000C(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetKuroMaterialVectorParametre) == 0x000004, "Wrong alignment on NiagaraComponent_SetKuroMaterialVectorParametre");
static_assert(sizeof(NiagaraComponent_SetKuroMaterialVectorParametre) == 0x00001C, "Wrong size on NiagaraComponent_SetKuroMaterialVectorParametre");
static_assert(offsetof(NiagaraComponent_SetKuroMaterialVectorParametre, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetKuroMaterialVectorParametre::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetKuroMaterialVectorParametre, vec) == 0x00000C, "Member 'NiagaraComponent_SetKuroMaterialVectorParametre::vec' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetKuroNiagaraEmitterCustomTexture
// 0x0028 (0x0028 - 0x0000)
struct NiagaraComponent_SetKuroNiagaraEmitterCustomTexture final
{
public:
	class FString                                 InEmitterName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InVariableName;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               Texture;                                           // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetKuroNiagaraEmitterCustomTexture) == 0x000008, "Wrong alignment on NiagaraComponent_SetKuroNiagaraEmitterCustomTexture");
static_assert(sizeof(NiagaraComponent_SetKuroNiagaraEmitterCustomTexture) == 0x000028, "Wrong size on NiagaraComponent_SetKuroNiagaraEmitterCustomTexture");
static_assert(offsetof(NiagaraComponent_SetKuroNiagaraEmitterCustomTexture, InEmitterName) == 0x000000, "Member 'NiagaraComponent_SetKuroNiagaraEmitterCustomTexture::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetKuroNiagaraEmitterCustomTexture, InVariableName) == 0x000010, "Member 'NiagaraComponent_SetKuroNiagaraEmitterCustomTexture::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetKuroNiagaraEmitterCustomTexture, Texture) == 0x000020, "Member 'NiagaraComponent_SetKuroNiagaraEmitterCustomTexture::Texture' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetKuroNiagaraEmitterFloatParam
// 0x0028 (0x0028 - 0x0000)
struct NiagaraComponent_SetKuroNiagaraEmitterFloatParam final
{
public:
	class FString                                 InEmitterName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InVariableName;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraComponent_SetKuroNiagaraEmitterFloatParam) == 0x000008, "Wrong alignment on NiagaraComponent_SetKuroNiagaraEmitterFloatParam");
static_assert(sizeof(NiagaraComponent_SetKuroNiagaraEmitterFloatParam) == 0x000028, "Wrong size on NiagaraComponent_SetKuroNiagaraEmitterFloatParam");
static_assert(offsetof(NiagaraComponent_SetKuroNiagaraEmitterFloatParam, InEmitterName) == 0x000000, "Member 'NiagaraComponent_SetKuroNiagaraEmitterFloatParam::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetKuroNiagaraEmitterFloatParam, InVariableName) == 0x000010, "Member 'NiagaraComponent_SetKuroNiagaraEmitterFloatParam::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetKuroNiagaraEmitterFloatParam, Value) == 0x000020, "Member 'NiagaraComponent_SetKuroNiagaraEmitterFloatParam::Value' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetKuroNiagaraEmitterVectorParam
// 0x0030 (0x0030 - 0x0000)
struct NiagaraComponent_SetKuroNiagaraEmitterVectorParam final
{
public:
	class FString                                 InEmitterName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InVariableName;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               InVector;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetKuroNiagaraEmitterVectorParam) == 0x000010, "Wrong alignment on NiagaraComponent_SetKuroNiagaraEmitterVectorParam");
static_assert(sizeof(NiagaraComponent_SetKuroNiagaraEmitterVectorParam) == 0x000030, "Wrong size on NiagaraComponent_SetKuroNiagaraEmitterVectorParam");
static_assert(offsetof(NiagaraComponent_SetKuroNiagaraEmitterVectorParam, InEmitterName) == 0x000000, "Member 'NiagaraComponent_SetKuroNiagaraEmitterVectorParam::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetKuroNiagaraEmitterVectorParam, InVariableName) == 0x000010, "Member 'NiagaraComponent_SetKuroNiagaraEmitterVectorParam::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetKuroNiagaraEmitterVectorParam, InVector) == 0x000020, "Member 'NiagaraComponent_SetKuroNiagaraEmitterVectorParam::InVector' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetMaterialUseLocalTime
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetMaterialUseLocalTime final
{
public:
	bool                                          InUseLocalTime;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetMaterialUseLocalTime) == 0x000001, "Wrong alignment on NiagaraComponent_SetMaterialUseLocalTime");
static_assert(sizeof(NiagaraComponent_SetMaterialUseLocalTime) == 0x000001, "Wrong size on NiagaraComponent_SetMaterialUseLocalTime");
static_assert(offsetof(NiagaraComponent_SetMaterialUseLocalTime, InUseLocalTime) == 0x000000, "Member 'NiagaraComponent_SetMaterialUseLocalTime::InUseLocalTime' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetMaxSimTime
// 0x0004 (0x0004 - 0x0000)
struct NiagaraComponent_SetMaxSimTime final
{
public:
	float                                         InMaxTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetMaxSimTime) == 0x000004, "Wrong alignment on NiagaraComponent_SetMaxSimTime");
static_assert(sizeof(NiagaraComponent_SetMaxSimTime) == 0x000004, "Wrong size on NiagaraComponent_SetMaxSimTime");
static_assert(offsetof(NiagaraComponent_SetMaxSimTime, InMaxTime) == 0x000000, "Member 'NiagaraComponent_SetMaxSimTime::InMaxTime' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableActor
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableActor final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableActor) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableActor");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableActor) == 0x000018, "Wrong size on NiagaraComponent_SetNiagaraVariableActor");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableActor, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableActor::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableActor, Actor) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableActor::Actor' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableBool
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableBool final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InValue;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableBool) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableBool");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableBool) == 0x000018, "Wrong size on NiagaraComponent_SetNiagaraVariableBool");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableBool, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableBool::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableBool, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableBool::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableFloat
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableFloat final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableFloat) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableFloat");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableFloat) == 0x000018, "Wrong size on NiagaraComponent_SetNiagaraVariableFloat");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableFloat, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableFloat::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableFloat, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableFloat::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableInt
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableInt final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InValue;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableInt) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableInt");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableInt) == 0x000018, "Wrong size on NiagaraComponent_SetNiagaraVariableInt");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableInt, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableInt::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableInt, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableInt::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableLinearColor
// 0x0020 (0x0020 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableLinearColor final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InValue;                                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableLinearColor) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableLinearColor");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableLinearColor) == 0x000020, "Wrong size on NiagaraComponent_SetNiagaraVariableLinearColor");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableLinearColor, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableLinearColor::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableLinearColor, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableLinearColor::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableObject
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableObject final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Object;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableObject) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableObject");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableObject) == 0x000018, "Wrong size on NiagaraComponent_SetNiagaraVariableObject");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableObject, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableObject::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableObject, Object) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableObject::Object' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableQuat
// 0x0020 (0x0020 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableQuat final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  InValue;                                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableQuat) == 0x000010, "Wrong alignment on NiagaraComponent_SetNiagaraVariableQuat");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableQuat) == 0x000020, "Wrong size on NiagaraComponent_SetNiagaraVariableQuat");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableQuat, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableQuat::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableQuat, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableQuat::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableVec2
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableVec2 final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InValue;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableVec2) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableVec2");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableVec2) == 0x000018, "Wrong size on NiagaraComponent_SetNiagaraVariableVec2");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableVec2, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableVec2::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableVec2, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableVec2::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableVec3
// 0x0020 (0x0020 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableVec3 final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InValue;                                           // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableVec3) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableVec3");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableVec3) == 0x000020, "Wrong size on NiagaraComponent_SetNiagaraVariableVec3");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableVec3, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableVec3::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableVec3, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableVec3::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableVec4
// 0x0020 (0x0020 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableVec4 final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               InValue;                                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableVec4) == 0x000010, "Wrong alignment on NiagaraComponent_SetNiagaraVariableVec4");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableVec4) == 0x000020, "Wrong size on NiagaraComponent_SetNiagaraVariableVec4");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableVec4, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableVec4::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableVec4, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableVec4::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetPaused
// 0x0002 (0x0002 - 0x0000)
struct NiagaraComponent_SetPaused final
{
public:
	bool                                          bInPaused;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNotify;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetPaused) == 0x000001, "Wrong alignment on NiagaraComponent_SetPaused");
static_assert(sizeof(NiagaraComponent_SetPaused) == 0x000002, "Wrong size on NiagaraComponent_SetPaused");
static_assert(offsetof(NiagaraComponent_SetPaused, bInPaused) == 0x000000, "Member 'NiagaraComponent_SetPaused::bInPaused' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetPaused, bNotify) == 0x000001, "Member 'NiagaraComponent_SetPaused::bNotify' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetPreviewLODDistance
// 0x0008 (0x0008 - 0x0000)
struct NiagaraComponent_SetPreviewLODDistance final
{
public:
	bool                                          bEnablePreviewLODDistance;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreviewLODDistance;                                // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetPreviewLODDistance) == 0x000004, "Wrong alignment on NiagaraComponent_SetPreviewLODDistance");
static_assert(sizeof(NiagaraComponent_SetPreviewLODDistance) == 0x000008, "Wrong size on NiagaraComponent_SetPreviewLODDistance");
static_assert(offsetof(NiagaraComponent_SetPreviewLODDistance, bEnablePreviewLODDistance) == 0x000000, "Member 'NiagaraComponent_SetPreviewLODDistance::bEnablePreviewLODDistance' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetPreviewLODDistance, PreviewLODDistance) == 0x000004, "Member 'NiagaraComponent_SetPreviewLODDistance::PreviewLODDistance' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetRenderingEnabled
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetRenderingEnabled final
{
public:
	bool                                          bInRenderingEnabled;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetRenderingEnabled) == 0x000001, "Wrong alignment on NiagaraComponent_SetRenderingEnabled");
static_assert(sizeof(NiagaraComponent_SetRenderingEnabled) == 0x000001, "Wrong size on NiagaraComponent_SetRenderingEnabled");
static_assert(offsetof(NiagaraComponent_SetRenderingEnabled, bInRenderingEnabled) == 0x000000, "Member 'NiagaraComponent_SetRenderingEnabled::bInRenderingEnabled' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetRuntimeEffectType
// 0x0008 (0x0008 - 0x0000)
struct NiagaraComponent_SetRuntimeEffectType final
{
public:
	class UNiagaraEffectType*                     EffectType;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetRuntimeEffectType) == 0x000008, "Wrong alignment on NiagaraComponent_SetRuntimeEffectType");
static_assert(sizeof(NiagaraComponent_SetRuntimeEffectType) == 0x000008, "Wrong size on NiagaraComponent_SetRuntimeEffectType");
static_assert(offsetof(NiagaraComponent_SetRuntimeEffectType, EffectType) == 0x000000, "Member 'NiagaraComponent_SetRuntimeEffectType::EffectType' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetSeekDelta
// 0x0004 (0x0004 - 0x0000)
struct NiagaraComponent_SetSeekDelta final
{
public:
	float                                         InSeekDelta;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetSeekDelta) == 0x000004, "Wrong alignment on NiagaraComponent_SetSeekDelta");
static_assert(sizeof(NiagaraComponent_SetSeekDelta) == 0x000004, "Wrong size on NiagaraComponent_SetSeekDelta");
static_assert(offsetof(NiagaraComponent_SetSeekDelta, InSeekDelta) == 0x000000, "Member 'NiagaraComponent_SetSeekDelta::InSeekDelta' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetTickBehavior
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetTickBehavior final
{
public:
	ENiagaraTickBehavior                          NewTickBehavior;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetTickBehavior) == 0x000001, "Wrong alignment on NiagaraComponent_SetTickBehavior");
static_assert(sizeof(NiagaraComponent_SetTickBehavior) == 0x000001, "Wrong size on NiagaraComponent_SetTickBehavior");
static_assert(offsetof(NiagaraComponent_SetTickBehavior, NewTickBehavior) == 0x000000, "Member 'NiagaraComponent_SetTickBehavior::NewTickBehavior' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetTickTimeDilation
// 0x0004 (0x0004 - 0x0000)
struct NiagaraComponent_SetTickTimeDilation final
{
public:
	float                                         InTimeDilation;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetTickTimeDilation) == 0x000004, "Wrong alignment on NiagaraComponent_SetTickTimeDilation");
static_assert(sizeof(NiagaraComponent_SetTickTimeDilation) == 0x000004, "Wrong size on NiagaraComponent_SetTickTimeDilation");
static_assert(offsetof(NiagaraComponent_SetTickTimeDilation, InTimeDilation) == 0x000000, "Member 'NiagaraComponent_SetTickTimeDilation::InTimeDilation' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableActor
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetVariableActor final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableActor) == 0x000008, "Wrong alignment on NiagaraComponent_SetVariableActor");
static_assert(sizeof(NiagaraComponent_SetVariableActor) == 0x000018, "Wrong size on NiagaraComponent_SetVariableActor");
static_assert(offsetof(NiagaraComponent_SetVariableActor, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableActor::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableActor, Actor) == 0x000010, "Member 'NiagaraComponent_SetVariableActor::Actor' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableBool
// 0x0010 (0x0010 - 0x0000)
struct NiagaraComponent_SetVariableBool final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InValue;                                           // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraComponent_SetVariableBool) == 0x000004, "Wrong alignment on NiagaraComponent_SetVariableBool");
static_assert(sizeof(NiagaraComponent_SetVariableBool) == 0x000010, "Wrong size on NiagaraComponent_SetVariableBool");
static_assert(offsetof(NiagaraComponent_SetVariableBool, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableBool::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableBool, InValue) == 0x00000C, "Member 'NiagaraComponent_SetVariableBool::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableFloat
// 0x0010 (0x0010 - 0x0000)
struct NiagaraComponent_SetVariableFloat final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableFloat) == 0x000004, "Wrong alignment on NiagaraComponent_SetVariableFloat");
static_assert(sizeof(NiagaraComponent_SetVariableFloat) == 0x000010, "Wrong size on NiagaraComponent_SetVariableFloat");
static_assert(offsetof(NiagaraComponent_SetVariableFloat, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableFloat::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableFloat, InValue) == 0x00000C, "Member 'NiagaraComponent_SetVariableFloat::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableInt
// 0x0010 (0x0010 - 0x0000)
struct NiagaraComponent_SetVariableInt final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InValue;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableInt) == 0x000004, "Wrong alignment on NiagaraComponent_SetVariableInt");
static_assert(sizeof(NiagaraComponent_SetVariableInt) == 0x000010, "Wrong size on NiagaraComponent_SetVariableInt");
static_assert(offsetof(NiagaraComponent_SetVariableInt, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableInt::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableInt, InValue) == 0x00000C, "Member 'NiagaraComponent_SetVariableInt::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableLinearColor
// 0x001C (0x001C - 0x0000)
struct NiagaraComponent_SetVariableLinearColor final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InValue;                                           // 0x000C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableLinearColor) == 0x000004, "Wrong alignment on NiagaraComponent_SetVariableLinearColor");
static_assert(sizeof(NiagaraComponent_SetVariableLinearColor) == 0x00001C, "Wrong size on NiagaraComponent_SetVariableLinearColor");
static_assert(offsetof(NiagaraComponent_SetVariableLinearColor, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableLinearColor::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableLinearColor, InValue) == 0x00000C, "Member 'NiagaraComponent_SetVariableLinearColor::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableMaterial
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetVariableMaterial final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Object;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableMaterial) == 0x000008, "Wrong alignment on NiagaraComponent_SetVariableMaterial");
