#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "Niagara_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieScene_classes.hpp"
#include "NiagaraShader_classes.hpp"
#include "NiagaraCore_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class Niagara.NiagaraDataInterface
// 0x0010 (0x0040 - 0x0030)
class UNiagaraDataInterface : public UNiagaraDataInterfaceBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterface")
	}
	static class UNiagaraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterface>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterface;

// Class Niagara.NiagaraDataInterfaceCurlNoise
// 0x0010 (0x0050 - 0x0040)
class UNiagaraDataInterfaceCurlNoise final : public UNiagaraDataInterface
{
public:
	uint32                                        Seed;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceCurlNoise")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceCurlNoise")
	}
	static class UNiagaraDataInterfaceCurlNoise* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCurlNoise>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceCurlNoise;

// Class Niagara.NiagaraComponent
// 0x0210 (0x0740 - 0x0530)
#pragma pack(push, 0x1)
class alignas(0x10) UNiagaraComponent : public UFXSystemComponent
{
public:
	class UNiagaraSystem*                         Asset;                                             // 0x0528(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraTickBehavior                          TickBehavior;                                      // 0x0530(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraUserRedirectionParameterStore  OverrideParameters;                                // 0x0538(0x00C8)(NativeAccessSpecifierPrivate)
	uint8                                         bForceSolo : 1;                                    // 0x0600(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bEnableGpuComputeDebug : 1;                        // 0x0600(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         BitPad_600_2 : 6;                                  // 0x0600(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_601[0x37];                                     // 0x0601(0x0037)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAutoDestroy : 1;                                  // 0x0638(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bRenderingEnabled : 1;                             // 0x0638(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraEffectType*                     RuntimeEffectType;                                 // 0x0640(0x0008)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bAutoManageAttachment : 1;                         // 0x0648(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAutoAttachWeldSimulatedBodies : 1;                // 0x0648(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_649[0x3];                                      // 0x0649(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxTimeBeforeForceUpdateTransform;                 // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NiagaraEffectType;                                 // 0x0650(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNiagaraMaterialOverride>       EmitterMaterials;                                  // 0x0658(0x0010)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, NativeAccessSpecifierPublic)
	float                                         KuroGlobalScale;                                   // 0x0668(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           KuroGlobalColor;                                   // 0x066C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KuroGlobalAlpha;                                   // 0x067C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_680[0x28];                                     // 0x0680(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UNiagaraComponent* PSystem, bool IsPaused)> OnSystemInstancePausedDelegate; // 0x06A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UNiagaraComponent* PSystem)> OnSystemFinished;               // 0x06B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USceneComponent>         AutoAttachParent;                                  // 0x06C8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AutoAttachSocketName;                              // 0x06D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachLocationRule;                            // 0x06DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachRotationRule;                            // 0x06DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachScaleRule;                               // 0x06DE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6DF[0x59];                                     // 0x06DF(0x0059)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AdvanceSimulation(int32 TickCount, float TickDeltaSeconds);
	void AdvanceSimulationByTime(float SimulateTime, float TickDeltaSeconds);
	class UNiagaraEffectType* GetActualEffectType();
	class UNiagaraDataInterface* GetDataInterface(const class FString& Name_0);
	TArray<struct FVector> GetNiagaraParticlePositions_DebugOnly(const class FString& InEmitterName);
	TArray<float> GetNiagaraParticleValues_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	TArray<struct FVector> GetNiagaraParticleValueVec3_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	class UNiagaraEffectType* GetRuntimeEffectType();
	bool HasAnyEmittersComplete();
	bool HasSkeletalMeshDataInterface();
	void ReinitializeSystem();
	bool ResetOverrideParametersAndActivate(bool bReset, const class FString& ExceptOverrideName);
	void ResetSystem();
	void SeekToDesiredAge(float InDesiredAge);
	void SetAgeUpdateMode(ENiagaraAgeUpdateMode InAgeUpdateMode);
	void SetAllowScalability(bool bAllow);
	void SetAsset(class UNiagaraSystem* InAsset);
	void SetAutoDestroy(bool bInAutoDestroy);
	void SetCanRenderWhileSeeking(bool bInCanRenderWhileSeeking);
	void SetDesiredAge(float InDesiredAge);
	void SetEmitterQualityLevelBias(int32 InBias);
	void SetForceSolo(bool bInForceSolo);
	void SetGpuComputeDebug(bool bEnableDebug);
	void SetKuroCustomTexture(class FName InVariableName, class UTexture* Texture);
	void SetKuroMaterial(class FName InEmitterName, class UMaterialInterface* Mat);
	void SetKuroMaterialScalarParametre(class FName InVariableName, float val);
	void SetKuroMaterialVectorParametre(class FName InVariableName, struct FLinearColor* vec);
	void SetKuroNiagaraEmitterCustomTexture(const class FString& InEmitterName, const class FString& InVariableName, class UTexture* Texture);
	void SetKuroNiagaraEmitterFloatParam(const class FString& InEmitterName, const class FString& InVariableName, float Value);
	void SetKuroNiagaraEmitterVectorParam(const class FString& InEmitterName, const class FString& InVariableName, const struct FVector4& InVector);
	void SetMaterialUseLocalTime(bool InUseLocalTime);
	void SetMaxSimTime(float InMaxTime);
	void SetNiagaraVariableActor(const class FString& InVariableName, class AActor* Actor);
	void SetNiagaraVariableBool(const class FString& InVariableName, bool InValue);
	void SetNiagaraVariableFloat(const class FString& InVariableName, float InValue);
	void SetNiagaraVariableInt(const class FString& InVariableName, int32 InValue);
	void SetNiagaraVariableLinearColor(const class FString& InVariableName, const struct FLinearColor& InValue);
	void SetNiagaraVariableObject(const class FString& InVariableName, class UObject* Object);
	void SetNiagaraVariableQuat(const class FString& InVariableName, const struct FQuat& InValue);
	void SetNiagaraVariableVec2(const class FString& InVariableName, const struct FVector2D& InValue);
	void SetNiagaraVariableVec3(const class FString& InVariableName, const struct FVector& InValue);
	void SetNiagaraVariableVec4(const class FString& InVariableName, const struct FVector4& InValue);
	void SetPaused(bool bInPaused, bool bNotify);
	void SetPreviewLODDistance(bool bEnablePreviewLODDistance, float PreviewLODDistance);
	void SetRenderingEnabled(bool bInRenderingEnabled);
	void SetRuntimeEffectType(class UNiagaraEffectType* EffectType);
	void SetSeekDelta(float InSeekDelta);
	void SetTickBehavior(ENiagaraTickBehavior NewTickBehavior);
	void SetTickTimeDilation(float InTimeDilation);
	void SetVariableActor(class FName InVariableName, class AActor* Actor);
	void SetVariableBool(class FName InVariableName, bool InValue);
	void SetVariableFloat(class FName InVariableName, float InValue);
	void SetVariableInt(class FName InVariableName, int32 InValue);
	void SetVariableLinearColor(class FName InVariableName, const struct FLinearColor& InValue);
	void SetVariableMaterial(class FName InVariableName, class UMaterialInterface* Object);
	void SetVariableObject(class FName InVariableName, class UObject* Object);
	void SetVariableQuat(class FName InVariableName, const struct FQuat& InValue);
	void SetVariableTextureRenderTarget(class FName InVariableName, class UTextureRenderTarget* TextureRenderTarget);
	void SetVariableVec2(class FName InVariableName, const struct FVector2D& InValue);
	void SetVariableVec3(class FName InVariableName, const struct FVector& InValue);
	void SetVariableVec4(class FName InVariableName, const struct FVector4& InValue);
	void SetVisibleInRayTracing(bool NewValue);

	ENiagaraAgeUpdateMode GetAgeUpdateMode() const;
	class UNiagaraSystem* GetAsset() const;
	float GetDesiredAge() const;
	bool GetForceSolo() const;
	float GetMaxSimTime() const;
	int32 GetPreviewLODDistance() const;
	bool GetPreviewLODDistanceEnabled() const;
	float GetSeekDelta() const;
	ENiagaraTickBehavior GetTickBehavior() const;
	bool IsPaused() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraComponent")
	}
	static class UNiagaraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UNiagaraComponent;

// Class Niagara.MovieSceneNiagaraTrack
// 0x0010 (0x00A8 - 0x0098)
class UMovieSceneNiagaraTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0098(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraTrack")
	}
	static class UMovieSceneNiagaraTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraTrack;

// Class Niagara.MovieSceneNiagaraParameterTrack
// 0x0020 (0x00C8 - 0x00A8)
class UMovieSceneNiagaraParameterTrack : public UMovieSceneNiagaraTrack
{
public:
	struct FNiagaraVariable                       Parameter;                                         // 0x00A8(0x0020)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraParameterTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraParameterTrack")
	}
	static class UMovieSceneNiagaraParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraParameterTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraParameterTrack;

// Class Niagara.NiagaraParticleCallbackHandler
// 0x0000 (0x0000 - 0x0000)
class INiagaraParticleCallbackHandler final
{
public:
	void ReceiveParticleData(const TArray<struct FBasicParticleData>& Data, class UNiagaraSystem* NiagaraSystem);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraParticleCallbackHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraParticleCallbackHandler")
	}
	static class INiagaraParticleCallbackHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<INiagaraParticleCallbackHandler>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_INiagaraParticleCallbackHandler;

// Class Niagara.KuroNDCEffectInstance
// 0x0030 (0x02E0 - 0x02B0)
class AKuroNDCEffectInstance final : public AActor
{
public:
	TWeakObjectPtr<class USceneComponent>         GroupRootCmp;                                      // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraDataChannelAsset*               DataChannelAsset;                                  // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnRate;                                         // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RandomDelayTimeScale;                              // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C8[0x10];                                     // 0x02C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneComponent;                                    // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroNDCEffectInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroNDCEffectInstance")
	}
	static class AKuroNDCEffectInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroNDCEffectInstance>();
	}
};
DUMPER7_ASSERTS_AKuroNDCEffectInstance;

// Class Niagara.NiagaraRendererProperties
// 0x0058 (0x0088 - 0x0030)
class UNiagaraRendererProperties : public UNiagaraMergeable
{
public:
	struct FNiagaraPlatformSet                    Platforms;                                         // 0x0030(0x0030)(Edit, NativeAccessSpecifierPublic)
	int32                                         SortOrderHint;                                     // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMotionBlurEnabled;                                // 0x0065(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_66[0x22];                                      // 0x0066(0x0022)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraRendererProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraRendererProperties")
	}
	static class UNiagaraRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraRendererProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraRendererProperties;

// Class Niagara.NiagaraSpriteRendererProperties
// 0x0748 (0x07D0 - 0x0088)
class UNiagaraSpriteRendererProperties final : public UNiagaraRendererProperties
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0088(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRendererSourceDataMode                SourceMode;                                        // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraUserParameterBinding           MaterialUserParamBinding;                          // 0x0098(0x0020)(Edit, NativeAccessSpecifierPublic)
	ENiagaraSpriteAlignment                       Alignment;                                         // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraSpriteFacingMode                      FacingMode;                                        // 0x00B9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PivotInUVSpace;                                    // 0x00BC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseScreenEffectMode : 1;                          // 0x00C4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpriteEffectDepth;                                 // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SpriteEffectOffset;                                // 0x00CC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpriteSortID;                                      // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseFixedBoundsForScreenEffect : 1;                // 0x00D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ENiagaraSortMode                              SortMode;                                          // 0x00DC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SubImageSize;                                      // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bSubImageBlend : 1;                                // 0x00E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRemoveHMDRollInVR : 1;                            // 0x00E8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSortOnlyWhenTranslucent : 1;                      // 0x00E8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bGpuLowLatencyTranslucency : 1;                    // 0x00E8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinFacingCameraBlendDistance;                      // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxFacingCameraBlendDistance;                      // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableCameraDistanceCulling : 1;                  // 0x00F4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinCameraDistance;                                 // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxCameraDistance;                                 // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        RendererVisibility;                                // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraVariableAttributeBinding       PositionBinding;                                   // 0x0108(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       ColorBinding;                                      // 0x0160(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       VelocityBinding;                                   // 0x01B8(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       SpriteRotationBinding;                             // 0x0210(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       SpriteSizeBinding;                                 // 0x0268(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       SpriteFacingBinding;                               // 0x02C0(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       SpriteAlignmentBinding;                            // 0x0318(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       SubImageIndexBinding;                              // 0x0370(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterialBinding;                            // 0x03C8(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial1Binding;                           // 0x0420(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial2Binding;                           // 0x0478(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial3Binding;                           // 0x04D0(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       CameraOffsetBinding;                               // 0x0528(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       UVScaleBinding;                                    // 0x0580(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       MaterialRandomBinding;                             // 0x05D8(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       CustomSortingBinding;                              // 0x0630(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       NormalizedAgeBinding;                              // 0x0688(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RendererVisibilityTagBinding;                      // 0x06E0(0x0058)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraMaterialAttributeBinding> MaterialParameterBindings;                       // 0x0738(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_748[0x88];                                     // 0x0748(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraSpriteRendererProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraSpriteRendererProperties")
	}
	static class UNiagaraSpriteRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraSpriteRendererProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraSpriteRendererProperties;

// Class Niagara.MovieSceneNiagaraBoolParameterTrack
// 0x0008 (0x00D0 - 0x00C8)
class UMovieSceneNiagaraBoolParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraBoolParameterTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraBoolParameterTrack")
	}
	static class UMovieSceneNiagaraBoolParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraBoolParameterTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraBoolParameterTrack;

// Class Niagara.NiagaraDataInterfaceExport
// 0x0030 (0x0070 - 0x0040)
class UNiagaraDataInterfaceExport final : public UNiagaraDataInterface
{
public:
	struct FNiagaraUserParameterBinding           CallbackHandlerParameter;                          // 0x0040(0x0020)(Edit, NativeAccessSpecifierPublic)
	ENDIExport_GPUAllocationMode                  GPUAllocationMode;                                 // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GPUAllocationFixedSize;                            // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GPUAllocationPerParticleSize;                      // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceExport")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceExport")
	}
	static class UNiagaraDataInterfaceExport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceExport>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceExport;

// Class Niagara.KuroNDCEffectGroup
// 0x0020 (0x02D0 - 0x02B0)
class AKuroNDCEffectGroup final : public AActor
{
public:
	bool                                          bDrawDebugBound;                                   // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DrawDebugSelfCollisionColor;                       // 0x02B4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneComponent;                                    // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroNDCEffectGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroNDCEffectGroup")
	}
	static class AKuroNDCEffectGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKuroNDCEffectGroup>();
	}
};
DUMPER7_ASSERTS_AKuroNDCEffectGroup;

// Class Niagara.MovieSceneNiagaraColorParameterTrack
// 0x0008 (0x00D0 - 0x00C8)
class UMovieSceneNiagaraColorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraColorParameterTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraColorParameterTrack")
	}
	static class UMovieSceneNiagaraColorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraColorParameterTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraColorParameterTrack;

// Class Niagara.NiagaraDataInterfaceGBuffer
// 0x0000 (0x0040 - 0x0040)
class UNiagaraDataInterfaceGBuffer final : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceGBuffer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceGBuffer")
	}
	static class UNiagaraDataInterfaceGBuffer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceGBuffer>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceGBuffer;

// Class Niagara.KuroNiagaraTickType
// 0x0010 (0x0040 - 0x0030)
class UKuroNiagaraTickType final : public UObject
{
public:
	TArray<struct FKuroTickByDistanceSetting>     Settings;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KuroNiagaraTickType")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KuroNiagaraTickType")
	}
	static class UKuroNiagaraTickType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroNiagaraTickType>();
	}
};
DUMPER7_ASSERTS_UKuroNiagaraTickType;

// Class Niagara.MovieSceneNiagaraFloatParameterTrack
// 0x0008 (0x00D0 - 0x00C8)
class UMovieSceneNiagaraFloatParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraFloatParameterTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraFloatParameterTrack")
	}
	static class UMovieSceneNiagaraFloatParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraFloatParameterTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraFloatParameterTrack;

// Class Niagara.MovieSceneNiagaraIntegerParameterTrack
// 0x0008 (0x00D0 - 0x00C8)
class UMovieSceneNiagaraIntegerParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraIntegerParameterTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraIntegerParameterTrack")
	}
	static class UMovieSceneNiagaraIntegerParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraIntegerParameterTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraIntegerParameterTrack;

// Class Niagara.MovieSceneNiagaraSystemSpawnSection
// 0x0010 (0x0108 - 0x00F8)
class UMovieSceneNiagaraSystemSpawnSection final : public UMovieSceneSection
{
public:
	ENiagaraSystemSpawnSectionStartBehavior       SectionStartBehavior;                              // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEvaluateBehavior    SectionEvaluateBehavior;                           // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEndBehavior         SectionEndBehavior;                                // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraAgeUpdateMode                         AgeUpdateMode;                                     // 0x0104(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraSystemSpawnSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraSystemSpawnSection")
	}
	static class UMovieSceneNiagaraSystemSpawnSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemSpawnSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraSystemSpawnSection;

// Class Niagara.MovieSceneNiagaraSystemTrack
// 0x0008 (0x00B0 - 0x00A8)
class UMovieSceneNiagaraSystemTrack final : public UMovieSceneNiagaraTrack
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraSystemTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraSystemTrack")
	}
	static class UMovieSceneNiagaraSystemTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraSystemTrack;

// Class Niagara.MovieSceneNiagaraTimeTrack
// 0x0008 (0x00B0 - 0x00A8)
class UMovieSceneNiagaraTimeTrack final : public UMovieSceneNiagaraTrack
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraTimeTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraTimeTrack")
	}
	static class UMovieSceneNiagaraTimeTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraTimeTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraTimeTrack;

// Class Niagara.MovieSceneNiagaraVectorParameterTrack
// 0x0010 (0x00D8 - 0x00C8)
class UMovieSceneNiagaraVectorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ChannelsUsed;                                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraVectorParameterTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraVectorParameterTrack")
	}
	static class UMovieSceneNiagaraVectorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraVectorParameterTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraVectorParameterTrack;

// Class Niagara.NiagaraActor
// 0x0010 (0x02C0 - 0x02B0)
class ANiagaraActor final : public AActor
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bDestroyOnSystemFinish : 1;                        // 0x02B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNiagaraSystemFinished(class UNiagaraComponent* FinishedComponent);
	void SetDestroyOnSystemFinish(bool bShouldDestroyOnSystemFinish);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraActor")
	}
	static class ANiagaraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANiagaraActor>();
	}
};
DUMPER7_ASSERTS_ANiagaraActor;

// Class Niagara.NiagaraComponentPool
// 0x0058 (0x0088 - 0x0030)
class UNiagaraComponentPool final : public UObject
{
public:
	TMap<class UNiagaraSystem*, struct FNCPool>   WorldParticleSystemPools;                          // 0x0030(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraComponentPool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraComponentPool")
	}
	static class UNiagaraComponentPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentPool>();
	}
};
DUMPER7_ASSERTS_UNiagaraComponentPool;

// Class Niagara.NiagaraComponentRendererProperties
// 0x00E0 (0x0168 - 0x0088)
class UNiagaraComponentRendererProperties final : public UNiagaraRendererProperties
{
public:
	TSubclassOf<class USceneComponent>            ComponentType;                                     // 0x0088(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ComponentCountLimit;                               // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraVariableAttributeBinding       EnabledBinding;                                    // 0x0098(0x0058)(Edit, NativeAccessSpecifierPublic)
	bool                                          bAssignComponentsOnParticleID;                     // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyCreateComponentsOnParticleSpawn;              // 0x00F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        TemplateComponent;                                 // 0x00F8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraComponentPropertyBinding> PropertyBindings;                                // 0x0100(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x58];                                     // 0x0110(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraComponentRendererProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraComponentRendererProperties")
	}
	static class UNiagaraComponentRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentRendererProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraComponentRendererProperties;

// Class Niagara.NiagaraComponentSettings
// 0x00F0 (0x0120 - 0x0030)
class UNiagaraComponentSettings final : public UObject
{
public:
	TSet<class FName>                             SuppressActivationList;                            // 0x0030(0x0050)(Config, NativeAccessSpecifierPublic)
	TSet<class FName>                             ForceAutoPooolingList;                             // 0x0080(0x0050)(Config, NativeAccessSpecifierPublic)
	TSet<struct FNiagaraEmitterNameSettingsRef>   SuppressEmitterList;                               // 0x00D0(0x0050)(Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraComponentSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraComponentSettings")
	}
	static class UNiagaraComponentSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentSettings>();
	}
};
DUMPER7_ASSERTS_UNiagaraComponentSettings;

// Class Niagara.NiagaraConvertInPlaceUtilityBase
// 0x0000 (0x0030 - 0x0030)
class UNiagaraConvertInPlaceUtilityBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraConvertInPlaceUtilityBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraConvertInPlaceUtilityBase")
	}
	static class UNiagaraConvertInPlaceUtilityBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraConvertInPlaceUtilityBase>();
	}
};
DUMPER7_ASSERTS_UNiagaraConvertInPlaceUtilityBase;

// Class Niagara.NiagaraDataChannel
// 0x0100 (0x0130 - 0x0030)
class UNiagaraDataChannel : public UObject
{
public:
	TArray<struct FNiagaraDataChannelVariable>    ChannelVariables;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bKeepPreviousFrameData;                            // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnforceTickGroupReadWriteOrder;                   // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ETickingGroup                                 FinalWriteTickGroup;                               // 0x0042(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraDataSetCompiledData            CompiledData;                                      // 0x0048(0x0048)(Transient, NativeAccessSpecifierPrivate)
	struct FNiagaraDataSetCompiledData            CompiledDataGPU;                                   // 0x0090(0x0048)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x58];                                      // 0x00D8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannel")
	}
	static class UNiagaraDataChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannel>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannel;

// Class Niagara.NiagaraDataChannelLibrary
// 0x0000 (0x0030 - 0x0030)
class UNiagaraDataChannelLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetDataChannelElementCount(const class UObject* WorldContextObject, const class UNiagaraDataChannelAsset* Channel, const struct FNiagaraDataChannelSearchParameters& SearchParams, bool bReadPreviousFrame);
	static class UNiagaraDataChannelHandler* GetNiagaraDataChannel(const class UObject* WorldContextObject, const class UNiagaraDataChannelAsset* Channel);
	static class UNiagaraDataChannelReader* ReadFromNiagaraDataChannel(const class UObject* WorldContextObject, const class UNiagaraDataChannelAsset* Channel, const struct FNiagaraDataChannelSearchParameters& SearchParams, bool bReadPreviousFrame);
	static void ReadFromNiagaraDataChannelSingle(const class UObject* WorldContextObject, const class UNiagaraDataChannelAsset* Channel, int32 Index_0, const struct FNiagaraDataChannelSearchParameters& SearchParams, bool bReadPreviousFrame, ENiagartaDataChannelReadResult* ReadResult);
	static class UNiagaraDataChannelWriter* WriteToNiagaraDataChannel(const class UObject* WorldContextObject, const class UNiagaraDataChannelAsset* Channel, const struct FNiagaraDataChannelSearchParameters& SearchParams, int32 Count, bool bVisibleToGame, bool bVisibleToCPU, bool bVisibleToGPU, const class FString& DebugSource);
	static void WriteToNiagaraDataChannelSingle(const class UObject* WorldContextObject, const class UNiagaraDataChannelAsset* Channel, const struct FNiagaraDataChannelSearchParameters& SearchParams, bool bVisibleToBlueprint, bool bVisibleToNiagaraCPU, bool bVisibleToNiagaraGPU);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannelLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannelLibrary")
	}
	static class UNiagaraDataChannelLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelLibrary>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannelLibrary;

// Class Niagara.NiagaraDataChannel_Global
// 0x0000 (0x0130 - 0x0130)
class UNiagaraDataChannel_Global final : public UNiagaraDataChannel
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannel_Global")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannel_Global")
	}
	static class UNiagaraDataChannel_Global* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannel_Global>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannel_Global;

// Class Niagara.NiagaraDataChannelHandler
// 0x0020 (0x0050 - 0x0030)
class UNiagaraDataChannelHandler : public UObject
{
public:
	TWeakObjectPtr<class UNiagaraDataChannel>     DataChannel;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraDataChannelWriter*              Writer;                                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraDataChannelReader*              Reader;                                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UNiagaraDataChannelReader* GetDataChannelReader();
	class UNiagaraDataChannelWriter* GetDataChannelWriter();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannelHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannelHandler")
	}
	static class UNiagaraDataChannelHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelHandler>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannelHandler;

// Class Niagara.NiagaraDataChannelHandler_Global
// 0x0010 (0x0060 - 0x0050)
class UNiagaraDataChannelHandler_Global final : public UNiagaraDataChannelHandler
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannelHandler_Global")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannelHandler_Global")
	}
	static class UNiagaraDataChannelHandler_Global* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelHandler_Global>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannelHandler_Global;

// Class Niagara.NiagaraDataChannel_Islands
// 0x0060 (0x0190 - 0x0130)
class UNiagaraDataChannel_Islands final : public UNiagaraDataChannel
{
public:
	ENiagraDataChannel_IslandMode                 Mode;                                              // 0x0130(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InitialExtents;                                    // 0x0134(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                MaxExtents;                                        // 0x0140(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PerElementExtents;                                 // 0x014C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UNiagaraSystem>>  Systems;                                           // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	int32                                         IslandPoolSize;                                    // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNDCIslandDebugDrawSettings            DebugDrawSettings;                                 // 0x016C(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UNiagaraSystem*>                 SystemsInternal;                                   // 0x0170(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_180[0x10];                                     // 0x0180(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannel_Islands")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannel_Islands")
	}
	static class UNiagaraDataChannel_Islands* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannel_Islands>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannel_Islands;

// Class Niagara.NiagaraDataChannelHandler_Islands
// 0x0030 (0x0080 - 0x0050)
class UNiagaraDataChannelHandler_Islands final : public UNiagaraDataChannelHandler
{
public:
	TArray<int32>                                 ActiveIslandsArray;                                // 0x0050(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 FreeIslands;                                       // 0x0060(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FNDCIsland>                     IslandPool;                                        // 0x0070(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannelHandler_Islands")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannelHandler_Islands")
	}
	static class UNiagaraDataChannelHandler_Islands* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelHandler_Islands>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannelHandler_Islands;

// Class Niagara.NiagaraDataChannel_Placement
// 0x0070 (0x01A0 - 0x0130)
class UNiagaraDataChannel_Placement final : public UNiagaraDataChannel
{
public:
	ENiagraDataChannel_PlacementMode              Mode;                                              // 0x0130(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InitialExtents;                                    // 0x0134(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PerElementExtents;                                 // 0x0140(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          System;                                            // 0x0150(0x0030)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNDCPlacementDebugDrawSettings         DebugDrawSettings;                                 // 0x0180(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         SystemsInternal;                                   // 0x0188(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_190[0x10];                                     // 0x0190(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannel_Placement")
	}
	static const class FName& StaticName()
	{
