#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NiagaraCore_structs.hpp"
#include "NiagaraShader_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum Niagara.EKuroNiagaraTickTypePresets
// NumValues: 0x0006
enum class EKuroNiagaraTickTypePresets : uint8
{
	Normal                                   = 0,
	Slow                                     = 1,
	Fast                                     = 2,
	Important                                = 3,
	TickTypePresetsCount                     = 4,
	EKuroNiagaraTickTypePresets_MAX          = 5,
};

// Enum Niagara.EKuroNiagaraEffectTypePresets
// NumValues: 0x0006
enum class EKuroNiagaraEffectTypePresets : uint8
{
	Normal                                   = 0,
	Scene                                    = 1,
	FarSkill                                 = 2,
	Important                                = 3,
	ScalabilityPresetsCount                  = 4,
	EKuroNiagaraEffectTypePresets_MAX        = 5,
};

// Enum Niagara.EKuroNiagaraEffectRegularType
// NumValues: 0x0015
enum class EKuroNiagaraEffectRegularType : uint8
{
	None                                     = 0,
	Fight_L1                                 = 1,
	Fight_L2                                 = 2,
	Fight_L3                                 = 3,
	Fight_L4                                 = 4,
	Scene_L1                                 = 5,
	Scene_L2                                 = 6,
	Scene_L3                                 = 7,
	SceneInteraction_L1                      = 8,
	SceneInteraction_L2                      = 9,
	SceneInteraction_L3                      = 10,
	LGUI_L1                                  = 11,
	LGUI_L2                                  = 12,
	LGUI_L3                                  = 13,
	Scene_LGUI_L1                            = 14,
	Scene_LGUI_L2                            = 15,
	Scene_LGUI_L3                            = 16,
	Movie_L1                                 = 17,
	Movie_L2                                 = 18,
	Movie_L3                                 = 19,
	EKuroNiagaraEffectRegularType_MAX        = 20,
};

// Enum Niagara.ENiagaraSystemSpawnSectionEndBehavior
// NumValues: 0x0004
enum class ENiagaraSystemSpawnSectionEndBehavior : uint32
{
	SetSystemInactive                        = 0,
	Deactivate                               = 1,
	None                                     = 2,
	ENiagaraSystemSpawnSectionEndBehavior_MAX = 3,
};

// Enum Niagara.ENiagaraSystemSpawnSectionEvaluateBehavior
// NumValues: 0x0003
enum class ENiagaraSystemSpawnSectionEvaluateBehavior : uint32
{
	ActivateIfInactive                       = 0,
	None                                     = 1,
	ENiagaraSystemSpawnSectionEvaluateBehavior_MAX = 2,
};

// Enum Niagara.ENiagaraSystemSpawnSectionStartBehavior
// NumValues: 0x0002
enum class ENiagaraSystemSpawnSectionStartBehavior : uint32
{
	Activate                                 = 0,
	ENiagaraSystemSpawnSectionStartBehavior_MAX = 1,
};

// Enum Niagara.ENiagaraCollisionMode
// NumValues: 0x0005
enum class ENiagaraCollisionMode : uint8
{
	None                                     = 0,
	SceneGeometry                            = 1,
	DepthBuffer                              = 2,
	DistanceField                            = 3,
	ENiagaraCollisionMode_MAX                = 4,
};

// Enum Niagara.ENiagaraLegacyTrailWidthMode
// NumValues: 0x0004
enum class ENiagaraLegacyTrailWidthMode : uint8
{
	FromCentre                               = 0,
	FromFirst                                = 1,
	FromSecond                               = 2,
	ENiagaraLegacyTrailWidthMode_MAX         = 3,
};

// Enum Niagara.ENiagaraRendererSourceDataMode
// NumValues: 0x0003
enum class ENiagaraRendererSourceDataMode : uint8
{
	Particles                                = 0,
	Emitter                                  = 1,
	ENiagaraRendererSourceDataMode_MAX       = 2,
};

// Enum Niagara.ENiagaraBindingSource
// NumValues: 0x0007
enum class ENiagaraBindingSource : uint8
{
	ImplicitFromSource                       = 0,
	ExplicitParticles                        = 1,
	ExplicitEmitter                          = 2,
	ExplicitSystem                           = 3,
	ExplicitUser                             = 4,
	MaxBindingSource                         = 5,
	ENiagaraBindingSource_MAX                = 6,
};

// Enum Niagara.ENiagaraIterationSource
// NumValues: 0x0003
enum class ENiagaraIterationSource : uint8
{
	Particles                                = 0,
	DataInterface                            = 1,
	ENiagaraIterationSource_MAX              = 2,
};

// Enum Niagara.ENiagaraScriptGroup
// NumValues: 0x0005
enum class ENiagaraScriptGroup : uint8
{
	Particle                                 = 0,
	Emitter                                  = 1,
	System                                   = 2,
	Max                                      = 3,
	ENiagaraScriptGroup_MAX                  = 4,
};

// Enum Niagara.ENiagaraScriptContextStaticSwitch
// NumValues: 0x0004
enum class ENiagaraScriptContextStaticSwitch : uint8
{
	System                                   = 0,
	Emitter                                  = 1,
	Particle                                 = 2,
	ENiagaraScriptContextStaticSwitch_MAX    = 3,
};

// Enum Niagara.ENiagaraCompileUsageStaticSwitch
// NumValues: 0x0006
enum class ENiagaraCompileUsageStaticSwitch : uint8
{
	Spawn                                    = 0,
	Update                                   = 1,
	Event                                    = 2,
	SimulationStage                          = 3,
	Default                                  = 4,
	ENiagaraCompileUsageStaticSwitch_MAX     = 5,
};

// Enum Niagara.ENiagaraScriptUsage
// NumValues: 0x000E
enum class ENiagaraScriptUsage : uint8
{
	Function                                 = 0,
	Module                                   = 1,
	DynamicInput                             = 2,
	ParticleSpawnScript                      = 3,
	ParticleSpawnScriptInterpolated          = 4,
	ParticleUpdateScript                     = 5,
	ParticleEventScript                      = 6,
	ParticleSimulationStageScript            = 7,
	ParticleGPUComputeScript                 = 8,
	EmitterSpawnScript                       = 9,
	EmitterUpdateScript                      = 10,
	SystemSpawnScript                        = 11,
	SystemUpdateScript                       = 12,
	ENiagaraScriptUsage_MAX                  = 13,
};

// Enum Niagara.ENiagaraScriptCompileStatus
// NumValues: 0x0008
enum class ENiagaraScriptCompileStatus : uint8
{
	NCS_Unknown                              = 0,
	NCS_Dirty                                = 1,
	NCS_Error                                = 2,
	NCS_UpToDate                             = 3,
	NCS_BeingCreated                         = 4,
	NCS_UpToDateWithWarnings                 = 5,
	NCS_ComputeUpToDateWithWarnings          = 6,
	NCS_MAX                                  = 7,
};

// Enum Niagara.ENiagaraInputNodeUsage
// NumValues: 0x0007
enum class ENiagaraInputNodeUsage : uint8
{
	Undefined                                = 0,
	Parameter                                = 1,
	Attribute                                = 2,
	SystemConstant                           = 3,
	TranslatorConstant                       = 4,
	RapidIterationParameter                  = 5,
	ENiagaraInputNodeUsage_MAX               = 6,
};

// Enum Niagara.ENiagaraDataSetType
// NumValues: 0x0004
enum class ENiagaraDataSetType : uint8
{
	ParticleData                             = 0,
	Shared                                   = 1,
	Event                                    = 2,
	ENiagaraDataSetType_MAX                  = 3,
};

// Enum Niagara.ENiagaraStatDisplayMode
// NumValues: 0x0003
enum class ENiagaraStatDisplayMode : uint8
{
	Percent                                  = 0,
	Absolute                                 = 1,
	ENiagaraStatDisplayMode_MAX              = 2,
};

// Enum Niagara.ENiagaraStatEvaluationType
// NumValues: 0x0003
enum class ENiagaraStatEvaluationType : uint8
{
	Average                                  = 0,
	Maximum                                  = 1,
	ENiagaraStatEvaluationType_MAX           = 2,
};

// Enum Niagara.ENiagaraAgeUpdateMode
// NumValues: 0x0004
enum class ENiagaraAgeUpdateMode : uint8
{
	TickDeltaTime                            = 0,
	DesiredAge                               = 1,
	DesiredAgeNoSeek                         = 2,
	ENiagaraAgeUpdateMode_MAX                = 3,
};

// Enum Niagara.ENiagaraKuroImportance
// NumValues: 0x0004
enum class ENiagaraKuroImportance : uint8
{
	NKI_Far                                  = 0,
	NKI_Middle                               = 1,
	NKI_Near                                 = 2,
	NKI_MAX                                  = 3,
};

// Enum Niagara.ENiagaraSimTarget
// NumValues: 0x0003
enum class ENiagaraSimTarget : uint8
{
	CPUSim                                   = 0,
	GPUComputeSim                            = 1,
	ENiagaraSimTarget_MAX                    = 2,
};

// Enum Niagara.ENiagaraDefaultMode
// NumValues: 0x0004
enum class ENiagaraDefaultMode : uint8
{
	Value                                    = 0,
	Binding                                  = 1,
	Custom                                   = 2,
	ENiagaraDefaultMode_MAX                  = 3,
};

// Enum Niagara.ENiagaraGpuBufferFormat
// NumValues: 0x0005
enum class ENiagaraGpuBufferFormat : uint8
{
	Float                                    = 0,
	HalfFloat                                = 1,
	UnsignedNormalizedByte                   = 2,
	Max                                      = 3,
	ENiagaraGpuBufferFormat_MAX              = 4,
};

// Enum Niagara.ENiagaraTickBehavior
// NumValues: 0x0005
enum class ENiagaraTickBehavior : uint8
{
	UsePrereqs                               = 0,
	UseComponentTickGroup                    = 1,
	ForceTickFirst                           = 2,
	ForceTickLast                            = 3,
	ENiagaraTickBehavior_MAX                 = 4,
};

// Enum Niagara.ENCPoolMethod
// NumValues: 0x0006
enum class ENCPoolMethod : uint8
{
	None                                     = 0,
	AutoRelease                              = 1,
	ManualRelease                            = 2,
	ManualRelease_OnComplete                 = 3,
	FreeInPool                               = 4,
	ENCPoolMethod_MAX                        = 5,
};

// Enum Niagara.ENiagartaDataChannelReadResult
// NumValues: 0x0003
enum class ENiagartaDataChannelReadResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	ENiagartaDataChannelReadResult_MAX       = 2,
};

// Enum Niagara.ENiagraDataChannel_IslandMode
// NumValues: 0x0003
enum class ENiagraDataChannel_IslandMode : uint8
{
	AlignedStatic                            = 0,
	Dynamic                                  = 1,
	ENiagraDataChannel_MAX                   = 2,
};

// Enum Niagara.ENiagraDataChannel_PlacementMode
// NumValues: 0x0002
enum class ENiagraDataChannel_PlacementMode : uint8
{
	BoundPlacement                           = 0,
	ENiagraDataChannel_MAX                   = 1,
};

// Enum Niagara.ENiagraDataChannel_SingleMode
// NumValues: 0x0003
enum class ENiagraDataChannel_SingleMode : uint8
{
	AlignedStatic                            = 0,
	Dynamic                                  = 1,
	ENiagraDataChannel_MAX                   = 2,
};

// Enum Niagara.ENiagaraDataChannelAllocationMode
// NumValues: 0x0002
enum class ENiagaraDataChannelAllocationMode : uint8
{
	Static                                   = 0,
	ENiagaraDataChannelAllocationMode_MAX    = 1,
};

// Enum Niagara.ENDIDataChannelSpawnScaleMode
// NumValues: 0x0004
enum class ENDIDataChannelSpawnScaleMode : uint8
{
	Override                                 = 0,
	Scale                                    = 1,
	Max                                      = 2,
	ENDIDataChannelSpawnScaleMode_MAX        = 3,
};

// Enum Niagara.ENDIDataChannelSpawnMode
// NumValues: 0x0005
enum class ENDIDataChannelSpawnMode : uint8
{
	Override                                 = 0,
	Accumulate                               = 1,
	None                                     = 2,
	Max                                      = 3,
	ENDIDataChannelSpawnMode_MAX             = 4,
};

// Enum Niagara.ENDIExport_GPUAllocationMode
// NumValues: 0x0003
enum class ENDIExport_GPUAllocationMode : uint8
{
	FixedSize                                = 0,
	PerParticle                              = 1,
	ENDIExport_MAX                           = 2,
};

// Enum Niagara.ESetResolutionMethod
// NumValues: 0x0004
enum class ESetResolutionMethod : uint32
{
	Independent                              = 0,
	MaxAxis                                  = 1,
	CellSize                                 = 2,
	ESetResolutionMethod_MAX                 = 3,
};

// Enum Niagara.ENDISkeletalMesh_SkinningMode
// NumValues: 0x0005
enum class ENDISkeletalMesh_SkinningMode : uint8
{
	Invalid                                  = 255,
	None                                     = 0,
	SkinOnTheFly                             = 1,
	PreSkin                                  = 2,
	ENDISkeletalMesh_MAX                     = 256,
};

// Enum Niagara.ENDISkeletalMesh_SourceMode
// NumValues: 0x0004
enum class ENDISkeletalMesh_SourceMode : uint8
{
	Default                                  = 0,
	Source                                   = 1,
	AttachParent                             = 2,
	ENDISkeletalMesh_MAX                     = 3,
};

// Enum Niagara.ENDIStaticMesh_SourceMode
// NumValues: 0x0005
enum class ENDIStaticMesh_SourceMode : uint8
{
	Default                                  = 0,
	Source                                   = 1,
	AttachParent                             = 2,
	DefaultMeshOnly                          = 3,
	ENDIStaticMesh_MAX                       = 4,
};

// Enum Niagara.ENiagaraDebugHUDOverviewMode
// NumValues: 0x0004
enum class ENiagaraDebugHUDOverviewMode : uint32
{
	Overview                                 = 0,
	Scalability                              = 1,
	Performance                              = 2,
	ENiagaraDebugHUDOverviewMode_MAX         = 3,
};

// Enum Niagara.ENiagaraDebugHudVerbosity
// NumValues: 0x0004
enum class ENiagaraDebugHudVerbosity : uint32
{
	None                                     = 0,
	Basic                                    = 1,
	Verbose                                  = 2,
	ENiagaraDebugHudVerbosity_MAX            = 3,
};

// Enum Niagara.ENiagaraDebugHudFont
// NumValues: 0x0003
enum class ENiagaraDebugHudFont : uint32
{
	Small                                    = 0,
	Normal                                   = 1,
	ENiagaraDebugHudFont_MAX                 = 2,
};

// Enum Niagara.ENiagaraDebugHudVAlign
// NumValues: 0x0004
enum class ENiagaraDebugHudVAlign : uint32
{
	Top                                      = 0,
	Center                                   = 1,
	Bottom                                   = 2,
	ENiagaraDebugHudVAlign_MAX               = 3,
};

// Enum Niagara.ENiagaraDebugHudHAlign
// NumValues: 0x0004
enum class ENiagaraDebugHudHAlign : uint32
{
	Left                                     = 0,
	Center                                   = 1,
	Right                                    = 2,
	ENiagaraDebugHudHAlign_MAX               = 3,
};

// Enum Niagara.ENiagaraScalabilityUpdateFrequency
// NumValues: 0x0006
enum class ENiagaraScalabilityUpdateFrequency : uint32
{
	SpawnOnly                                = 0,
	Low                                      = 1,
	Medium                                   = 2,
	High                                     = 3,
	Continuous                               = 4,
	ENiagaraScalabilityUpdateFrequency_MAX   = 5,
};

// Enum Niagara.ENiagaraCullReaction
// NumValues: 0x0005
enum class ENiagaraCullReaction : uint32
{
	Deactivate                               = 0,
	DeactivateImmediate                      = 1,
	DeactivateResume                         = 2,
	DeactivateImmediateResume                = 3,
	ENiagaraCullReaction_MAX                 = 4,
};

// Enum Niagara.EParticleAllocationMode
// NumValues: 0x0003
enum class EParticleAllocationMode : uint8
{
	AutomaticEstimate                        = 0,
	ManualEstimate                           = 1,
	EParticleAllocationMode_MAX              = 2,
};

// Enum Niagara.EScriptExecutionMode
// NumValues: 0x0004
enum class EScriptExecutionMode : uint8
{
	EveryParticle                            = 0,
	SpawnedParticles                         = 1,
	SingleParticle                           = 2,
	EScriptExecutionMode_MAX                 = 3,
};

// Enum Niagara.ENiagaraSortMode
// NumValues: 0x0006
enum class ENiagaraSortMode : uint8
{
	None                                     = 0,
	ViewDepth                                = 1,
	ViewDistance                             = 2,
	CustomAscending                          = 3,
	CustomDecending                          = 4,
	ENiagaraSortMode_MAX                     = 5,
};

// Enum Niagara.ENiagaraMeshLockedAxisSpace
// NumValues: 0x0004
enum class ENiagaraMeshLockedAxisSpace : uint8
{
	Simulation                               = 0,
	World                                    = 1,
	Local                                    = 2,
	ENiagaraMeshLockedAxisSpace_MAX          = 3,
};

// Enum Niagara.ENiagaraMeshPivotOffsetSpace
// NumValues: 0x0005
enum class ENiagaraMeshPivotOffsetSpace : uint8
{
	Mesh                                     = 0,
	Simulation                               = 1,
	World                                    = 2,
	Local                                    = 3,
	ENiagaraMeshPivotOffsetSpace_MAX         = 4,
};

// Enum Niagara.ENiagaraMeshFacingMode
// NumValues: 0x0005
enum class ENiagaraMeshFacingMode : uint8
{
	Default                                  = 0,
	Velocity                                 = 1,
	CameraPosition                           = 2,
	CameraPlane                              = 3,
	ENiagaraMeshFacingMode_MAX               = 4,
};

// Enum Niagara.ENiagaraMeshLODMode
// NumValues: 0x0003
enum class ENiagaraMeshLODMode : uint8
{
	LODLevel                                 = 0,
	ByComponentBounds                        = 1,
	ENiagaraMeshLODMode_MAX                  = 2,
};

// Enum Niagara.ENiagaraPlatformSetState
// NumValues: 0x0005
enum class ENiagaraPlatformSetState : uint8
{
	Disabled                                 = 0,
	Enabled                                  = 1,
	Active                                   = 2,
	Unknown                                  = 3,
	ENiagaraPlatformSetState_MAX             = 4,
};

// Enum Niagara.ENiagaraPlatformSelectionState
// NumValues: 0x0004
enum class ENiagaraPlatformSelectionState : uint8
{
	Default                                  = 0,
	Enabled                                  = 1,
	Disabled                                 = 2,
	ENiagaraPlatformSelectionState_MAX       = 3,
};

// Enum Niagara.ENiagaraPreviewGridResetMode
// NumValues: 0x0004
enum class ENiagaraPreviewGridResetMode : uint8
{
	Never                                    = 0,
	Individual                               = 1,
	All                                      = 2,
	ENiagaraPreviewGridResetMode_MAX         = 3,
};

// Enum Niagara.ENiagaraRibbonUVDistributionMode
// NumValues: 0x0004
enum class ENiagaraRibbonUVDistributionMode : uint32
{
	ScaledUniformly                          = 0,
	ScaledUsingRibbonSegmentLength           = 1,
	TiledOverRibbonLength                    = 2,
	ENiagaraRibbonUVDistributionMode_MAX     = 3,
};

// Enum Niagara.ENiagaraRibbonUVEdgeMode
// NumValues: 0x0003
enum class ENiagaraRibbonUVEdgeMode : uint32
{
	SmoothTransition                         = 0,
	Locked                                   = 1,
	ENiagaraRibbonUVEdgeMode_MAX             = 2,
};

// Enum Niagara.ENiagaraRibbonTessellationMode
// NumValues: 0x0004
enum class ENiagaraRibbonTessellationMode : uint8
{
	Automatic                                = 0,
	Custom                                   = 1,
	Disabled                                 = 2,
	ENiagaraRibbonTessellationMode_MAX       = 3,
};

// Enum Niagara.ENiagaraRibbonDrawDirection
// NumValues: 0x0003
enum class ENiagaraRibbonDrawDirection : uint8
{
	FrontToBack                              = 0,
	BackToFront                              = 1,
	ENiagaraRibbonDrawDirection_MAX          = 2,
};

// Enum Niagara.ENiagaraRibbonAgeOffsetMode
// NumValues: 0x0003
enum class ENiagaraRibbonAgeOffsetMode : uint8
{
	Scale                                    = 0,
	Clip                                     = 1,
	ENiagaraRibbonAgeOffsetMode_MAX          = 2,
};

// Enum Niagara.ENiagaraRibbonFacingMode
// NumValues: 0x0004
enum class ENiagaraRibbonFacingMode : uint8
{
	Screen                                   = 0,
	Custom                                   = 1,
	CustomSideVector                         = 2,
	ENiagaraRibbonFacingMode_MAX             = 3,
};

// Enum Niagara.ENiagaraScriptLibraryVisibility
// NumValues: 0x0005
enum class ENiagaraScriptLibraryVisibility : uint8
{
	Invalid                                  = 0,
	Unexposed                                = 1,
	Library                                  = 2,
	Hidden                                   = 3,
	ENiagaraScriptLibraryVisibility_MAX      = 4,
};

// Enum Niagara.ENiagaraModuleDependencyScriptConstraint
// NumValues: 0x0003
enum class ENiagaraModuleDependencyScriptConstraint : uint8
{
	SameScript                               = 0,
	AllScripts                               = 1,
	ENiagaraModuleDependencyScriptConstraint_MAX = 2,
};

// Enum Niagara.ENiagaraModuleDependencyType
// NumValues: 0x0003
enum class ENiagaraModuleDependencyType : uint8
{
	PreDependency                            = 0,
	PostDependency                           = 1,
	ENiagaraModuleDependencyType_MAX         = 2,
};

// Enum Niagara.EUnusedAttributeBehaviour
// NumValues: 0x0006
enum class EUnusedAttributeBehaviour : uint8
{
	Copy                                     = 0,
	Zero                                     = 1,
	None                                     = 2,
	MarkInvalid                              = 3,
	PassThrough                              = 4,
	EUnusedAttributeBehaviour_MAX            = 5,
};

// Enum Niagara.ENiagaraSpriteFacingMode
// NumValues: 0x0006
enum class ENiagaraSpriteFacingMode : uint8
{
	FaceCamera                               = 0,
	FaceCameraPlane                          = 1,
	CustomFacingVector                       = 2,
	FaceCameraPosition                       = 3,
	FaceCameraDistanceBlend                  = 4,
	ENiagaraSpriteFacingMode_MAX             = 5,
};

// Enum Niagara.ENiagaraSpriteAlignment
// NumValues: 0x0004
enum class ENiagaraSpriteAlignment : uint8
{
	Unaligned                                = 0,
	VelocityAligned                          = 1,
	CustomAlignment                          = 2,
	ENiagaraSpriteAlignment_MAX              = 3,
};

// Enum Niagara.ENiagaraParameterPanelCategory
// NumValues: 0x000F
enum class ENiagaraParameterPanelCategory : uint8
{
	Input                                    = 0,
	Attributes                               = 1,
	Output                                   = 2,
	Local                                    = 3,
	User                                     = 4,
	Engine                                   = 5,
	Owner                                    = 6,
	System                                   = 7,
	Emitter                                  = 8,
	Particles                                = 9,
	ScriptTransient                          = 10,
	StaticSwitch                             = 11,
	None                                     = 12,
	Num                                      = 13,
	ENiagaraParameterPanelCategory_MAX       = 14,
};

// Enum Niagara.ENiagaraScriptParameterUsage
// NumValues: 0x0008
enum class ENiagaraScriptParameterUsage : uint32
{
	Input                                    = 0,
	Output                                   = 1,
	Local                                    = 2,
	InputOutput                              = 3,
	InitialValueInput                        = 4,
	None                                     = 5,
	Num                                      = 6,
	ENiagaraScriptParameterUsage_MAX         = 7,
};

// Enum Niagara.ENiagaraParameterScope
// NumValues: 0x0010
enum class ENiagaraParameterScope : uint32
{
	Input                                    = 0,
	User                                     = 1,
	Engine                                   = 2,
	Owner                                    = 3,
	System                                   = 4,
	Emitter                                  = 5,
	Particles                                = 6,
	ScriptPersistent                         = 7,
	ScriptTransient                          = 8,
	Local                                    = 9,
	Custom                                   = 10,
	DISPLAY_ONLY_StaticSwitch                = 11,
	Output                                   = 12,
	None                                     = 13,
	Num                                      = 14,
	ENiagaraParameterScope_MAX               = 15,
};

// Enum Niagara.ENiagaraExecutionState
// NumValues: 0x0007
enum class ENiagaraExecutionState : uint8
{
	Active                                   = 0,
	Inactive                                 = 1,
	InactiveClear                            = 2,
	Complete                                 = 3,
	Disabled                                 = 4,
	Num                                      = 5,
	ENiagaraExecutionState_MAX               = 6,
};

// Enum Niagara.ENiagaraExecutionStateSource
// NumValues: 0x0005
enum class ENiagaraExecutionStateSource : uint8
{
	Scalability                              = 0,
	Internal                                 = 1,
	Owner                                    = 2,
	InternalCompletion                       = 3,
	ENiagaraExecutionStateSource_MAX         = 4,
};

// Enum Niagara.ENiagaraNumericOutputTypeSelectionMode
// NumValues: 0x0005
enum class ENiagaraNumericOutputTypeSelectionMode : uint8
{
	None                                     = 0,
	Largest                                  = 1,
	Smallest                                 = 2,
	Scalar                                   = 3,
	ENiagaraNumericOutputTypeSelectionMode_MAX = 4,
};

// Enum Niagara.ENiagaraVariantMode
// NumValues: 0x0005
enum class ENiagaraVariantMode : uint32
{
	None                                     = 0,
	Object                                   = 1,
	DataInterface                            = 2,
	Bytes                                    = 3,
	ENiagaraVariantMode_MAX                  = 4,
};

// ScriptStruct Niagara.NiagaraDebugHUDVariable
// 0x0018 (0x0018 - 0x0000)
struct FNiagaraDebugHUDVariable final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNiagaraDebugHUDVariable;

// ScriptStruct Niagara.NiagaraDebugHudTextOptions
// 0x0014 (0x0014 - 0x0000)
struct FNiagaraDebugHudTextOptions final
{
public:
	ENiagaraDebugHudFont                          Font;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDebugHudHAlign                        HorizontalAlignment;                               // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDebugHudVAlign                        VerticalAlignment;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ScreenOffset;                                      // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNiagaraDebugHudTextOptions;

// ScriptStruct Niagara.NiagaraDebugHUDSettingsData
// 0x0120 (0x0120 - 0x0000)
struct FNiagaraDebugHUDSettingsData final
{
public:
	bool                                          bHudEnabled;                                       // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraDebugHUDVariable               ActorFilter;                                       // 0x0008(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	struct FNiagaraDebugHUDVariable               ComponentFilter;                                   // 0x0020(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	struct FNiagaraDebugHUDVariable               SystemFilter;                                      // 0x0038(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	float                                         ComponentsShowDistance;                            // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOnlyActiveComponents;                         // 0x0054(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOnlyDownFrameComponents;                      // 0x0055(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOnlyIsNotPausedComponents;                    // 0x0056(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverviewEnabled;                                  // 0x0057(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDebugHUDOverviewMode                  OverviewMode;                                      // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowRegisteredComponents;                         // 0x005C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TolerantSecondsSinceAnyActive;                     // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverviewShowFilteredSystemOnly;                   // 0x0064(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              OverviewLocation;                                  // 0x0068(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugComponentsEnabled;                           // 0x0070(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ENiagaraDebugHudVerbosity                     SystemDebugVerbosity;                              // 0x0074(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDebugHudVerbosity                     SystemEmitterVerbosity;                            // 0x0078(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSystemShowBounds;                                 // 0x007C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugVariablesEnabled;                            // 0x007D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNiagaraDebugHUDVariable>       SystemVariablesFilter;                             // 0x0080(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraDebugHUDVariable>       ParticlesVariablesFilter;                          // 0x0090(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	float                                         ParticlesVariableClipDistance;                     // 0x00A0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ParticlesVariableClipScreenRatio;                  // 0x00A4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticlesVariablesMaxDisplay;                      // 0x00A8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 BgColor;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDebugHudFont                          OverviewFont;                                      // 0x00B0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OverviewHeadingColor;                              // 0x00B4(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OverviewDetailColor;                               // 0x00C4(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OverviewDetailHighlightColor;                      // 0x00D4(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 ComponentsTextColor;                               // 0x00E4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SystemColorTableOpacity;                           // 0x00E8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        SystemColorSeed;                                   // 0x00EC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SystemColorHSVMin;                                 // 0x00F0(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SystemColorHSVMax;                                 // 0x00FC(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraDebugHudTextOptions            SystemTextOptions;                                 // 0x0108(0x0014)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNiagaraDebugHUDSettingsData;

// ScriptStruct Niagara.NiagaraTypeDefinitionHandle
// 0x0004 (0x0004 - 0x0000)
struct FNiagaraTypeDefinitionHandle final
{
public:
	int32                                         RegisteredTypeIndex;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FNiagaraTypeDefinitionHandle;

// ScriptStruct Niagara.NiagaraVariableBase
// 0x0010 (0x0010 - 0x0000)
struct FNiagaraVariableBase
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNiagaraTypeDefinitionHandle           TypeDefHandle;                                     // 0x000C(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FNiagaraVariableBase;

// ScriptStruct Niagara.NiagaraVariable
// 0x0010 (0x0020 - 0x0010)
struct FNiagaraVariable final : public FNiagaraVariableBase
{
public:
	TArray<uint8>                                 VarData;                                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FNiagaraVariable;

// ScriptStruct Niagara.MovieSceneNiagaraParameterSectionTemplate
// 0x0020 (0x0040 - 0x0020)
struct FMovieSceneNiagaraParameterSectionTemplate : public FMovieSceneEvalTemplate
{
public:
	struct FNiagaraVariable                       Parameter;                                         // 0x0020(0x0020)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneNiagaraParameterSectionTemplate;

// ScriptStruct Niagara.NiagaraTypeLayoutInfo
// 0x0060 (0x0060 - 0x0000)
struct FNiagaraTypeLayoutInfo final
{
public:
	TArray<uint32>                                FloatComponentByteOffsets;                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                FloatComponentRegisterOffsets;                     // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                Int32ComponentByteOffsets;                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                Int32ComponentRegisterOffsets;                     // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                HalfComponentByteOffsets;                          // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                HalfComponentRegisterOffsets;                      // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNiagaraTypeLayoutInfo;

// ScriptStruct Niagara.NiagaraVariableLayoutInfo
// 0x0070 (0x0070 - 0x0000)
struct FNiagaraVariableLayoutInfo final
{
public:
	uint32                                        FloatComponentStart;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Int32ComponentStart;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        HalfComponentStart;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraTypeLayoutInfo                 LayoutInfo;                                        // 0x0010(0x0060)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNiagaraVariableLayoutInfo;

// ScriptStruct Niagara.NiagaraDataSetID
// 0x0010 (0x0010 - 0x0000)
struct FNiagaraDataSetID final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDataSetType                           Type;                                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNiagaraDataSetID;

// ScriptStruct Niagara.NiagaraDataSetCompiledData
// 0x0048 (0x0048 - 0x0000)
struct FNiagaraDataSetCompiledData final
{
public:
	TArray<struct FNiagaraVariable>               Variables;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraVariableLayoutInfo>     VariableLayouts;                                   // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FNiagaraDataSetID                      ID;                                                // 0x0020(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        TotalFloatComponents;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        TotalInt32Components;                              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        TotalHalfComponents;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRequiresPersistentIDs : 1;                        // 0x003C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ENiagaraSimTarget                             SimTarget;                                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNiagaraDataSetCompiledData;

// ScriptStruct Niagara.NDIDataChannelFunctionInfo
// 0x0030 (0x0030 - 0x0000)
struct FNDIDataChannelFunctionInfo final
{
public:
	class FName                                   FunctionName;                                      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNiagaraVariableBase>           Inputs;                                            // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraVariableBase>           Outputs;                                           // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNDIDataChannelFunctionInfo;

// ScriptStruct Niagara.NDIDataChannelCompiledData
// 0x0018 (0x0018 - 0x0000)
struct FNDIDataChannelCompiledData
{
public:
	TArray<struct FNDIDataChannelFunctionInfo>    FunctionInfo;                                      // 0x0000(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint32                                        TotalParams;                                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUsedByCPU;                                        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUsedByGPU;                                        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNeedsSpawnDataTable;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNDIDataChannelCompiledData;

// ScriptStruct Niagara.NDIDataChannelWriteCompiledData
// 0x0048 (0x0060 - 0x0018)
struct FNDIDataChannelWriteCompiledData final : public FNDIDataChannelCompiledData
{
public:
	struct FNiagaraDataSetCompiledData            DataLayout;                                        // 0x0018(0x0048)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNDIDataChannelWriteCompiledData;

// ScriptStruct Niagara.KuroNiagaraTickManager
// 0x0020 (0x0020 - 0x0000)
struct FKuroNiagaraTickManager final
{
public:
	TWeakObjectPtr<class UKuroNiagaraTickType>    TickType;                                          // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class UNiagaraComponent>> ManagedComponents;                               // 0x0008(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKuroNiagaraTickManager;

// ScriptStruct Niagara.NiagaraDeviceProfileStateEntry
// 0x0014 (0x0014 - 0x0000)
struct FNiagaraDeviceProfileStateEntry final
{
public:
	class FName                                   ProfileName;                                       // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        QualityLevelMask;                                  // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        SetQualityLevelMask;                               // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNiagaraDeviceProfileStateEntry;

// ScriptStruct Niagara.NiagaraPlatformSetCVarCondition
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FNiagaraPlatformSetCVarCondition final
{
public:
	class FName                                   CVarName;                                          // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinInt;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxInt;                                            // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinFloat;                                          // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxFloat;                                          // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseMinInt : 1;                                    // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseMaxInt : 1;                                    // 0x0020(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseMinFloat : 1;                                  // 0x0020(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseMaxFloat : 1;                                  // 0x0020(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNiagaraPlatformSetCVarCondition;

// ScriptStruct Niagara.NiagaraPlatformSet
// 0x0030 (0x0030 - 0x0000)
struct FNiagaraPlatformSet final
{
public:
	int32                                         QualityLevelMask;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNiagaraDeviceProfileStateEntry> DeviceProfileStates;                              // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraPlatformSetCVarCondition> CVarConditions;                                  // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNiagaraPlatformSet;

// ScriptStruct Niagara.KuroTickByDistance
// 0x0008 (0x0008 - 0x0000)
struct FKuroTickByDistance final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TickInterval;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroTickByDistance;

// ScriptStruct Niagara.KuroTickByDistanceSetting
// 0x0048 (0x0048 - 0x0000)
struct FKuroTickByDistanceSetting final
{
public:
	struct FNiagaraPlatformSet                    Platforms;                                         // 0x0000(0x0030)(Edit, NativeAccessSpecifierPublic)
	float                                         MaxTickDeltaSeconds;                               // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKuroTickByDistance>            TickByDistanceArray;                               // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKuroTickByDistanceSetting;

// ScriptStruct Niagara.BasicParticleData
// 0x001C (0x001C - 0x0000)
struct FBasicParticleData final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Size;                                              // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBasicParticleData;

// ScriptStruct Niagara.MeshTriCoordinate
// 0x0010 (0x0010 - 0x0000)
struct FMeshTriCoordinate final
{
public:
	int32                                         Tri;                                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BaryCoord;                                         // 0x0004(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMeshTriCoordinate;

// ScriptStruct Niagara.MovieSceneNiagaraBoolParameterSectionTemplate
// 0x0090 (0x00D0 - 0x0040)
struct FMovieSceneNiagaraBoolParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneBoolChannel                 BoolChannel;                                       // 0x0040(0x0090)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneNiagaraBoolParameterSectionTemplate;

// ScriptStruct Niagara.MovieSceneNiagaraColorParameterSectionTemplate
// 0x0280 (0x02C0 - 0x0040)
struct FMovieSceneNiagaraColorParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneFloatChannel                RedChannel;                                        // 0x0040(0x00A0)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                GreenChannel;                                      // 0x00E0(0x00A0)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                BlueChannel;                                       // 0x0180(0x00A0)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                AlphaChannel;                                      // 0x0220(0x00A0)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneNiagaraColorParameterSectionTemplate;

// ScriptStruct Niagara.MovieSceneNiagaraFloatParameterSectionTemplate
// 0x00A0 (0x00E0 - 0x0040)
struct FMovieSceneNiagaraFloatParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneFloatChannel                FloatChannel;                                      // 0x0040(0x00A0)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneNiagaraFloatParameterSectionTemplate;

// ScriptStruct Niagara.MovieSceneNiagaraIntegerParameterSectionTemplate
// 0x0090 (0x00D0 - 0x0040)
struct FMovieSceneNiagaraIntegerParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneIntegerChannel              IntegerChannel;                                    // 0x0040(0x0090)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneNiagaraIntegerParameterSectionTemplate;

// ScriptStruct Niagara.MovieSceneNiagaraSystemTrackImplementation
// 0x0018 (0x0028 - 0x0010)
struct FMovieSceneNiagaraSystemTrackImplementation final : public FMovieSceneTrackImplementation
{
public:
	struct FFrameNumber                           SpawnSectionStartFrame;                            // 0x0010(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameNumber                           SpawnSectionEndFrame;                              // 0x0014(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionStartBehavior       SpawnSectionStartBehavior;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEvaluateBehavior    SpawnSectionEvaluateBehavior;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEndBehavior         SpawnSectionEndBehavior;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraAgeUpdateMode                         AgeUpdateMode;                                     // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneNiagaraSystemTrackImplementation;

// ScriptStruct Niagara.MovieSceneNiagaraSystemTrackTemplate
// 0x0000 (0x0020 - 0x0020)
struct FMovieSceneNiagaraSystemTrackTemplate final : public FMovieSceneEvalTemplate
{
};
DUMPER7_ASSERTS_FMovieSceneNiagaraSystemTrackTemplate;

// ScriptStruct Niagara.MovieSceneNiagaraTimeTrackTemplate
// 0x00A0 (0x00C0 - 0x0020)
struct FMovieSceneNiagaraTimeTrackTemplate final : public FMovieSceneEvalTemplate
{
public:
	struct FMovieSceneFloatChannel                FloatChannel;                                      // 0x0020(0x00A0)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneNiagaraTimeTrackTemplate;

// ScriptStruct Niagara.MovieSceneNiagaraVectorParameterSectionTemplate
// 0x0288 (0x02C8 - 0x0040)
struct FMovieSceneNiagaraVectorParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneFloatChannel                VectorChannels[0x4];                               // 0x0040(0x00A0)(NativeAccessSpecifierPrivate)
