#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDA_WaterEffectConfigs

#include "Basic.hpp"

#include "SWaterEffectSubConfig_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PDA_WaterEffectConfigs.PDA_WaterEffectConfigs_C
// 0x0138 (0x0170 - 0x0038)
class UPDA_WaterEffectConfigs_C final : public UPrimaryDataAsset
{
public:
	float                                         TimeExistAfterDead;                                // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FallJumpPositionFix;                               // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSWaterEffectSubConfig                 WaterEffectConfig;                                 // 0x0040(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UEffectModelBase>        SwimIdleEffectRef;                                 // 0x0090(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UEffectModelBase>        SwimNormalEffectRef;                               // 0x00C0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UEffectModelBase>        SwimFastEffectRef;                                 // 0x00F0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<class UPhysicalMaterial*, struct FSWaterEffectSubConfig> MaterialEffectConfig;              // 0x0120(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PDA_WaterEffectConfigs_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PDA_WaterEffectConfigs_C")
	}
	static class UPDA_WaterEffectConfigs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDA_WaterEffectConfigs_C>();
	}
};
DUMPER7_ASSERTS_UPDA_WaterEffectConfigs_C;

}

