#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Puerts

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Puerts.PuertsBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class UPuertsBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearJSCache();
	static void ExecuteModuleInSharedJsEnv(class FName ModuleName);
	static void PreloadJS(class UKuroPreloadJSCallback* Callback);
	static void PreStartShareJsEnv();
	static void SetEnableBlueprintBind(bool value);
	static void StartShareJsEnv(class FName ModuleName, class UGameInstance* GameInstance);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PuertsBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PuertsBlueprintLibrary")
	}
	static class UPuertsBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPuertsBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UPuertsBlueprintLibrary;

// Class Puerts.PuertsSetting
// 0x0068 (0x0098 - 0x0030)
class UPuertsSetting final : public UObject
{
public:
	class FString                                 RootPath;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoModeEnable;                                    // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DebugEnable;                                       // 0x0041(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DebugPort;                                         // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WaitDebugger;                                      // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WaitDebuggerTimeout;                               // 0x0050(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberOfJsEnv;                                     // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WatchDisable;                                      // 0x005C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         IgnoreClassListOnDTS;                              // 0x0060(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         IgnoreStructListOnDTS;                             // 0x0070(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FString                                 PreloadPath;                                       // 0x0080(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableStackTrace;                                  // 0x0090(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PuertsSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PuertsSetting")
	}
	static class UPuertsSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPuertsSetting>();
	}
};
DUMPER7_ASSERTS_UPuertsSetting;

}

