#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RhythmGameFreeFlyCameraConfig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct RhythmGameFreeFlyCameraConfig.RhythmGameFreeFlyCameraConfig
// 0x0038 (0x0038 - 0x0000)
struct FRhythmGameFreeFlyCameraConfig final
{
public:
	struct FVectorDouble                          TargetLoc_3_AD34AF334DB8B9704C774AA15D53AE03;      // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TargetRot_13_C706A2324C08A4BB392D72A98067766E;     // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Radius_6_3CB4E09346625D548EE4C78A81EF3A9C;         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChangeInterval_8_1C9CE9DC486F0B96447E11AEFB1D3B1C; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpDuration_10_A0A5995C4725FFE7052224939C61D95F; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnterTime_18_6706B77B426195A73BEEB6B9A9D09880;     // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExitTime_19_FCFE93DD4F27A834FB5D728A0B61BF96;      // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FRhythmGameFreeFlyCameraConfig;

}

