#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoadNetRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "RoadNetRuntime_structs.hpp"


namespace SDK
{

// Class RoadNetRuntime.RoadNetActor
// 0x0008 (0x02B8 - 0x02B0)
class ARoadNetActor final : public AActor
{
public:
	class URoadNetComponent*                      RoadNetComponent;                                  // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RoadNetActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RoadNetActor")
	}
	static class ARoadNetActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARoadNetActor>();
	}
};
DUMPER7_ASSERTS_ARoadNetActor;

// Class RoadNetRuntime.RoadNetComponent
// 0x0080 (0x05B0 - 0x0530)
class URoadNetComponent final : public UPrimitiveComponent
{
public:
	bool                                          bDrawDebug;                                        // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasBeenEdited;                                    // 0x0529(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52A[0x2];                                      // 0x052A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TileSize;                                          // 0x052C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, struct FRoadNetNode>              RoadNetNodes;                                      // 0x0538(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	uint32                                        RoadNetID;                                         // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   DataBoundsBox;                                     // 0x058C(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A8[0x8];                                      // 0x05A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetLeaveTangentAtNode(int32 NodeID, ERoadNetCoordinateSpace CoordinateSpace) const;
	struct FVector GetLocationAtNode(int32 NodeID, ERoadNetCoordinateSpace CoordinateSpace) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RoadNetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RoadNetComponent")
	}
	static class URoadNetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadNetComponent>();
	}
};
DUMPER7_ASSERTS_URoadNetComponent;

// Class RoadNetRuntime.RoadNetSetting
// 0x0010 (0x0040 - 0x0030)
class URoadNetSetting final : public UObject
{
public:
	struct FVector                                NodePlaceOffset;                                   // 0x0030(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RoadNetSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RoadNetSetting")
	}
	static class URoadNetSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadNetSetting>();
	}
};
DUMPER7_ASSERTS_URoadNetSetting;

}

