#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SBulletDataChild

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct SBulletDataChild.SBulletDataChild
// 0x0018 (0x0018 - 0x0000)
struct FSBulletDataChild final
{
public:
	int64                                         召唤子弹ID_22_5D49BEE649AF32935F81B9BD0D420F93;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         召唤子弹延迟_5_2DE2C15747C77CE8FCAC1D93FC2161C2;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         召唤子弹数量_19_CFBD06674F2A6EEBE21D139019B4BFD3;  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         召唤子弹间隔_20_5F8FE12E46E3F9830F931AA42F7E7E4F;  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          销毁时生成子弹_21_40CFE2924EC8B0F32E1E58AD98469453; // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FSBulletDataChild;

}

