#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCharacterFightInfo

#include "Basic.hpp"

#include "ECharacterLoadType_structs.hpp"
#include "SCharacterMorphInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EMorphType_structs.hpp"


namespace SDK
{

// UserDefinedStruct SCharacterFightInfo.SCharacterFightInfo
// 0x02B0 (0x02B0 - 0x0000)
struct FSCharacterFightInfo final
{
public:
	TSoftObjectPtr<class UDataTable>              SkillDataTable_2_5738D0894D6627807A9BD6A84D2ACCE8; // 0x0000(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              BulletDataTable_4_ADE2A2EE46C27E8E76BA4E8EC23BF3B6; // 0x0030(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UPrimaryDataAsset>       PartHitEffect_10_5B10341B4A72D9A56420A3BFEDED352F; // 0x0060(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              HitEffectTable_38_C0CF41B14FE20AD7BFBFAEAC14A1F599; // 0x0090(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMap<ECharacterLoadType, TSoftObjectPtr<class UDataTable>> SkillDataTableMap_31_C353E1CA4DD9A971C0086299955AA477; // 0x00C0(0x0050)(Edit, BlueprintVisible)
	TMap<ECharacterLoadType, TSoftObjectPtr<class UDataTable>> BulletDataTableMap_32_993E48644937B84BFABE88ADF93218A6; // 0x0110(0x0050)(Edit, BlueprintVisible)
	TMap<ECharacterLoadType, TSoftObjectPtr<class UDataTable>> HitEffectTableMap_41_D98FA35148C90BA224A7C3AAF6887855; // 0x0160(0x0050)(Edit, BlueprintVisible)
	TMap<ECharacterLoadType, struct FSoftClassPath> BpInputMap_72_85C0B54E4061DB93B03344A4CBFA1B8A;  // 0x01B0(0x0050)(Edit, BlueprintVisible)
	TSoftClassPtr<class UClass>                   LinkCharacter_48_3C1740A14D0A9ECA793A05BD082D88BF; // 0x0200(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              CustomParamTable_51_71C3276D47A3B1A7725BB5A208E1F73F; // 0x0230(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMap<EMorphType, struct FSCharacterMorphInfo> MorphModelInfoMap_61_CD000ED74BCA2E80EAB97F8F0515E51F; // 0x0260(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
};
DUMPER7_ASSERTS_FSCharacterFightInfo;

}

