#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SDecorationConfig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SDecorationConfig.SDecorationConfig
// 0x0088 (0x0088 - 0x0000)
struct FSDecorationConfig final
{
public:
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMesh_2_4FD5CE264703B5637BE6708E4214F790;   // 0x0000(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          SetMasterFollow_6_A5A65F16410B4E11F03B8ABA3EB8B576; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   AnimBlueprint_18_4F2AB1F44FBA056964FCAEB500FC44E7; // 0x0038(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FName>                           AttachSocket_16_7A455EDF496D623244D552B3057039CE;  // 0x0068(0x0010)(Edit, BlueprintVisible)
	TArray<struct FTransform>                     AttachTrans_17_4279592D4D9E52CB64385EA1E9C7ACE5;   // 0x0078(0x0010)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FSDecorationConfig;

}

