#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SDynamicMontageParams

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct SDynamicMontageParams.SDynamicMontageParams
// 0x0018 (0x0018 - 0x0000)
struct FSDynamicMontageParams final
{
public:
	class UAnimSequenceBase*                      动画_2_3794D3D1442A819F87705C99D8862FFE;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         进入融合时间_6_E7BC4CBF48288D7C5355808BCE917E7F;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         退出融合时间_8_3420C69E4D8ED20D5898F391A0C90191;   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         播放速率_10_E665DA9642EF3B39410BE8903D10A7BA;      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         开始时间_12_D137D6384AD3E3284A29468A59BCC54F;      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSDynamicMontageParams;

}

