#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SE_ControllerBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function SE_ControllerBase.SE_ControllerBase_C.ExecuteUbergraph_SE_ControllerBase
// 0x0020 (0x0020 - 0x0000)
struct SE_ControllerBase_C_ExecuteUbergraph_SE_ControllerBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_EnvironmentFactor;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_visibility;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_time_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_time_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_time;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_alpha;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SE_ControllerBase_C_ExecuteUbergraph_SE_ControllerBase;

// Function SE_ControllerBase.SE_ControllerBase_C.ApplyEnvironmentFactor
// 0x0004 (0x0004 - 0x0000)
struct SE_ControllerBase_C_ApplyEnvironmentFactor final
{
public:
	float                                         EnvironmentFactor;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SE_ControllerBase_C_ApplyEnvironmentFactor;

// Function SE_ControllerBase.SE_ControllerBase_C.ApplyAlpha
// 0x0004 (0x0004 - 0x0000)
struct SE_ControllerBase_C_ApplyAlpha final
{
public:
	float                                         alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SE_ControllerBase_C_ApplyAlpha;

// Function SE_ControllerBase.SE_ControllerBase_C.Loop
// 0x0004 (0x0004 - 0x0000)
struct SE_ControllerBase_C_Loop final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SE_ControllerBase_C_Loop;

// Function SE_ControllerBase.SE_ControllerBase_C.Start
// 0x0004 (0x0004 - 0x0000)
struct SE_ControllerBase_C_Start final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SE_ControllerBase_C_Start;

// Function SE_ControllerBase.SE_ControllerBase_C.End
// 0x0004 (0x0004 - 0x0000)
struct SE_ControllerBase_C_End final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SE_ControllerBase_C_End;

// Function SE_ControllerBase.SE_ControllerBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SE_ControllerBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SE_ControllerBase_C_ReceiveTick;

// Function SE_ControllerBase.SE_ControllerBase_C.ApplyVisibility
// 0x0001 (0x0001 - 0x0000)
struct SE_ControllerBase_C_ApplyVisibility final
{
public:
	bool                                          visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SE_ControllerBase_C_ApplyVisibility;

}

