#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeqCustomComp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SeqCustomComp.SeqCustomComp_C.ProcessEye
// 0x00DC (0x00DC - 0x0000)
struct SeqCustomComp_C_ProcessEye final
{
public:
	struct FVector                                EyeLookAt;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngleScale;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNamedCurveValue                       K2Node_MakeStruct_NamedCurveValue;                 // 0x0034(0x0010)(NoDestructor)
	struct FNamedCurveValue                       K2Node_MakeStruct_NamedCurveValue_1;               // 0x0044(0x0010)(NoDestructor)
	struct FNamedCurveValue                       K2Node_MakeStruct_NamedCurveValue_2;               // 0x0054(0x0010)(NoDestructor)
	struct FNamedCurveValue                       K2Node_MakeStruct_NamedCurveValue_3;               // 0x0064(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNamedCurveValue                       K2Node_MakeStruct_NamedCurveValue_4;               // 0x007C(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNamedCurveValue                       K2Node_MakeStruct_NamedCurveValue_5;               // 0x0090(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNamedCurveValue                       K2Node_MakeStruct_NamedCurveValue_6;               // 0x00B4(0x0010)(NoDestructor)
	struct FNamedCurveValue                       K2Node_MakeStruct_NamedCurveValue_7;               // 0x00C4(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SeqCustomComp_C_ProcessEye) == 0x000004, "Wrong alignment on SeqCustomComp_C_ProcessEye");
static_assert(sizeof(SeqCustomComp_C_ProcessEye) == 0x0000DC, "Wrong size on SeqCustomComp_C_ProcessEye");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, EyeLookAt) == 0x000000, "Member 'SeqCustomComp_C_ProcessEye::EyeLookAt' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, AngleScale) == 0x00000C, "Member 'SeqCustomComp_C_ProcessEye::AngleScale' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_BreakVector_X) == 0x000010, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_BreakVector_Y) == 0x000014, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_BreakVector_Z) == 0x000018, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Abs_ReturnValue) == 0x00001C, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Abs_ReturnValue_1) == 0x000024, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_FClamp_ReturnValue) == 0x000030, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, K2Node_MakeStruct_NamedCurveValue) == 0x000034, "Member 'SeqCustomComp_C_ProcessEye::K2Node_MakeStruct_NamedCurveValue' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, K2Node_MakeStruct_NamedCurveValue_1) == 0x000044, "Member 'SeqCustomComp_C_ProcessEye::K2Node_MakeStruct_NamedCurveValue_1' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, K2Node_MakeStruct_NamedCurveValue_2) == 0x000054, "Member 'SeqCustomComp_C_ProcessEye::K2Node_MakeStruct_NamedCurveValue_2' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, K2Node_MakeStruct_NamedCurveValue_3) == 0x000064, "Member 'SeqCustomComp_C_ProcessEye::K2Node_MakeStruct_NamedCurveValue_3' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Array_Add_ReturnValue) == 0x000074, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Array_Add_ReturnValue_1) == 0x000078, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, K2Node_MakeStruct_NamedCurveValue_4) == 0x00007C, "Member 'SeqCustomComp_C_ProcessEye::K2Node_MakeStruct_NamedCurveValue_4' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Array_Add_ReturnValue_2) == 0x00008C, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, K2Node_MakeStruct_NamedCurveValue_5) == 0x000090, "Member 'SeqCustomComp_C_ProcessEye::K2Node_MakeStruct_NamedCurveValue_5' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Array_Add_ReturnValue_3) == 0x0000A0, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Array_Add_ReturnValue_4) == 0x0000A4, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Array_Add_ReturnValue_5) == 0x0000A8, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000AC, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_FClamp_ReturnValue_1) == 0x0000B0, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, K2Node_MakeStruct_NamedCurveValue_6) == 0x0000B4, "Member 'SeqCustomComp_C_ProcessEye::K2Node_MakeStruct_NamedCurveValue_6' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, K2Node_MakeStruct_NamedCurveValue_7) == 0x0000C4, "Member 'SeqCustomComp_C_ProcessEye::K2Node_MakeStruct_NamedCurveValue_7' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Array_Add_ReturnValue_6) == 0x0000D4, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_ProcessEye, CallFunc_Array_Add_ReturnValue_7) == 0x0000D8, "Member 'SeqCustomComp_C_ProcessEye::CallFunc_Array_Add_ReturnValue_7' has a wrong offset!");

// Function SeqCustomComp.SeqCustomComp_C.Set Vector Data
// 0x0070 (0x0070 - 0x0000)
struct SeqCustomComp_C_Set_Vector_Data final
{
public:
	TMap<class FName, struct FVector>             Name_0;                                            // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   ___name_Variable;                                  // 0x0050(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Map_Find_Value;                           // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SeqCustomComp_C_Set_Vector_Data) == 0x000008, "Wrong alignment on SeqCustomComp_C_Set_Vector_Data");
static_assert(sizeof(SeqCustomComp_C_Set_Vector_Data) == 0x000070, "Wrong size on SeqCustomComp_C_Set_Vector_Data");
static_assert(offsetof(SeqCustomComp_C_Set_Vector_Data, Name_0) == 0x000000, "Member 'SeqCustomComp_C_Set_Vector_Data::Name_0' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_Set_Vector_Data, ___name_Variable) == 0x000050, "Member 'SeqCustomComp_C_Set_Vector_Data::___name_Variable' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_Set_Vector_Data, CallFunc_Map_Find_Value) == 0x00005C, "Member 'SeqCustomComp_C_Set_Vector_Data::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_Set_Vector_Data, CallFunc_Map_Find_ReturnValue) == 0x000068, "Member 'SeqCustomComp_C_Set_Vector_Data::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function SeqCustomComp.SeqCustomComp_C.GetCurveValue
// 0x0010 (0x0010 - 0x0000)
struct SeqCustomComp_C_GetCurveValue final
{
public:
	class FName                                   CurveName;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SeqCustomComp_C_GetCurveValue) == 0x000004, "Wrong alignment on SeqCustomComp_C_GetCurveValue");
static_assert(sizeof(SeqCustomComp_C_GetCurveValue) == 0x000010, "Wrong size on SeqCustomComp_C_GetCurveValue");
static_assert(offsetof(SeqCustomComp_C_GetCurveValue, CurveName) == 0x000000, "Member 'SeqCustomComp_C_GetCurveValue::CurveName' has a wrong offset!");
static_assert(offsetof(SeqCustomComp_C_GetCurveValue, ReturnValue) == 0x00000C, "Member 'SeqCustomComp_C_GetCurveValue::ReturnValue' has a wrong offset!");

// Function SeqCustomComp.SeqCustomComp_C.GetCurves
// 0x0010 (0x0010 - 0x0000)
struct SeqCustomComp_C_GetCurves final
{
public:
	TArray<struct FNamedCurveValue>               OutValues;                                         // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(SeqCustomComp_C_GetCurves) == 0x000008, "Wrong alignment on SeqCustomComp_C_GetCurves");
static_assert(sizeof(SeqCustomComp_C_GetCurves) == 0x000010, "Wrong size on SeqCustomComp_C_GetCurves");
static_assert(offsetof(SeqCustomComp_C_GetCurves, OutValues) == 0x000000, "Member 'SeqCustomComp_C_GetCurves::OutValues' has a wrong offset!");

// Function SeqCustomComp.SeqCustomComp_C.GetBindingName
// 0x000C (0x000C - 0x0000)
struct SeqCustomComp_C_GetBindingName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SeqCustomComp_C_GetBindingName) == 0x000004, "Wrong alignment on SeqCustomComp_C_GetBindingName");
static_assert(sizeof(SeqCustomComp_C_GetBindingName) == 0x00000C, "Wrong size on SeqCustomComp_C_GetBindingName");
static_assert(offsetof(SeqCustomComp_C_GetBindingName, ReturnValue) == 0x000000, "Member 'SeqCustomComp_C_GetBindingName::ReturnValue' has a wrong offset!");

}

