#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeqCustomComp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SeqCustomComp.SeqCustomComp_C
// 0x0018 (0x00D8 - 0x00C0)
class USeqCustomComp_C final : public UActorComponent
{
public:
	TArray<struct FNamedCurveValue>               CurveData;                                         // 0x00C0(0x0010)(Edit, BlueprintVisible)
	float                                         SeqLHandWeight;                                    // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SeqRHandWeight;                                    // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ProcessEye(const struct FVector& EyeLookAt, float AngleScale);
	void Set_Vector_Data(const TMap<class FName, struct FVector>& Name_0);

	float GetCurveValue(class FName CurveName) const;
	void GetCurves(TArray<struct FNamedCurveValue>* OutValues) const;
	class FName GetBindingName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SeqCustomComp_C">();
	}
	static class USeqCustomComp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USeqCustomComp_C>();
	}
};
static_assert(alignof(USeqCustomComp_C) == 0x000008, "Wrong alignment on USeqCustomComp_C");
static_assert(sizeof(USeqCustomComp_C) == 0x0000D8, "Wrong size on USeqCustomComp_C");
static_assert(offsetof(USeqCustomComp_C, CurveData) == 0x0000C0, "Member 'USeqCustomComp_C::CurveData' has a wrong offset!");
static_assert(offsetof(USeqCustomComp_C, SeqLHandWeight) == 0x0000D0, "Member 'USeqCustomComp_C::SeqLHandWeight' has a wrong offset!");
static_assert(offsetof(USeqCustomComp_C, SeqRHandWeight) == 0x0000D4, "Member 'USeqCustomComp_C::SeqRHandWeight' has a wrong offset!");

}

