#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SequenceDialogue

#include "Basic.hpp"

#include "MovieScene_classes.hpp"
#include "Engine_classes.hpp"
#include "SequenceDialogue_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class SequenceDialogue.MovieSceneAutoTransformSection
// 0x0008 (0x0100 - 0x00F8)
class UMovieSceneAutoTransformSection final : public UMovieSceneSection
{
public:
	bool                                          bApplyCameraProperties;                            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneAutoTransformSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneAutoTransformSection")
	}
	static class UMovieSceneAutoTransformSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneAutoTransformSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneAutoTransformSection;

// Class SequenceDialogue.MovieSceneAutoTransformTrack
// 0x0018 (0x00B0 - 0x0098)
class UMovieSceneAutoTransformTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneAutoTransformTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneAutoTransformTrack")
	}
	static class UMovieSceneAutoTransformTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneAutoTransformTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneAutoTransformTrack;

// Class SequenceDialogue.MovieSceneDialogueAudioSection
// 0x0018 (0x0110 - 0x00F8)
class UMovieSceneDialogueAudioSection final : public UMovieSceneSection
{
public:
	class FString                                 AudioKey;                                          // 0x00F8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AudioTransitionDuration;                           // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneDialogueAudioSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneDialogueAudioSection")
	}
	static class UMovieSceneDialogueAudioSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDialogueAudioSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneDialogueAudioSection;

// Class SequenceDialogue.MovieSceneDialogueAudioTrack
// 0x0018 (0x00B0 - 0x0098)
class UMovieSceneDialogueAudioTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneDialogueAudioTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneDialogueAudioTrack")
	}
	static class UMovieSceneDialogueAudioTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDialogueAudioTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneDialogueAudioTrack;

// Class SequenceDialogue.MovieSceneDialogueSection
// 0x0098 (0x0190 - 0x00F8)
class UMovieSceneDialogueSection final : public UMovieSceneSection
{
public:
	class FText                                   DialogueInfo;                                      // 0x00F8(0x0018)(Edit, NativeAccessSpecifierPrivate)
	int32                                         Index_0;                                           // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   SpeakerName;                                       // 0x0118(0x0018)(Edit, NativeAccessSpecifierPrivate)
	int32                                         SpeakerID;                                         // 0x0130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DialogueID;                                        // 0x0138(0x0018)(Edit, NativeAccessSpecifierPrivate)
	TArray<class FText>                           DialogueInfos;                                     // 0x0150(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class FText>                           OptionInfos;                                       // 0x0160(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                         GuardTime;                                         // 0x0170(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AudioDelay;                                        // 0x0174(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AudioTransitionDuration;                           // 0x0178(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ELanguageAudio                                LanguageType;                                      // 0x017C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QteId;                                             // 0x0180(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AutoPlayDelay;                                     // 0x0184(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          EnableGuardTime;                                   // 0x0188(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          EnableAutoPlayDelay;                               // 0x0189(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneDialogueSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneDialogueSection")
	}
	static class UMovieSceneDialogueSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDialogueSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneDialogueSection;

// Class SequenceDialogue.MovieSceneDialogueStateSection
// 0x0008 (0x0100 - 0x00F8)
class UMovieSceneDialogueStateSection final : public UMovieSceneSection
{
public:
	struct FDialogueStateStruct                   SectionData;                                       // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneDialogueStateSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneDialogueStateSection")
	}
	static class UMovieSceneDialogueStateSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDialogueStateSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneDialogueStateSection;

// Class SequenceDialogue.MovieSceneDialogueStateTrack
// 0x0018 (0x00B0 - 0x0098)
class UMovieSceneDialogueStateTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneDialogueStateTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneDialogueStateTrack")
	}
	static class UMovieSceneDialogueStateTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDialogueStateTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneDialogueStateTrack;

// Class SequenceDialogue.MovieSceneDialogueSubsystem
// 0x0088 (0x00C0 - 0x0038)
class UMovieSceneDialogueSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bShow, const class FText& DialogueID, const int32 GuardTime, const int32 AudioDelay, const int32 AudioTransitionDuration, const ELanguageAudio LanguageType, const int32 AutoPlayDelay)> OnShowDialogue; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bShow, const class FString& AudioKey, const int32 AudioTransitionDuration)> OnShowDialogueAudio; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UMovieSceneQteManager*                  QteManager;                                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x10];                                      // 0x0068(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AutoTransformActor;                                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMovieScene3DTransformTrack*            AutoTransformDataTrack;                            // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMovieScene3DAttachTrack*               AutoTransformAttachTrack;                          // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UMovieScenePropertyTrack*>       AutoTransformPropertyTracks;                       // 0x0090(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x20];                                      // 0x00A0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ShowDialogue(bool bShow, const class FText& DialogueID, const int32 GuardTime, const int32 AudioDelay, const int32 AudioTransitionDuration, const ELanguageAudio LanguageType, const int32 AutoPlayDelay);
	void ShowDialogueAudio(bool bShow, const class FString& AudioKey, const int32 AudioTransitionDuration);
	bool TryGetAutoTransformByOffsetTime(struct FTransform* OutTrans, float OffsetTime, bool bApplyCameraProperties);

	class UMovieSceneQteManager* GetQteManager() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneDialogueSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneDialogueSubsystem")
	}
	static class UMovieSceneDialogueSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDialogueSubsystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneDialogueSubsystem;

// Class SequenceDialogue.MovieSceneDialogueTrack
// 0x0020 (0x00B8 - 0x0098)
class UMovieSceneDialogueTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	ELanguageAudio                                LanguageType;                                      // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneDialogueTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneDialogueTrack")
	}
	static class UMovieSceneDialogueTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDialogueTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneDialogueTrack;

// Class SequenceDialogue.MovieSceneQteManager
// 0x0108 (0x0138 - 0x0030)
class UMovieSceneQteManager final : public UObject
{
public:
	TMulticastInlineDelegate<void(int32 QteId)>   OnQteAnimEnd;                                      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMovieSceneQteEventParam& Param)> OnQteStart;         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<class UAnimInstance*, struct FMovieSceneQteAnimParams> AnimMap;                             // 0x0050(0x0050)(Transient, NativeAccessSpecifierPrivate)
	class ALevelSequenceActor*                    QteSeqActor;                                       // 0x00A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UAnimMontage*, class UAnimInstance*> MontageToAnimInstance;                           // 0x00B0(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x38];                                     // 0x0100(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FinishQte(int32 Id);
	void OnMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);
	void OnSequencePaused();
	void UpdateQte(int32 Id, bool bProgress, float ProgressPercentage);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneQteManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneQteManager")
	}
	static class UMovieSceneQteManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneQteManager>();
	}
};
DUMPER7_ASSERTS_UMovieSceneQteManager;

// Class SequenceDialogue.MovieSceneQteSection
// 0x0098 (0x0190 - 0x00F8)
class UMovieSceneQteSection final : public UMovieSceneSection
{
public:
	struct FMovieSceneQteParams                   Params_0;                                          // 0x00F8(0x0098)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneQteSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneQteSection")
	}
	static class UMovieSceneQteSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneQteSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneQteSection;

// Class SequenceDialogue.MovieSceneQteTrack
// 0x0018 (0x00B0 - 0x0098)
class UMovieSceneQteTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneQteTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneQteTrack")
	}
	static class UMovieSceneQteTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneQteTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneQteTrack;

// Class SequenceDialogue.MovieSceneQteTriggerSection
// 0x0088 (0x0180 - 0x00F8)
class UMovieSceneQteTriggerSection final : public UMovieSceneSection
{
public:
	struct FMovieSceneQteTriggerChannel           DataChannel;                                       // 0x00F8(0x0088)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneQteTriggerSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneQteTriggerSection")
	}
	static class UMovieSceneQteTriggerSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneQteTriggerSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneQteTriggerSection;

// Class SequenceDialogue.MovieSceneSeqAnimDataSection
// 0x0020 (0x0118 - 0x00F8)
class UMovieSceneSeqAnimDataSection final : public UMovieSceneSection
{
public:
	TArray<struct FFloatNameAndCurve>             FloatNamesAndCurves;                               // 0x00F8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVectorNameAndCurve>            VectorNameAndCurves;                               // 0x0108(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void AddScalarParameterKey(class FName InParameterName, const struct FFrameNumber& InTime, float InValue);
	void AddScalarParameterKeyCustom(const struct FSeqAnimCurveFloatDesc& InParameterName, const struct FFrameNumber& InTime, float InValue);
	void AddVectorParameterKey(class FName InParameterName, const struct FFrameNumber& InTime, const struct FVector& InValue);
	void AddVectorParameterKeyCustom(const struct FSeqAnimCurveVectorDesc& InParameterName, const struct FFrameNumber& InTime, const struct FVector& InValue);
	void EmptyParameters();
	bool GetScalarParameters(const struct FFrameNumber& InTime, TMap<class FName, float>* Floats);
	bool GetVectorParameter(class FName InParameterName, const struct FFrameNumber& InTime, struct FVector* Value);
	bool RemoveCategory(class FName InParameterName);
	bool RemoveScalarParameter(class FName InParameterName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSeqAnimDataSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSeqAnimDataSection")
	}
	static class UMovieSceneSeqAnimDataSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSeqAnimDataSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSeqAnimDataSection;

// Class SequenceDialogue.MovieSceneSeqAnimDataTrack
// 0x0018 (0x00B0 - 0x0098)
class UMovieSceneSeqAnimDataTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSeqAnimDataTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSeqAnimDataTrack")
	}
	static class UMovieSceneSeqAnimDataTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSeqAnimDataTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSeqAnimDataTrack;

// Class SequenceDialogue.SeqAnimDataSetting
// 0x0040 (0x0070 - 0x0030)
class USeqAnimDataSetting final : public UObject
{
public:
	TArray<struct FSeqAnimCurveFloatDesc>         SeqAnimCurveFloats;                                // 0x0030(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	TArray<struct FSeqAnimCurveVectorDesc>        SeqAnimCurveVectors;                               // 0x0040(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	TArray<struct FSeqAnimCurveFloatDesc>         FrequentSeqAnimCurveFloats;                        // 0x0050(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	TArray<struct FSeqAnimCurveVectorDesc>        FrequentSeqAnimCurveVectors;                       // 0x0060(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SeqAnimDataSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SeqAnimDataSetting")
	}
	static class USeqAnimDataSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<USeqAnimDataSetting>();
	}
};
DUMPER7_ASSERTS_USeqAnimDataSetting;

// Class SequenceDialogue.SeqAnimDataInterface
// 0x0000 (0x0000 - 0x0000)
class ISeqAnimDataInterface final
{
public:
	bool GetAnimDataFloat(TArray<struct FNamedCurveValue>* FloatCurveData);
	bool GetAnimDataTransform(TMap<class FName, struct FTransform>* FloatCurveData);
	bool GetAnimDataVector(TMap<class FName, struct FVector>* VectorCurveData);
	TArray<class FName> GetSupportGroupNames();
	bool IsCustomSupport();
	bool SetAnimDataFloat(const TArray<struct FNamedCurveValue>& FloatCurveData);
	bool SetAnimDataTransform(const TMap<class FName, struct FTransform>& FloatCurveData);
	bool SetAnimDataVector(const TMap<class FName, struct FVector>& VectorCurveData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SeqAnimDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SeqAnimDataInterface")
	}
	static class ISeqAnimDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISeqAnimDataInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ISeqAnimDataInterface;

// Class SequenceDialogue.SeqAutoTransformInterface
// 0x0000 (0x0000 - 0x0000)
class ISeqAutoTransformInterface final
{
public:
	void BeginAutoTransform(float TimeLength);
	void EndAutoTransform();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SeqAutoTransformInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SeqAutoTransformInterface")
	}
	static class ISeqAutoTransformInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISeqAutoTransformInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ISeqAutoTransformInterface;

// Class SequenceDialogue.SeqQteAnimInterface
// 0x0000 (0x0000 - 0x0000)
class ISeqQteAnimInterface final
{
public:
	float GetStateAnimAlpha();
	void SetStateAnimAlpha(float Alpha);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SeqQteAnimInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SeqQteAnimInterface")
	}
	static class ISeqQteAnimInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISeqQteAnimInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ISeqQteAnimInterface;

}

