#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SFloatingMovementState

#include "Basic.hpp"

#include "EFloatingMovementType_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct SFloatingMovementState.SFloatingMovementState
// 0x0088 (0x0088 - 0x0000)
struct FSFloatingMovementState final
{
public:
	EFloatingMovementType                         Mode_14_4F2532A0400CAE93941E589E9BB2FF4C;          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  MovementTagList_7_259A5608480113CF6FB2D1813BD06183; // 0x0008(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  BannedMovementTagList_10_297AAA614E429082604076A210D3E7C4; // 0x0028(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  MoveTagList_16_C3602E7246136CC207C2B3BF662DDF2B;   // 0x0048(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  StandTagList_18_702D0F5A4D1420A200F03299DD4BF7F2;  // 0x0068(0x0020)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FSFloatingMovementState;

}

