#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sharphereal

#include "Basic.hpp"


namespace SDK
{

// Enum Sharphereal.ETestEnumInt32BlueprintType
// NumValues: 0x0003
enum class ETestEnumInt32BlueprintType : uint8
{
	TEBTI32_0                                = 0,
	TEBTI32_256                              = 256,
	TEBTI32_MAX                              = 257,
};

// Enum Sharphereal.EMonoAotMode
// NumValues: 0x000B
enum class EMonoAotMode : uint8
{
	Auto                                     = 18446744073709551615,
	MONO_AOT_MODE_NONE                       = 0,
	MONO_AOT_MODE_NORMAL                     = 1,
	MONO_AOT_MODE_HYBRID                     = 2,
	MONO_AOT_MODE_FULL                       = 3,
	MONO_AOT_MODE_LLVMONLY                   = 4,
	MONO_AOT_MODE_INTERP                     = 5,
	MONO_AOT_MODE_INTERP_LLVMONLY            = 6,
	MONO_AOT_MODE_LLVMONLY_INTERP            = 7,
	MONO_AOT_MODE_INTERP_ONLY                = 8,
	EMonoAotMode_MAX                         = 9,
};

// Enum Sharphereal.EKooSharpMonoTraceMask
// NumValues: 0x0018
enum class EKooSharpMonoTraceMask : uint8
{
	ALL                                      = 0,
	MONO_TRACE_ASSEMBLY                      = 1,
	MONO_TRACE_TYPE                          = 2,
	MONO_TRACE_DLLIMPORT                     = 3,
	MONO_TRACE_GC                            = 4,
	MONO_TRACE_CONFIG                        = 5,
	MONO_TRACE_AOT                           = 6,
	MONO_TRACE_SECURITY                      = 7,
	MONO_TRACE_THREADPOOL                    = 8,
	MONO_TRACE_IO_SELECTOR                   = 9,
	MONO_TRACE_IO_LAYER_PROCESS              = 10,
	MONO_TRACE_IO_LAYER_SOCKET               = 11,
	MONO_TRACE_IO_LAYER_FILE                 = 12,
	MONO_TRACE_IO_LAYER_EVENT                = 13,
	MONO_TRACE_IO_LAYER_SEMAPHORE            = 14,
	MONO_TRACE_IO_LAYER_MUTEX                = 15,
	MONO_TRACE_IO_LAYER_HANDLE               = 16,
	MONO_TRACE_TAILCALL                      = 17,
	MONO_TRACE_PROFILER                      = 18,
	MONO_TRACE_TIERED                        = 19,
	MONO_TRACE_QCALL                         = 20,
	MONO_TRACE_METADATA_UPDATE               = 21,
	MONO_TRACE_DIAGNOSTICS                   = 22,
	EKooSharpMonoTraceMask_MAX               = 23,
};

// Enum Sharphereal.EKooSharpMonoTraceLevel
// NumValues: 0x0007
enum class EKooSharpMonoTraceLevel : uint8
{
	error                                    = 0,
	critical                                 = 1,
	warning                                  = 2,
	message                                  = 3,
	info                                     = 4,
	debug                                    = 5,
	EKooSharpMonoTraceLevel_MAX              = 6,
};

// Enum Sharphereal.EKooSharpBuildConfiguration
// NumValues: 0x0009
enum class EKooSharpBuildConfiguration : uint8
{
	Debug                                    = 0,
	DebugEditor                              = 1,
	DebugGame                                = 2,
	DebugGameEditor                          = 3,
	Development                              = 4,
	DevelopmentEditor                        = 5,
	Test                                     = 6,
	Shipping                                 = 7,
	EKooSharpBuildConfiguration_MAX          = 8,
};

// ScriptStruct Sharphereal.KooSharpMonoTraceMaskRuntimeSettings
// 0x0050 (0x0050 - 0x0000)
struct FKooSharpMonoTraceMaskRuntimeSettings final
{
public:
	TArray<EKooSharpMonoTraceMask>                Debug;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EKooSharpMonoTraceMask>                DebugGame;                                         // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EKooSharpMonoTraceMask>                Development;                                       // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EKooSharpMonoTraceMask>                Test;                                              // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EKooSharpMonoTraceMask>                Shipping;                                          // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKooSharpMonoTraceMaskRuntimeSettings;

// ScriptStruct Sharphereal.KooSharpMonoTraceLevelRuntimeSettings
// 0x0005 (0x0005 - 0x0000)
struct FKooSharpMonoTraceLevelRuntimeSettings final
{
public:
	EKooSharpMonoTraceLevel                       Debug;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKooSharpMonoTraceLevel                       DebugGame;                                         // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKooSharpMonoTraceLevel                       Development;                                       // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKooSharpMonoTraceLevel                       Test;                                              // 0x0003(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKooSharpMonoTraceLevel                       Shipping;                                          // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKooSharpMonoTraceLevelRuntimeSettings;

}

