#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sharphereal

#include "Basic.hpp"

#include "Sharphereal_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class Sharphereal.CSharpBlueprintFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UCSharpBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void CallCSharpFunction(const class FString& ImageName, const class FString& NameSpaceName, const class FString& ClassName, const class FString& MethodName, int32 ParamsCount, class UGameInstance* GameInstance);
	static bool HasCSharpEnvironmentInitialized();
	static bool HasSharpherealModuleGreyBoxHit();
	static bool HasSharpherealModuleStartup();
	static void InitializeMonoEnvironment();
	static bool IsPureCSharpEnvironment();
	static void Test2(ETestEnumInt32BlueprintType TestEnumInt32BlueprintType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CSharpBlueprintFunctionLibrary">();
	}
	static class UCSharpBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCSharpBlueprintFunctionLibrary>();
	}
};
static_assert(alignof(UCSharpBlueprintFunctionLibrary) == 0x000008, "Wrong alignment on UCSharpBlueprintFunctionLibrary");
static_assert(sizeof(UCSharpBlueprintFunctionLibrary) == 0x000030, "Wrong size on UCSharpBlueprintFunctionLibrary");

// Class Sharphereal.CSharpGeneratedClass
// 0x0000 (0x0338 - 0x0338)
class UCSharpGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CSharpGeneratedClass">();
	}
	static class UCSharpGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCSharpGeneratedClass>();
	}
};
static_assert(alignof(UCSharpGeneratedClass) == 0x000008, "Wrong alignment on UCSharpGeneratedClass");
static_assert(sizeof(UCSharpGeneratedClass) == 0x000338, "Wrong size on UCSharpGeneratedClass");

// Class Sharphereal.DelegateProxy
// 0x0078 (0x00A8 - 0x0030)
class UDelegateProxy final : public UObject
{
public:
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ProxyFunction0();
	void ProxyFunction1();
	void ProxyFunction10();
	void ProxyFunction100();
	void ProxyFunction101();
	void ProxyFunction102();
	void ProxyFunction103();
	void ProxyFunction104();
	void ProxyFunction105();
	void ProxyFunction106();
	void ProxyFunction107();
	void ProxyFunction108();
	void ProxyFunction109();
	void ProxyFunction11();
	void ProxyFunction110();
	void ProxyFunction111();
	void ProxyFunction112();
	void ProxyFunction113();
	void ProxyFunction114();
	void ProxyFunction115();
	void ProxyFunction116();
	void ProxyFunction117();
	void ProxyFunction118();
	void ProxyFunction119();
	void ProxyFunction12();
	void ProxyFunction120();
	void ProxyFunction121();
	void ProxyFunction122();
	void ProxyFunction123();
	void ProxyFunction124();
	void ProxyFunction125();
	void ProxyFunction126();
	void ProxyFunction127();
	void ProxyFunction13();
	void ProxyFunction14();
	void ProxyFunction15();
	void ProxyFunction16();
	void ProxyFunction17();
	void ProxyFunction18();
	void ProxyFunction19();
	void ProxyFunction2();
	void ProxyFunction20();
	void ProxyFunction21();
	void ProxyFunction22();
	void ProxyFunction23();
	void ProxyFunction24();
	void ProxyFunction25();
	void ProxyFunction26();
	void ProxyFunction27();
	void ProxyFunction28();
	void ProxyFunction29();
	void ProxyFunction3();
	void ProxyFunction30();
	void ProxyFunction31();
	void ProxyFunction32();
	void ProxyFunction33();
	void ProxyFunction34();
	void ProxyFunction35();
	void ProxyFunction36();
	void ProxyFunction37();
	void ProxyFunction38();
	void ProxyFunction39();
	void ProxyFunction4();
	void ProxyFunction40();
	void ProxyFunction41();
	void ProxyFunction42();
	void ProxyFunction43();
	void ProxyFunction44();
	void ProxyFunction45();
	void ProxyFunction46();
	void ProxyFunction47();
	void ProxyFunction48();
	void ProxyFunction49();
	void ProxyFunction5();
	void ProxyFunction50();
	void ProxyFunction51();
	void ProxyFunction52();
	void ProxyFunction53();
	void ProxyFunction54();
	void ProxyFunction55();
	void ProxyFunction56();
	void ProxyFunction57();
	void ProxyFunction58();
	void ProxyFunction59();
	void ProxyFunction6();
	void ProxyFunction60();
	void ProxyFunction61();
	void ProxyFunction62();
	void ProxyFunction63();
	void ProxyFunction64();
	void ProxyFunction65();
	void ProxyFunction66();
	void ProxyFunction67();
	void ProxyFunction68();
	void ProxyFunction69();
	void ProxyFunction7();
	void ProxyFunction70();
	void ProxyFunction71();
	void ProxyFunction72();
	void ProxyFunction73();
	void ProxyFunction74();
	void ProxyFunction75();
	void ProxyFunction76();
	void ProxyFunction77();
	void ProxyFunction78();
	void ProxyFunction79();
	void ProxyFunction8();
	void ProxyFunction80();
	void ProxyFunction81();
	void ProxyFunction82();
	void ProxyFunction83();
	void ProxyFunction84();
	void ProxyFunction85();
	void ProxyFunction86();
	void ProxyFunction87();
	void ProxyFunction88();
	void ProxyFunction89();
	void ProxyFunction9();
	void ProxyFunction90();
	void ProxyFunction91();
	void ProxyFunction92();
	void ProxyFunction93();
	void ProxyFunction94();
	void ProxyFunction95();
	void ProxyFunction96();
	void ProxyFunction97();
	void ProxyFunction98();
	void ProxyFunction99();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelegateProxy">();
	}
	static class UDelegateProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelegateProxy>();
	}
};
static_assert(alignof(UDelegateProxy) == 0x000008, "Wrong alignment on UDelegateProxy");
static_assert(sizeof(UDelegateProxy) == 0x0000A8, "Wrong size on UDelegateProxy");

// Class Sharphereal.JsBridgetBlueprintFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UJsBridgetBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void CSharpCallJavascript(uint32 EventId, int32 TargetId, uint8 ParameterCount, uint64 ParameterBufferPtr);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JsBridgetBlueprintFunctionLibrary">();
	}
	static class UJsBridgetBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJsBridgetBlueprintFunctionLibrary>();
	}
};
static_assert(alignof(UJsBridgetBlueprintFunctionLibrary) == 0x000008, "Wrong alignment on UJsBridgetBlueprintFunctionLibrary");
static_assert(sizeof(UJsBridgetBlueprintFunctionLibrary) == 0x000030, "Wrong size on UJsBridgetBlueprintFunctionLibrary");

// Class Sharphereal.KooSharpRuntimeSettings
// 0x0130 (0x0178 - 0x0048)
class UKooSharpRuntimeSettings final : public UDeveloperSettings
{
public:
	TArray<EKooSharpBuildConfiguration>           EnableDebugger;                                    // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<EKooSharpBuildConfiguration>           WaitForDebugger;                                   // 0x0058(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint16                                        DebuggerPort;                                      // 0x0068(0x0002)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKooSharpMonoTraceLevelRuntimeSettings MonoTraceLevel;                                    // 0x006A(0x0005)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKooSharpMonoTraceMaskRuntimeSettings  MonoTraceMask;                                     // 0x0070(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	int32                                         MonoDebuggerLogLevel;                              // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MonoDebuggerLogFile;                               // 0x00C8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MonoGCDebugArgs;                                   // 0x00D8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EKooSharpBuildConfiguration>           EnableMonoStatForMemory;                           // 0x00E8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<EKooSharpBuildConfiguration>           EnableMonoStatForJIT;                              // 0x00F8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<EKooSharpBuildConfiguration>           EnableMonoStatForGC;                               // 0x0108(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bEnableCSharpEnvironment;                          // 0x0118(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseMMapLoadDLL;                                   // 0x0119(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLogJitAddress;                                    // 0x011A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ScriptAssembliesPath;                              // 0x0120(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ScriptAssembliesEditorPath;                        // 0x0130(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ScriptAssembliesNonShippingPath;                   // 0x0140(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMonoAotMode                                  MonoAOTMode;                                       // 0x0150(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         EditorPreloadAssemblies;                           // 0x0158(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         RuntimeLoadAssemblies;                             // 0x0168(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KooSharpRuntimeSettings">();
	}
	static class UKooSharpRuntimeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKooSharpRuntimeSettings>();
	}
};
static_assert(alignof(UKooSharpRuntimeSettings) == 0x000008, "Wrong alignment on UKooSharpRuntimeSettings");
static_assert(sizeof(UKooSharpRuntimeSettings) == 0x000178, "Wrong size on UKooSharpRuntimeSettings");
static_assert(offsetof(UKooSharpRuntimeSettings, EnableDebugger) == 0x000048, "Member 'UKooSharpRuntimeSettings::EnableDebugger' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, WaitForDebugger) == 0x000058, "Member 'UKooSharpRuntimeSettings::WaitForDebugger' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, DebuggerPort) == 0x000068, "Member 'UKooSharpRuntimeSettings::DebuggerPort' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, MonoTraceLevel) == 0x00006A, "Member 'UKooSharpRuntimeSettings::MonoTraceLevel' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, MonoTraceMask) == 0x000070, "Member 'UKooSharpRuntimeSettings::MonoTraceMask' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, MonoDebuggerLogLevel) == 0x0000C0, "Member 'UKooSharpRuntimeSettings::MonoDebuggerLogLevel' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, MonoDebuggerLogFile) == 0x0000C8, "Member 'UKooSharpRuntimeSettings::MonoDebuggerLogFile' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, MonoGCDebugArgs) == 0x0000D8, "Member 'UKooSharpRuntimeSettings::MonoGCDebugArgs' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, EnableMonoStatForMemory) == 0x0000E8, "Member 'UKooSharpRuntimeSettings::EnableMonoStatForMemory' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, EnableMonoStatForJIT) == 0x0000F8, "Member 'UKooSharpRuntimeSettings::EnableMonoStatForJIT' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, EnableMonoStatForGC) == 0x000108, "Member 'UKooSharpRuntimeSettings::EnableMonoStatForGC' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, bEnableCSharpEnvironment) == 0x000118, "Member 'UKooSharpRuntimeSettings::bEnableCSharpEnvironment' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, bUseMMapLoadDLL) == 0x000119, "Member 'UKooSharpRuntimeSettings::bUseMMapLoadDLL' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, bLogJitAddress) == 0x00011A, "Member 'UKooSharpRuntimeSettings::bLogJitAddress' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, ScriptAssembliesPath) == 0x000120, "Member 'UKooSharpRuntimeSettings::ScriptAssembliesPath' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, ScriptAssembliesEditorPath) == 0x000130, "Member 'UKooSharpRuntimeSettings::ScriptAssembliesEditorPath' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, ScriptAssembliesNonShippingPath) == 0x000140, "Member 'UKooSharpRuntimeSettings::ScriptAssembliesNonShippingPath' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, MonoAOTMode) == 0x000150, "Member 'UKooSharpRuntimeSettings::MonoAOTMode' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, EditorPreloadAssemblies) == 0x000158, "Member 'UKooSharpRuntimeSettings::EditorPreloadAssemblies' has a wrong offset!");
static_assert(offsetof(UKooSharpRuntimeSettings, RuntimeLoadAssemblies) == 0x000168, "Member 'UKooSharpRuntimeSettings::RuntimeLoadAssemblies' has a wrong offset!");

}

