#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sharphereal

#include "Basic.hpp"

#include "Sharphereal_structs.hpp"


namespace SDK::Params
{

// Function Sharphereal.CSharpBlueprintFunctionLibrary.CallCSharpFunction
// 0x0050 (0x0050 - 0x0000)
struct CSharpBlueprintFunctionLibrary_CallCSharpFunction final
{
public:
	class FString                                 ImageName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NameSpaceName;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClassName;                                         // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MethodName;                                        // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParamsCount;                                       // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          GameInstance;                                      // 0x0048(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CSharpBlueprintFunctionLibrary_CallCSharpFunction) == 0x000008, "Wrong alignment on CSharpBlueprintFunctionLibrary_CallCSharpFunction");
static_assert(sizeof(CSharpBlueprintFunctionLibrary_CallCSharpFunction) == 0x000050, "Wrong size on CSharpBlueprintFunctionLibrary_CallCSharpFunction");
static_assert(offsetof(CSharpBlueprintFunctionLibrary_CallCSharpFunction, ImageName) == 0x000000, "Member 'CSharpBlueprintFunctionLibrary_CallCSharpFunction::ImageName' has a wrong offset!");
static_assert(offsetof(CSharpBlueprintFunctionLibrary_CallCSharpFunction, NameSpaceName) == 0x000010, "Member 'CSharpBlueprintFunctionLibrary_CallCSharpFunction::NameSpaceName' has a wrong offset!");
static_assert(offsetof(CSharpBlueprintFunctionLibrary_CallCSharpFunction, ClassName) == 0x000020, "Member 'CSharpBlueprintFunctionLibrary_CallCSharpFunction::ClassName' has a wrong offset!");
static_assert(offsetof(CSharpBlueprintFunctionLibrary_CallCSharpFunction, MethodName) == 0x000030, "Member 'CSharpBlueprintFunctionLibrary_CallCSharpFunction::MethodName' has a wrong offset!");
static_assert(offsetof(CSharpBlueprintFunctionLibrary_CallCSharpFunction, ParamsCount) == 0x000040, "Member 'CSharpBlueprintFunctionLibrary_CallCSharpFunction::ParamsCount' has a wrong offset!");
static_assert(offsetof(CSharpBlueprintFunctionLibrary_CallCSharpFunction, GameInstance) == 0x000048, "Member 'CSharpBlueprintFunctionLibrary_CallCSharpFunction::GameInstance' has a wrong offset!");

// Function Sharphereal.CSharpBlueprintFunctionLibrary.HasCSharpEnvironmentInitialized
// 0x0001 (0x0001 - 0x0000)
struct CSharpBlueprintFunctionLibrary_HasCSharpEnvironmentInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CSharpBlueprintFunctionLibrary_HasCSharpEnvironmentInitialized) == 0x000001, "Wrong alignment on CSharpBlueprintFunctionLibrary_HasCSharpEnvironmentInitialized");
static_assert(sizeof(CSharpBlueprintFunctionLibrary_HasCSharpEnvironmentInitialized) == 0x000001, "Wrong size on CSharpBlueprintFunctionLibrary_HasCSharpEnvironmentInitialized");
static_assert(offsetof(CSharpBlueprintFunctionLibrary_HasCSharpEnvironmentInitialized, ReturnValue) == 0x000000, "Member 'CSharpBlueprintFunctionLibrary_HasCSharpEnvironmentInitialized::ReturnValue' has a wrong offset!");

// Function Sharphereal.CSharpBlueprintFunctionLibrary.HasSharpherealModuleGreyBoxHit
// 0x0001 (0x0001 - 0x0000)
struct CSharpBlueprintFunctionLibrary_HasSharpherealModuleGreyBoxHit final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CSharpBlueprintFunctionLibrary_HasSharpherealModuleGreyBoxHit) == 0x000001, "Wrong alignment on CSharpBlueprintFunctionLibrary_HasSharpherealModuleGreyBoxHit");
static_assert(sizeof(CSharpBlueprintFunctionLibrary_HasSharpherealModuleGreyBoxHit) == 0x000001, "Wrong size on CSharpBlueprintFunctionLibrary_HasSharpherealModuleGreyBoxHit");
static_assert(offsetof(CSharpBlueprintFunctionLibrary_HasSharpherealModuleGreyBoxHit, ReturnValue) == 0x000000, "Member 'CSharpBlueprintFunctionLibrary_HasSharpherealModuleGreyBoxHit::ReturnValue' has a wrong offset!");

// Function Sharphereal.CSharpBlueprintFunctionLibrary.HasSharpherealModuleStartup
// 0x0001 (0x0001 - 0x0000)
struct CSharpBlueprintFunctionLibrary_HasSharpherealModuleStartup final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CSharpBlueprintFunctionLibrary_HasSharpherealModuleStartup) == 0x000001, "Wrong alignment on CSharpBlueprintFunctionLibrary_HasSharpherealModuleStartup");
static_assert(sizeof(CSharpBlueprintFunctionLibrary_HasSharpherealModuleStartup) == 0x000001, "Wrong size on CSharpBlueprintFunctionLibrary_HasSharpherealModuleStartup");
static_assert(offsetof(CSharpBlueprintFunctionLibrary_HasSharpherealModuleStartup, ReturnValue) == 0x000000, "Member 'CSharpBlueprintFunctionLibrary_HasSharpherealModuleStartup::ReturnValue' has a wrong offset!");

// Function Sharphereal.CSharpBlueprintFunctionLibrary.IsPureCSharpEnvironment
// 0x0001 (0x0001 - 0x0000)
struct CSharpBlueprintFunctionLibrary_IsPureCSharpEnvironment final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CSharpBlueprintFunctionLibrary_IsPureCSharpEnvironment) == 0x000001, "Wrong alignment on CSharpBlueprintFunctionLibrary_IsPureCSharpEnvironment");
static_assert(sizeof(CSharpBlueprintFunctionLibrary_IsPureCSharpEnvironment) == 0x000001, "Wrong size on CSharpBlueprintFunctionLibrary_IsPureCSharpEnvironment");
static_assert(offsetof(CSharpBlueprintFunctionLibrary_IsPureCSharpEnvironment, ReturnValue) == 0x000000, "Member 'CSharpBlueprintFunctionLibrary_IsPureCSharpEnvironment::ReturnValue' has a wrong offset!");

// Function Sharphereal.CSharpBlueprintFunctionLibrary.Test2
// 0x0001 (0x0001 - 0x0000)
struct CSharpBlueprintFunctionLibrary_Test2 final
{
public:
	ETestEnumInt32BlueprintType                   TestEnumInt32BlueprintType;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CSharpBlueprintFunctionLibrary_Test2) == 0x000001, "Wrong alignment on CSharpBlueprintFunctionLibrary_Test2");
static_assert(sizeof(CSharpBlueprintFunctionLibrary_Test2) == 0x000001, "Wrong size on CSharpBlueprintFunctionLibrary_Test2");
static_assert(offsetof(CSharpBlueprintFunctionLibrary_Test2, TestEnumInt32BlueprintType) == 0x000000, "Member 'CSharpBlueprintFunctionLibrary_Test2::TestEnumInt32BlueprintType' has a wrong offset!");

// Function Sharphereal.JsBridgetBlueprintFunctionLibrary.CSharpCallJavascript
// 0x0018 (0x0018 - 0x0000)
struct JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript final
{
public:
	uint32                                        EventId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetId;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ParameterCount;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        ParameterBufferPtr;                                // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript) == 0x000008, "Wrong alignment on JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript");
static_assert(sizeof(JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript) == 0x000018, "Wrong size on JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript");
static_assert(offsetof(JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript, EventId) == 0x000000, "Member 'JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript::EventId' has a wrong offset!");
static_assert(offsetof(JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript, TargetId) == 0x000004, "Member 'JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript::TargetId' has a wrong offset!");
static_assert(offsetof(JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript, ParameterCount) == 0x000008, "Member 'JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript::ParameterCount' has a wrong offset!");
static_assert(offsetof(JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript, ParameterBufferPtr) == 0x000010, "Member 'JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript::ParameterBufferPtr' has a wrong offset!");

}

