#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sharphereal

#include "Basic.hpp"

#include "Sharphereal_structs.hpp"


namespace SDK::Params
{

// Function Sharphereal.CSharpBlueprintFunctionLibrary.CallCSharpFunction
// 0x0050 (0x0050 - 0x0000)
struct CSharpBlueprintFunctionLibrary_CallCSharpFunction final
{
public:
	class FString                                 ImageName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NameSpaceName;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClassName;                                         // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MethodName;                                        // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParamsCount;                                       // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          GameInstance;                                      // 0x0048(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CSharpBlueprintFunctionLibrary_CallCSharpFunction;

// Function Sharphereal.CSharpBlueprintFunctionLibrary.HasCSharpEnvironmentInitialized
// 0x0001 (0x0001 - 0x0000)
struct CSharpBlueprintFunctionLibrary_HasCSharpEnvironmentInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CSharpBlueprintFunctionLibrary_HasCSharpEnvironmentInitialized;

// Function Sharphereal.CSharpBlueprintFunctionLibrary.HasSharpherealModuleGreyBoxHit
// 0x0001 (0x0001 - 0x0000)
struct CSharpBlueprintFunctionLibrary_HasSharpherealModuleGreyBoxHit final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CSharpBlueprintFunctionLibrary_HasSharpherealModuleGreyBoxHit;

// Function Sharphereal.CSharpBlueprintFunctionLibrary.HasSharpherealModuleStartup
// 0x0001 (0x0001 - 0x0000)
struct CSharpBlueprintFunctionLibrary_HasSharpherealModuleStartup final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CSharpBlueprintFunctionLibrary_HasSharpherealModuleStartup;

// Function Sharphereal.CSharpBlueprintFunctionLibrary.IsPureCSharpEnvironment
// 0x0001 (0x0001 - 0x0000)
struct CSharpBlueprintFunctionLibrary_IsPureCSharpEnvironment final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CSharpBlueprintFunctionLibrary_IsPureCSharpEnvironment;

// Function Sharphereal.CSharpBlueprintFunctionLibrary.Test2
// 0x0001 (0x0001 - 0x0000)
struct CSharpBlueprintFunctionLibrary_Test2 final
{
public:
	ETestEnumInt32BlueprintType                   TestEnumInt32BlueprintType;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CSharpBlueprintFunctionLibrary_Test2;

// Function Sharphereal.JsBridgetBlueprintFunctionLibrary.CSharpCallJavascript
// 0x0018 (0x0018 - 0x0000)
struct JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript final
{
public:
	uint32                                        EventId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetId;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ParameterCount;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        ParameterBufferPtr;                                // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JsBridgetBlueprintFunctionLibrary_CSharpCallJavascript;

}

