#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SHitInformation

#include "Basic.hpp"

#include "SHitEffect_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SReBulletDataMain_structs.hpp"


namespace SDK
{

// UserDefinedStruct SHitInformation.SHitInformation
// 0x08D8 (0x08D8 - 0x0000)
struct FSHitInformation final
{
public:
	class ATsBaseCharacter_C*                     攻击者_38_171701BC40560E46FBA466B48E6092AF;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     受击者_39_84434570491D5319B5E0A28FB784340B;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHitEffect                            被击效果_10_588E7221426E70635B148DB0E91D6534;      // 0x0010(0x00A4)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         子弹ID_48_1E4506B74B8A70B3C7EEAC9C734EDD15;        // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                受击特效位置_17_082ABA0A4774F062BDD0CD85E02D245C;  // 0x00B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               受击特效旋转_18_1B99B9D14B3E3AA96D24208CA7EF3AC0;  // 0x00C4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          是否震动_19_46F239D24A594AD6CF8C4E8BFE560FFB;      // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   受击部位_31_22F05A814007A12DB636C28A4A53DC93;      // 0x00D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                受击位置_34_0BAA9188472BB0AD5BA5E89384D7DD53;      // 0x00E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         技能等级_37_EF2705B7409667DBD656E28F30DB8ABD;      // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSReBulletDataMain                     重构子弹数据_42_2A698CA94C88094FBE5335969E4202DF;  // 0x00F0(0x07C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UBulletLogicType_C*                     子弹逻辑预设_45_237399E449F92834C865BB8BE2C9B167;  // 0x08B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 子弹表ID_51_E036400F47F81D1CF5EE9EB67BEF720E;      // 0x08B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         伤害类型_54_A569275640B11C33F860DB89E62832EF;      // 0x08C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CC[0x4];                                      // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         伤害ID_57_29F9DDF24FD9DB08990EE5B5CBAC2C2F;        // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSHitInformation;

}

