#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SHitWhirlpool

#include "Basic.hpp"

#include "EVelocityCurveType_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SHitWhirlpool.SHitWhirlpool
// 0x001C (0x001C - 0x0000)
struct FSHitWhirlpool final
{
public:
	struct FVector                                滞空相对位置_2_E509B0D94B74577DF943C6852E674B86;   // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         滞空时间_5_FB0109EF42D8FE69C4DB468351F305A1;       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         到滞空点时间_7_61A68E1145012B8E476993901D6BC1CD;   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         滞空高度限制_9_D9BA1A4A4F1C80FCC810AEB680D11EE6;   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVelocityCurveType                            到滞空点曲线_14_D323D25D47BB71B70E1380AD0493BA46;  // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSHitWhirlpool;

}

