#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleHolographicComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EHolographicState_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "SHolographicMaterialsCache_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SimpleHolographicComponent.SimpleHolographicComponent_C
// 0x0088 (0x0148 - 0x00C0)
class USimpleHolographicComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UMaterialInstanceDynamic*>       OL_Materials;                                      // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       Other_Materials;                                   // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPD_HolographicEffect_C*                DATA;                                              // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         TimeCounter;                                       // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHolographicState                             State;                                             // 0x00F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCached;                                           // 0x00F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USkeletalMeshComponent*, struct FSHolographicMaterialsCache> ComponentMaterialsCache; // 0x00F8(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)

public:
	void ExecuteUbergraph_SimpleHolographicComponent(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void CacheMaterialParameters(TArray<struct FSMaterialControllerFloatParameter>& floats, TArray<struct FSMaterialControllerColorParameter>& colors, class UMaterialInstanceDynamic* material, bool bReplaceMaterial, int32 index, struct FSMaterialParamCache* result);
	class UMaterialInstanceDynamic* CacheAndReplace(const struct FSHolographicData& SHolographicData, class UPrimitiveComponent* self2, int32 ElementIndex, class UMaterialInstanceDynamic* material, struct FSMaterialParamCache* CacheResult);
	void RevertMaterialParamters(const struct FSMaterialParamCache& MaterialCache, class UMaterialInstanceDynamic** result);
	void Clear();
	void RemoveNpcEffect();
	void UpdateMaterialsWithDa(TArray<class UMaterialInstanceDynamic*>& Materials, const struct FSHolographicData& SHolographicData);
	void EndEffect();
	void StartEffect();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SimpleHolographicComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleHolographicComponent_C")
	}
	static class USimpleHolographicComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleHolographicComponent_C>();
	}
};
DUMPER7_ASSERTS_USimpleHolographicComponent_C;

}

