#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SLockOnFollowShooterAttachmentRule

#include "Basic.hpp"

#include "BPEDetachmentRule_structs.hpp"
#include "BPEAttachmentRule_structs.hpp"


namespace SDK
{

// UserDefinedStruct SLockOnFollowShooterAttachmentRule.SLockOnFollowShooterAttachmentRule
// 0x0018 (0x0018 - 0x0000)
struct FSLockOnFollowShooterAttachmentRule final
{
public:
	class FName                                   Socket_2_992B78484722CC6A30ECF992901687DD;         // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPEDetachmentRule                            DetachLocationRule_19_FEAEE4F249575FA5FC88279DC22884DB; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPEDetachmentRule                            DetachRotationRule_20_7772C6064E144F74C7F1C29F55A2F3DE; // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPEDetachmentRule                            DetachScaleRule_21_039CAD604A98E7CC9174919636889043; // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPEAttachmentRule                            AttachLocationRule_13_9F4BE720485567AE72FA6F88B01AB915; // 0x000F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPEAttachmentRule                            AttachRotationRule_14_C88BF6FC40DB80A3A410C5A0DEB3A1D3; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPEAttachmentRule                            AttachScaleRule_15_9A50014B4920740F4B3211916255323E; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbsoluteLocation_24_5A51A96F4CF2FA5F305C8BB29D908F8B; // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AbsoluteRotation_26_57B3563141DDEDE2DC213AB027AF9D70; // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AbsoluteScale_28_3993CD544AC7D4DDF626CEBF83639562; // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FSLockOnFollowShooterAttachmentRule;

}

