#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SLockOnFollowShooterAutoAim

#include "Basic.hpp"

#include "SLockOnFollowShooterAttachmentRule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct SLockOnFollowShooterAutoAim.SLockOnFollowShooterAutoAim
// 0x00C0 (0x00C0 - 0x0000)
struct FSLockOnFollowShooterAutoAim final
{
public:
	class FName                                   ShouldAimAtLockOnTargetName_47_1FA7D2E646A7BAA2001FEEA53E5B30FF; // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationInterpSpeed_5_978DCCB2495B4D90C6C480B110D84340; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AutoShootAngle_7_3A5850CD434FE130701B71863631FFF9; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AutoShootGapTime_9_FD49C84B4097B6D82B99F48C83D6E23D; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotateOffset_25_B755E5A440C6EE9A454FC3B771C1ADE3;  // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FSLockOnFollowShooterAttachmentRule> MapAttachToFollowingWhileHasTag_40_501678644E2861378C53A38BE7FC906C; // 0x0028(0x0050)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  StopUpdateRotationWhileHasTags_44_FFCFBF5546CA7E6390E228B5730C959E; // 0x0078(0x0020)(Edit, BlueprintVisible)
	int32                                         AutoShootSkillId_51_F8F3320343357D34F1CB2BB3EA3BFECE; // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  HideWhileHasTags_61_BC86D81644457123C502B78C3B5A1C9F; // 0x00A0(0x0020)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FSLockOnFollowShooterAutoAim;

}

