#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMotorRailMoveConfig_DirectlyEnterRail

#include "Basic.hpp"

#include "SMotorRailMove_CommonConfig_structs.hpp"
#include "SMotorRailMove_EnterRailCondition_structs.hpp"
#include "SMotorRailMove_LinearMove_structs.hpp"


namespace SDK
{

// UserDefinedStruct SMotorRailMoveConfig_DirectlyEnterRail.SMotorRailMoveConfig_DirectlyEnterRail
// 0x00C8 (0x00C8 - 0x0000)
struct FSMotorRailMoveConfig_DirectlyEnterRail final
{
public:
	struct FSMotorRailMove_CommonConfig           CommonConfig_13_31A77C1E4E27AFF27F1C119989F88AE8;  // 0x0000(0x00A8)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         MaxAbsorbDist_3_F4F796AA4289EDB87EA7FDB3885C9E5E;  // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSMotorRailMove_EnterRailCondition     EnterCondition_6_47889C0846D24B6432AC5CAE1F26D5CF; // 0x00AC(0x0014)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSMotorRailMove_LinearMove             LinearMove_9_DE22E0ED4C53588CC2F10EA5CC172E1A;     // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSMotorRailMoveConfig_DirectlyEnterRail) == 0x000008, "Wrong alignment on FSMotorRailMoveConfig_DirectlyEnterRail");
static_assert(sizeof(FSMotorRailMoveConfig_DirectlyEnterRail) == 0x0000C8, "Wrong size on FSMotorRailMoveConfig_DirectlyEnterRail");
static_assert(offsetof(FSMotorRailMoveConfig_DirectlyEnterRail, CommonConfig_13_31A77C1E4E27AFF27F1C119989F88AE8) == 0x000000, "Member 'FSMotorRailMoveConfig_DirectlyEnterRail::CommonConfig_13_31A77C1E4E27AFF27F1C119989F88AE8' has a wrong offset!");
static_assert(offsetof(FSMotorRailMoveConfig_DirectlyEnterRail, MaxAbsorbDist_3_F4F796AA4289EDB87EA7FDB3885C9E5E) == 0x0000A8, "Member 'FSMotorRailMoveConfig_DirectlyEnterRail::MaxAbsorbDist_3_F4F796AA4289EDB87EA7FDB3885C9E5E' has a wrong offset!");
static_assert(offsetof(FSMotorRailMoveConfig_DirectlyEnterRail, EnterCondition_6_47889C0846D24B6432AC5CAE1F26D5CF) == 0x0000AC, "Member 'FSMotorRailMoveConfig_DirectlyEnterRail::EnterCondition_6_47889C0846D24B6432AC5CAE1F26D5CF' has a wrong offset!");
static_assert(offsetof(FSMotorRailMoveConfig_DirectlyEnterRail, LinearMove_9_DE22E0ED4C53588CC2F10EA5CC172E1A) == 0x0000C0, "Member 'FSMotorRailMoveConfig_DirectlyEnterRail::LinearMove_9_DE22E0ED4C53588CC2F10EA5CC172E1A' has a wrong offset!");

}

