#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMotorRailMove_CommonConfig

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct SMotorRailMove_CommonConfig.SMotorRailMove_CommonConfig
// 0x00A8 (0x00A8 - 0x0000)
struct FSMotorRailMove_CommonConfig final
{
public:
	TMap<struct FGameplayTag, bool>               ModifyVehicleTagsOnEnter_4_6329554D4511A400F44ADDA8504A5324; // 0x0000(0x0050)(Edit, BlueprintVisible)
	TMap<struct FGameplayTag, bool>               ModifyVehicleTagsOnExit_6_500075C2411021FF63FC909F9C2A3D27; // 0x0050(0x0050)(Edit, BlueprintVisible)
	bool                                          EnableBlockingCheck_15_294B0AA846A3F259B800DD94B61EA108; // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxBlockingTimeOut_12_4E20551042E4D1513A1B98AE895654DD; // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSMotorRailMove_CommonConfig;

}

