#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMotorRailMoveConfig

#include "Basic.hpp"

#include "SMotorRailMoveConfig_SwitchRail_structs.hpp"
#include "SMotorRailMoveConfig_Basic_structs.hpp"
#include "SMotorRailMoveConfig_JumpOffRail_structs.hpp"
#include "SMotorRailMoveConfig_DirectlyEnterRail_structs.hpp"
#include "SMotorRailMoveConfig_AccelerateAlongRail_structs.hpp"
#include "SMotorRailMoveConfig_JumpToRail_structs.hpp"
#include "SMotorRailMoveConfig_JumpAlongRail_structs.hpp"


namespace SDK
{

// UserDefinedStruct SMotorRailMoveConfig.SMotorRailMoveConfig
// 0x0810 (0x0810 - 0x0000)
struct FSMotorRailMoveConfig final
{
public:
	class FString                                 Remarks_66_61226226400DF46B9C56739A979D825C;       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          EnableBasicConfig_57_05FC935D4BA607ABF80F30BA9B3D4026; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMotorRailMoveConfig_Basic            BasicConfig_37_E90D29F947B49591D26BE2A63F4BF4C6;   // 0x0018(0x0330)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          EnableDirectlyEnterRailConfig_58_52A576E64A909B4F2CB00EA4D554F05C; // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMotorRailMoveConfig_DirectlyEnterRail DirectlyEnterRailConfig_17_CA9F5A134A04B3936561CC8E0EF7C5E5; // 0x0350(0x00C8)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          EnableAccelerateAlongRailConfig_59_9BC211044F5AD2CCF39744A2A4C70F45; // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMotorRailMoveConfig_AccelerateAlongRail AccelerateAlongRailConfig_20_D36F0CAC43B7497C993AFEA3A2827C3F; // 0x0420(0x00B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          EnableJumpToRailConfig_60_13A1ED344C80AEB5C202769FC46DE299; // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMotorRailMoveConfig_JumpToRail       JumpToRailConfig_48_758FB7564D905B225EB9B3818DDCBCE3; // 0x04D8(0x00D0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          EnableSwitchRailConfig_61_6676B4C9472C7B4225EBD0ABA8BD7E8F; // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMotorRailMoveConfig_SwitchRail       SwitchRailConfig_67_6AE9F4154C75DC15FCABC9BCB7736526; // 0x05B0(0x00D0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          EnableJumpOffRailConfig_62_7CB29D3648DCD63CE33FF3A86380C4B7; // 0x0680(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMotorRailMoveConfig_JumpOffRail      JumpOffRailConfig_55_BA210A764409F1B60E667D8BADF96E29; // 0x0688(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          EnableJumpAlongRailConfig_63_2B38C2DC4AE05F16E49782AC1148CC4C; // 0x0748(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_749[0x7];                                      // 0x0749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMotorRailMoveConfig_JumpAlongRail    JumpAlongRailConfig_56_1522AB8242F3E35D9A49BABC3648E43F; // 0x0750(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSMotorRailMoveConfig;

}

