#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SNpcHookPart

#include "Basic.hpp"

#include "SNpcHookPartMaterial_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct SNpcHookPart.SNpcHookPart
// 0x0060 (0x0060 - 0x0000)
struct FSNpcHookPart final
{
public:
	class USkeletalMesh*                          Mesh_5_5771A2684471ED0CB70046B15B01AEB1;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform_4_B8BFEFDC4ADC550DB69D1B8E3C2C84E4;      // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	TArray<struct FMorphTargetPreviewItem>        MorphTargets_9_26ABFC144AE3204702DE29838B963BE7;   // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSNpcHookPartMaterial>          MaterialInfos_14_8D714215486CBB612558F282D33CFB0E; // 0x0050(0x0010)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FSNpcHookPart;

}

