#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SSettlementCamera

#include "Basic.hpp"

#include "SCameraModifier_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SSettlementCamera.SSettlementCamera
// 0x0170 (0x0170 - 0x0000)
struct FSSettlementCamera final
{
public:
	float                                         MinRandomPitch_8_29BF509945CABA0D6B035DAE737B9413; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxRandomPitch_10_182FF33C456B92E4A5B2CE9E4B4F9925; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TopAdditionZ_13_E2DBF33F4EA646A0F7C6BAA11E4DF6A8;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BottomAdditionZ_15_B7F22E2C4A07CF8BB0D9E1BBE075C7E5; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeftMinYawRange_18_90FF2D5A43695534DE37E38601DC1837; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeftMaxYawRange_20_85FCAA33493EC242D39C11A687F899C8; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RightMinYawRange_22_A796DE3A4B5057EEB4DFE5AB11CF8824; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RightMaxYawRange_24_192450894F44F3746EC00FBF96F8C682; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinValidYawRange_26_6CD241194E170E4953D55EB046C2B921; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCameraModifier                       CameraModifier_30_5BAEE0E5443E5FC96BE9359A1F0BEA53; // 0x0028(0x0138)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector                                CharacterOffset_34_12323EEA43408B6CC4A3F6A6DBD9A2FA; // 0x0160(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSSettlementCamera;

}

