#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SSkillBehaviorBatchBullet

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "EBatchBulletMoveStartMode_structs.hpp"


namespace SDK
{

// UserDefinedStruct SSkillBehaviorBatchBullet.SSkillBehaviorBatchBullet
// 0x0030 (0x0030 - 0x0000)
struct FSSkillBehaviorBatchBullet final
{
public:
	TArray<class FString>                         Id_6_8FE506A0458B0E0701BFE7AEDFD6181E;             // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Number_8_78812FCC4A2FCEA503BC5A8C56937263;         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Interval_34_E67917754543239196555A8D640EA3A7;      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StopOnSkillEnd_13_88AF95154AC08739142C7E91EEF56EC3; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ContinueWithTag_16_1F5D6EA442683D4388BE9BB0556BCBFC; // 0x001C(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	EBatchBulletMoveStartMode                     StartMoving_32_993E6A4B46D8B905DD17208668997759;   // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSSkillBehaviorBatchBullet;

}

