#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SSkillTrigger

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct SSkillTrigger.SSkillTrigger
// 0x0060 (0x0060 - 0x0000)
struct FSSkillTrigger final
{
public:
	class FString                                 TriggerType_2_A4B916C949F97F67C63AEFA1E4A3F1CC;    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         TriggerPreset_5_7766F7AA48C4AA380971A9B4FA085B6F;  // 0x0010(0x0010)(Edit, BlueprintVisible)
	class FString                                 TriggerParams_10_0B8BCCB6424F70FCD32451BF5E363B27; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TriggerFormula_11_05C6F52D48C9B57ACB5C85A076462A38; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TriggerTarget_14_4FBFA2194402F3F89FE451AFA771EC33; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TriggerTargetSocket_17_D17D9CE14BEEC1E628D4109AF3AB4F78; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSSkillTrigger;

}

