#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SWeaponSocketItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SWeaponMesh_structs.hpp"


namespace SDK
{

// UserDefinedStruct SWeaponSocketItem.SWeaponSocketItem
// 0x0058 (0x0058 - 0x0000)
struct FSWeaponSocketItem final
{
public:
	TArray<struct FSWeaponMesh>                   Meshes_13_CE477C0240043F0E66DD39B32302A00B;        // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FName                                   DropSocket_16_66E387994D25403F8861D892DAEE5132;    // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DropVelocity_23_A26B05B541CF03CF69B531ABEA7D8051;  // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_19_2E69EBC5415BF14374317FB499A95B38;           // 0x0028(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        WeaponEffectPath_26_C519CEFC406FFC9E8723D093D62AF1A2; // 0x0038(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSWeaponSocketItem;

}

