#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsAiBlueprintFunctionLibrary

#include "Basic.hpp"

#include "SAiLevelVar_structs.hpp"
#include "EQuestStepState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.GetQuestState
// 0x0018 (0x0018 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_GetQuestState final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         questId;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuestStepState                               ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_GetQuestState;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.GetDistanceByPlayer
// 0x0018 (0x0018 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_GetDistanceByPlayer final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_GetDistanceByPlayer;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.CheckPlayerGameplayTag
// 0x0020 (0x0020 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_CheckPlayerGameplayTag final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           tag;                                               // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_CheckPlayerGameplayTag;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.RestartBehaviorTree
// 0x0010 (0x0010 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_RestartBehaviorTree final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_RestartBehaviorTree;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.SetAiEnabled
// 0x0020 (0x0020 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_SetAiEnabled final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          value;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_SetAiEnabled;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.NeedCheckPlayerImpact
// 0x0018 (0x0018 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_NeedCheckPlayerImpact final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_NeedCheckPlayerImpact;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.NeedCheckPlayerAttack
// 0x0018 (0x0018 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_NeedCheckPlayerAttack final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_NeedCheckPlayerAttack;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.UpdateInteractionComponent
// 0x0010 (0x0010 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_UpdateInteractionComponent final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_UpdateInteractionComponent;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.OnPlayerAttack
// 0x0010 (0x0010 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_OnPlayerAttack final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_OnPlayerAttack;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.OnPlayerImpact
// 0x0010 (0x0010 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_OnPlayerImpact final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_OnPlayerImpact;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.IsAiDriver
// 0x0018 (0x0018 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_IsAiDriver final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_IsAiDriver;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.GetRoleActor
// 0x0018 (0x0018 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_GetRoleActor final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_GetRoleActor;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.SetFollowData
// 0x0020 (0x0020 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_SetFollowData final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         type;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_SetFollowData;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.GetFollowActor
// 0x0020 (0x0020 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_GetFollowActor final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_GetFollowActor;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.Reset
// 0x0010 (0x0010 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_Reset final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         targetEntityId;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_Reset;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.GetToRoleDistance
// 0x0018 (0x0018 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_GetToRoleDistance final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_GetToRoleDistance;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.GetSummonType
// 0x0018 (0x0018 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_GetSummonType final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_GetSummonType;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.TsLogInfo
// 0x0018 (0x0018 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_TsLogInfo final
{
public:
	class FString                                 text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_TsLogInfo;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.OnPlayerAttackEnd
// 0x0010 (0x0010 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_OnPlayerAttackEnd final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_OnPlayerAttackEnd;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.OnPlayerImpactEnd
// 0x0010 (0x0010 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_OnPlayerImpactEnd final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_OnPlayerImpactEnd;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.OnPlayerAttackBegin
// 0x0010 (0x0010 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_OnPlayerAttackBegin final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_OnPlayerAttackBegin;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.OnPlayerImpactBegin
// 0x0010 (0x0010 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_OnPlayerImpactBegin final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_OnPlayerImpactBegin;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.UpdateNpcPerformData
// 0x0018 (0x0018 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_UpdateNpcPerformData final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isAttacked1;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	bool                                          isImpacted;                                        // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         direction;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         strength;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_UpdateNpcPerformData;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.GetLevelIntVar
// 0x0030 (0x0030 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_GetLevelIntVar final
{
public:
	struct FSAiLevelVar                           levelVar;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_GetLevelIntVar;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.GetLevelStringVar
// 0x0038 (0x0038 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_GetLevelStringVar final
{
public:
	struct FSAiLevelVar                           levelVar;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_GetLevelStringVar;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.GetLevelFloatVar
// 0x0030 (0x0030 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_GetLevelFloatVar final
{
public:
	struct FSAiLevelVar                           levelVar;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_GetLevelFloatVar;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.GetLevelPosVar
// 0x0038 (0x0038 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_GetLevelPosVar final
{
public:
	struct FSAiLevelVar                           levelVar;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_GetLevelPosVar;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.GetLevelBoolVar
// 0x0030 (0x0030 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_GetLevelBoolVar final
{
public:
	struct FSAiLevelVar                           levelVar;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_GetLevelBoolVar;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.UpdateNpcStateData
// 0x0010 (0x0010 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_UpdateNpcStateData final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         animState;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_UpdateNpcStateData;

// Function TsAiBlueprintFunctionLibrary.TsAiBlueprintFunctionLibrary_C.GetAndResetNoTransitionSwitch
// 0x0018 (0x0018 - 0x0000)
struct TsAiBlueprintFunctionLibrary_C_GetAndResetNoTransitionSwitch final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsAiBlueprintFunctionLibrary_C_GetAndResetNoTransitionSwitch;

}

