#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsAiController

#include "Basic.hpp"

#include "SAiLevelVar_structs.hpp"
#include "ECharacterState_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SAiConditions_structs.hpp"


namespace SDK::Params
{

// Function TsAiController.TsAiController_C.ExecuteUbergraph_TsAiController
// 0x0004 (0x0004 - 0x0000)
struct TsAiController_C_ExecuteUbergraph_TsAiController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_ExecuteUbergraph_TsAiController;

// Function TsAiController.TsAiController_C.ActivateSkillGroup
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_ActivateSkillGroup final
{
public:
	int32                                         skillGroupIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          activate;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsAiController_C_ActivateSkillGroup;

// Function TsAiController.TsAiController_C.AddSkillCd
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_AddSkillCd final
{
public:
	int32                                         skillInfoId;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         cdAdd;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AddSkillCd;

// Function TsAiController.TsAiController_C.SetBattleWanderTime
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_SetBattleWanderTime final
{
public:
	float                                         min_0;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         max_0;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_SetBattleWanderTime;

// Function TsAiController.TsAiController_C.AddComplicatedEventBinder
// 0x00C0 (0x00C0 - 0x0000)
struct TsAiController_C_AddComplicatedEventBinder final
{
public:
	struct FSAiConditions                         conditions;                                        // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UKuroBooleanEventBinder*                eventBinder;                                       // 0x00B8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AddComplicatedEventBinder;

// Function TsAiController.TsAiController_C.GetDebugText
// 0x0018 (0x0018 - 0x0000)
struct TsAiController_C_GetDebugText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_TsAiController_C_GetDebugText;

// Function TsAiController.TsAiController_C.ChangeHatred
// 0x000C (0x000C - 0x0000)
struct TsAiController_C_ChangeHatred final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         rate;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         abs;                                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_ChangeHatred;

// Function TsAiController.TsAiController_C.ClearHatred
// 0x0004 (0x0004 - 0x0000)
struct TsAiController_C_ClearHatred final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_ClearHatred;

// Function TsAiController.TsAiController_C.SetBattleWanderIndex
// 0x0004 (0x0004 - 0x0000)
struct TsAiController_C_SetBattleWanderIndex final
{
public:
	int32                                         index;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_SetBattleWanderIndex;

// Function TsAiController.TsAiController_C.AddBattleWanderEndTime
// 0x0004 (0x0004 - 0x0000)
struct TsAiController_C_AddBattleWanderEndTime final
{
public:
	float                                         addTime;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AddBattleWanderEndTime;

// Function TsAiController.TsAiController_C.TestChangeAi
// 0x0010 (0x0010 - 0x0000)
struct TsAiController_C_TestChangeAi final
{
public:
	class FString                                 id;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_TestChangeAi;

// Function TsAiController.TsAiController_C.AicApplyBuff
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_AicApplyBuff final
{
public:
	int64                                         buffId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AicApplyBuff;

// Function TsAiController.TsAiController_C.AicRemoveBuff
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_AicRemoveBuff final
{
public:
	int64                                         buffId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AicRemoveBuff;

// Function TsAiController.TsAiController_C.AicAddTag
// 0x000C (0x000C - 0x0000)
struct TsAiController_C_AicAddTag final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AicAddTag;

// Function TsAiController.TsAiController_C.AicRemoveTag
// 0x000C (0x000C - 0x0000)
struct TsAiController_C_AicRemoveTag final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AicRemoveTag;

// Function TsAiController.TsAiController_C.SetAiEnable
// 0x0018 (0x0018 - 0x0000)
struct TsAiController_C_SetAiEnable final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_SetAiEnable;

// Function TsAiController.TsAiController_C.LogReport
// 0x0004 (0x0004 - 0x0000)
struct TsAiController_C_LogReport final
{
public:
	int32                                         logId;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_LogReport;

// Function TsAiController.TsAiController_C.SetAiSenseEnable
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_SetAiSenseEnable final
{
public:
	int32                                         index;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          enable;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_TsAiController_C_SetAiSenseEnable;

// Function TsAiController.TsAiController_C.AddOrRemoveAiSense
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_AddOrRemoveAiSense final
{
public:
	int32                                         aiSenseId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          add;                                               // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_TsAiController_C_AddOrRemoveAiSense;

// Function TsAiController.TsAiController_C.EnableAiSenseByType
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_EnableAiSenseByType final
{
public:
	int32                                         type;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          enable;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_TsAiController_C_EnableAiSenseByType;

// Function TsAiController.TsAiController_C.AddHateEventBinder
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_AddHateEventBinder final
{
public:
	class UKuroPerceptionEventBinder*             handler1;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AddHateEventBinder;

// Function TsAiController.TsAiController_C.AddPerceptionEventBinder
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_AddPerceptionEventBinder final
{
public:
	class UKuroPerceptionEventBinder*             handler;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AddPerceptionEventBinder;

// Function TsAiController.TsAiController_C.AddHateOutRangeEventBinder
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_AddHateOutRangeEventBinder final
{
public:
	class UKuroPerceptionEventBinder*             handler;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AddHateOutRangeEventBinder;

// Function TsAiController.TsAiController_C.SetPerceptionEventState
// 0x0003 (0x0003 - 0x0000)
struct TsAiController_C_SetPerceptionEventState final
{
public:
	bool                                          includeFriend;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          includeEnemy;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          includeNeutral;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_TsAiController_C_SetPerceptionEventState;

// Function TsAiController.TsAiController_C.AddSceneItemDestroyEventBinder
// 0x0010 (0x0010 - 0x0000)
struct TsAiController_C_AddSceneItemDestroyEventBinder final
{
public:
	float                                         distance;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroActorEventBinder*                  eventBinder;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AddSceneItemDestroyEventBinder;

// Function TsAiController.TsAiController_C.SetAiHateConfig
// 0x0010 (0x0010 - 0x0000)
struct TsAiController_C_SetAiHateConfig final
{
public:
	class FString                                 configId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_SetAiHateConfig;

// Function TsAiController.TsAiController_C.AddAlertEventBinder
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_AddAlertEventBinder final
{
public:
	class UKuroBooleanEventBinder*                eventBinder;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AddAlertEventBinder;

// Function TsAiController.TsAiController_C.SetAiAlertConfig
// 0x0010 (0x0010 - 0x0000)
struct TsAiController_C_SetAiAlertConfig final
{
public:
	class FString                                 configId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_SetAiAlertConfig;

// Function TsAiController.TsAiController_C.GetCoolDownDone
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_GetCoolDownDone final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsAiController_C_GetCoolDownDone;

// Function TsAiController.TsAiController_C.GetCoolDownRemainTime
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_GetCoolDownRemainTime final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_GetCoolDownRemainTime;

// Function TsAiController.TsAiController_C.SetCoolDown
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_SetCoolDown final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         cd;                                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_SetCoolDown;

// Function TsAiController.TsAiController_C.InitCooldownEvent
// 0x0010 (0x0010 - 0x0000)
struct TsAiController_C_InitCooldownEvent final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroBooleanEventBinder*                eventBinder;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_InitCooldownEvent;

// Function TsAiController.TsAiController_C.StartCooldownTimer
// 0x0008 (0x0008 - 0x0000)
struct TsAiController_C_StartCooldownTimer final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         duration;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_StartCooldownTimer;

// Function TsAiController.TsAiController_C.逻辑主控
// 0x0001 (0x0001 - 0x0000)
struct TsAiController_C_逻辑主控 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsAiController_C_逻辑主控;

// Function TsAiController.TsAiController_C.移动主控
// 0x0001 (0x0001 - 0x0000)
struct TsAiController_C_移动主控 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsAiController_C_移动主控;

// Function TsAiController.TsAiController_C.状态切换时
// 0x0003 (0x0003 - 0x0000)
struct TsAiController_C_状态切换时 final
{
public:
	ECharacterState                               oldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               newState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isAutonomousProxy;                                 // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsAiController_C_状态切换时;

// Function TsAiController.TsAiController_C.检查状态机状态
// 0x0018 (0x0018 - 0x0000)
struct TsAiController_C_检查状态机状态 final
{
public:
	TArray<class FString>                         states;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsAiController_C_检查状态机状态;

// Function TsAiController.TsAiController_C.切换状态机状态
// 0x0010 (0x0010 - 0x0000)
struct TsAiController_C_切换状态机状态 final
{
public:
	TArray<class FString>                         states;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_TsAiController_C_切换状态机状态;

// Function TsAiController.TsAiController_C.GetDebugStateMachine
// 0x0010 (0x0010 - 0x0000)
struct TsAiController_C_GetDebugStateMachine final
{
public:
	TArray<class FText>                           output;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_TsAiController_C_GetDebugStateMachine;

// Function TsAiController.TsAiController_C.AicApplyBuffToTarget
// 0x0010 (0x0010 - 0x0000)
struct TsAiController_C_AicApplyBuffToTarget final
{
public:
	int32                                         targetId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         buffId;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AicApplyBuffToTarget;

// Function TsAiController.TsAiController_C.AddLevelVarBoolEventBinder
// 0x0028 (0x0028 - 0x0000)
struct TsAiController_C_AddLevelVarBoolEventBinder final
{
public:
	struct FSAiLevelVar                           levelVar;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UKuroBooleanEventBinder*                eventBinder;                                       // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AddLevelVarBoolEventBinder;

// Function TsAiController.TsAiController_C.AddLevelVarIntEventBinder
// 0x0028 (0x0028 - 0x0000)
struct TsAiController_C_AddLevelVarIntEventBinder final
{
public:
	struct FSAiLevelVar                           levelVar;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UKuroIntEventBinder*                    eventBinder;                                       // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsAiController_C_AddLevelVarIntEventBinder;

}

