#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsBpFxEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TsBpFxEffect.TsBpFxEffect_C.ExecuteUbergraph_TsBpFxEffect
// 0x0008 (0x0008 - 0x0000)
struct TsBpFxEffect_C_ExecuteUbergraph_TsBpFxEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsBpFxEffect_C_ExecuteUbergraph_TsBpFxEffect;

// Function TsBpFxEffect.TsBpFxEffect_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct TsBpFxEffect_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsBpFxEffect_C_ReceiveEndPlay;

// Function TsBpFxEffect.TsBpFxEffect_C.OnRecordTick
// 0x0004 (0x0004 - 0x0000)
struct TsBpFxEffect_C_OnRecordTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsBpFxEffect_C_OnRecordTick;

// Function TsBpFxEffect.TsBpFxEffect_C.AddAutoFloatTrack
// 0x000C (0x000C - 0x0000)
struct TsBpFxEffect_C_AddAutoFloatTrack final
{
public:
	class FName                                   propertyName;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsBpFxEffect_C_AddAutoFloatTrack;

// Function TsBpFxEffect.TsBpFxEffect_C.AddAutoObjectTrack
// 0x000C (0x000C - 0x0000)
struct TsBpFxEffect_C_AddAutoObjectTrack final
{
public:
	class FName                                   propertyName;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsBpFxEffect_C_AddAutoObjectTrack;

// Function TsBpFxEffect.TsBpFxEffect_C.AddAutoVectorTrack
// 0x000C (0x000C - 0x0000)
struct TsBpFxEffect_C_AddAutoVectorTrack final
{
public:
	class FName                                   propertyName;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsBpFxEffect_C_AddAutoVectorTrack;

}

