#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsCharacterDebugComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function TsCharacterDebugComponent.TsCharacterDebugComponent_C.ExecuteUbergraph_TsCharacterDebugComponent
// 0x0008 (0x0008 - 0x0000)
struct TsCharacterDebugComponent_C_ExecuteUbergraph_TsCharacterDebugComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsCharacterDebugComponent_C_ExecuteUbergraph_TsCharacterDebugComponent;

// Function TsCharacterDebugComponent.TsCharacterDebugComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct TsCharacterDebugComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsCharacterDebugComponent_C_ReceiveTick;

// Function TsCharacterDebugComponent.TsCharacterDebugComponent_C.ActivateDebugSpeed
// 0x0001 (0x0001 - 0x0000)
struct TsCharacterDebugComponent_C_ActivateDebugSpeed final
{
public:
	bool                                          activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsCharacterDebugComponent_C_ActivateDebugSpeed;

// Function TsCharacterDebugComponent.TsCharacterDebugComponent_C.SetDebugRiseEnable
// 0x0001 (0x0001 - 0x0000)
struct TsCharacterDebugComponent_C_SetDebugRiseEnable final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_TsCharacterDebugComponent_C_SetDebugRiseEnable;

// Function TsCharacterDebugComponent.TsCharacterDebugComponent_C.SetMovementDebug
// 0x0001 (0x0001 - 0x0000)
struct TsCharacterDebugComponent_C_SetMovementDebug final
{
public:
	bool                                          newDebug;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TsCharacterDebugComponent_C_SetMovementDebug;

}

