#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsEffectActor

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TsEffectActor.TsEffectActor_C.ExecuteUbergraph_TsEffectActor
// 0x000C (0x000C - 0x0000)
struct TsEffectActor_C_ExecuteUbergraph_TsEffectActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Handle;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsEffectActor_C_ExecuteUbergraph_TsEffectActor;

// Function TsEffectActor.TsEffectActor_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct TsEffectActor_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsEffectActor_C_ReceiveEndPlay;

// Function TsEffectActor.TsEffectActor_C.SetHandle
// 0x0004 (0x0004 - 0x0000)
struct TsEffectActor_C_SetHandle final
{
public:
	int32                                         Handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsEffectActor_C_SetHandle;

// Function TsEffectActor.TsEffectActor_C.GetEffectPath
// 0x0010 (0x0010 - 0x0000)
struct TsEffectActor_C_GetEffectPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsEffectActor_C_GetEffectPath;

// Function TsEffectActor.TsEffectActor_C.GetHandle
// 0x0004 (0x0004 - 0x0000)
struct TsEffectActor_C_GetHandle final
{
public:
	int32                                         Handle;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TsEffectActor_C_GetHandle;

}

