#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsRecordEffect

#include "Basic.hpp"

#include "KuroAnim_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsRecordEffect.TsRecordEffect_C
// 0x0038 (0x02E8 - 0x02B0)
class ATsRecordEffect_C final : public AKuroRecordEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UEffectModelBase*                       EffectModelData;                                   // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         LifeTimeType;                                      // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EffectModelDataPath;                               // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Interp, HasGetValueTypeHash)
	float                                         ManualProcessTime;                                 // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TsRecordEffect(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnPlay();
	void OnStop();
	void TryAddEffectView();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TsRecordEffect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TsRecordEffect_C")
	}
	static class ATsRecordEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATsRecordEffect_C>();
	}
};
DUMPER7_ASSERTS_ATsRecordEffect_C;

}

