#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsSeqAnimNotifyFootstepAudioEvent

#include "Basic.hpp"

#include "E_FootstepVariant_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsSeqAnimNotifyFootstepAudioEvent.TsSeqAnimNotifyFootstepAudioEvent_C
// 0x0090 (0x00D8 - 0x0048)
class UTsSeqAnimNotifyFootstepAudioEvent_C final : public UKuroAnimNotify
{
public:
	E_FootstepVariant                             Variant;                                           // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAkAudioEvent>           FootstepEvent;                                     // 0x0050(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UTraceLineElement*                      FootTraceElement;                                  // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<E_FootstepVariant, class FString>        FootstepVariantMap;                                // 0x0088(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool K2_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);

	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsSeqAnimNotifyFootstepAudioEvent_C">();
	}
	static class UTsSeqAnimNotifyFootstepAudioEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTsSeqAnimNotifyFootstepAudioEvent_C>();
	}
};
static_assert(alignof(UTsSeqAnimNotifyFootstepAudioEvent_C) == 0x000008, "Wrong alignment on UTsSeqAnimNotifyFootstepAudioEvent_C");
static_assert(sizeof(UTsSeqAnimNotifyFootstepAudioEvent_C) == 0x0000D8, "Wrong size on UTsSeqAnimNotifyFootstepAudioEvent_C");
static_assert(offsetof(UTsSeqAnimNotifyFootstepAudioEvent_C, Variant) == 0x000048, "Member 'UTsSeqAnimNotifyFootstepAudioEvent_C::Variant' has a wrong offset!");
static_assert(offsetof(UTsSeqAnimNotifyFootstepAudioEvent_C, FootstepEvent) == 0x000050, "Member 'UTsSeqAnimNotifyFootstepAudioEvent_C::FootstepEvent' has a wrong offset!");
static_assert(offsetof(UTsSeqAnimNotifyFootstepAudioEvent_C, FootTraceElement) == 0x000080, "Member 'UTsSeqAnimNotifyFootstepAudioEvent_C::FootTraceElement' has a wrong offset!");
static_assert(offsetof(UTsSeqAnimNotifyFootstepAudioEvent_C, FootstepVariantMap) == 0x000088, "Member 'UTsSeqAnimNotifyFootstepAudioEvent_C::FootstepVariantMap' has a wrong offset!");

}

