#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsSeqAnimNotifyStateAudioEvent

#include "Basic.hpp"

#include "KuroAudio_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsSeqAnimNotifyStateAudioEvent.TsSeqAnimNotifyStateAudioEvent_C
// 0x00C8 (0x0110 - 0x0048)
class UTsSeqAnimNotifyStateAudioEvent_C final : public UKuroAnimNotifyState
{
public:
	TSoftObjectPtr<class UAkAudioEvent>           AudioEvent;                                        // 0x0048(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0078(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Follow;                                            // 0x0084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          KeepAlive;                                         // 0x0085(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FadeDuration;                                      // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAudioFadeCurve                               FadeCurve;                                         // 0x008C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAkAudioEvent>           TrailingAudioEvent;                                // 0x0090(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMap<class AActor*, float>                    HandleMap;                                         // 0x00C0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)

public:
	bool K2_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration);
	bool K2_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);

	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TsSeqAnimNotifyStateAudioEvent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TsSeqAnimNotifyStateAudioEvent_C")
	}
	static class UTsSeqAnimNotifyStateAudioEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTsSeqAnimNotifyStateAudioEvent_C>();
	}
};
DUMPER7_ASSERTS_UTsSeqAnimNotifyStateAudioEvent_C;

}

