#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsUiNavigationPanelConfig

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SNavigationGroup_structs.hpp"
#include "SNavigationDynamicListenerConfig_structs.hpp"
#include "LGUI_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsUiNavigationPanelConfig.TsUiNavigationPanelConfig_C
// 0x0180 (0x0280 - 0x0100)
class UTsUiNavigationPanelConfig_C final : public ULGUIBehaviour
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 ViewName;                                          // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Independent;                                       // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSNavigationGroup>              NormalGroup;                                       // 0x0120(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<struct FSNavigationGroup>              BookmarkGroup;                                     // 0x0130(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FSNavigationGroup                      ScrollBarGroup;                                    // 0x0140(0x00B8)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class AActor*>                         DefaultNavigationActor;                            // 0x01F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          IsChildPanel;                                      // 0x0208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          AllowNavigateInKeyBoard;                           // 0x0209(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FSNavigationDynamicListenerConfig> DynamicListenerConfigMap;          // 0x0210(0x0050)(Edit, BlueprintVisible)
	class FString                                 InteractiveTag;                                    // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 GamepadMouseActor;                                 // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstFindFromSubPanelWhenFindNone;                 // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TsUiNavigationPanelConfig(int32 EntryPoint);
	void StartBP();
	void OnDisableBP();
	void OnEnableBP();
	void AwakeBP();
	void OnDestroyBP();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TsUiNavigationPanelConfig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TsUiNavigationPanelConfig_C")
	}
	static class UTsUiNavigationPanelConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTsUiNavigationPanelConfig_C>();
	}
};
DUMPER7_ASSERTS_UTsUiNavigationPanelConfig_C;

}

