#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsUiNavigationBehaviorListener

#include "Basic.hpp"

#include "LGUI_classes.hpp"
#include "EHotKeyNameStateType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SNavigationMode_structs.hpp"
#include "SNavigationCursor_structs.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsUiNavigationBehaviorListener.TsUiNavigationBehaviorListener_C
// 0x01A8 (0x02B0 - 0x0108)
class UTsUiNavigationBehaviorListener_C final : public UUINavigationBehaviour
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 GroupName;                                         // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	class AActor*                                 LayoutActor;                                       // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class FString>                         TagArray;                                          // 0x0128(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 ShieldHotKeyIndexArray;                            // 0x0138(0x0010)(Edit, BlueprintVisible)
	class AActor*                                 ScrollViewActor;                                   // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TMap<EHotKeyNameStateType, class FString>     HotKeyTipsTextIdMap;                               // 0x0150(0x0050)(Edit, BlueprintVisible)
	class AActor*                                 InsideGroupActor;                                  // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector2D                              ClickPivot;                                        // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSNavigationMode                       NavigationMode;                                    // 0x01B0(0x0040)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSNavigationCursor                     Cursor;                                            // 0x01F0(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScrollbarIndex;                                    // 0x01FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 InteractiveTag;                                    // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DynamicTag;                                        // 0x0210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, class AActor*>            InsideActorMap;                                    // 0x0220(0x0050)(Edit, BlueprintVisible)
	bool                                          OpenAdsorbed;                                      // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AdsorbedDistance;                                  // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AdsorbedPivot;                                     // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AUIBaseActor*                           GridBaseActor;                                     // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ExitTagPriority;                                   // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsePool;                                         // 0x028C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         InteractiveParam;                                  // 0x0290(0x0010)(Edit, BlueprintVisible)
	float                                         NavigateTolerance;                                 // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NavigateToleranceReverse;                          // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUseDrag;                                         // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TsUiNavigationBehaviorListener(int32 EntryPoint);
	void OnDisableBP();
	void OnEnableBP();
	void StartBP();
	void OnNotifyNavigationSelectBP(class ULGUIPointerEventData* eventData);
	void OnNotifyNavigationEnterBP(class ULGUIPointerEventData* eventData);
	void OnNotifyNotInteractiveBP();
	void OnNotifyInteractiveBP();
	void OnDestroyBP();
	void AwakeBP();
	bool OnCheckCanSetNavigationBP();
	bool OnCheckLoopScrollChangeNavigationBP();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TsUiNavigationBehaviorListener_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TsUiNavigationBehaviorListener_C")
	}
	static class UTsUiNavigationBehaviorListener_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTsUiNavigationBehaviorListener_C>();
	}
};
DUMPER7_ASSERTS_UTsUiNavigationBehaviorListener_C;

}

