#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VolumeGIRender

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VolumeGIRender.GIVolumeComponent
// 0x00E0 (0x0300 - 0x0220)
class UGIVolumeComponent final : public USceneComponent
{
public:
	struct FVector                                VolumeSize;                                        // 0x0218(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             VolumeDim;                                         // 0x0224(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumProbes;                                         // 0x0230(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0234(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkyIndirectScale;                                  // 0x0238(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SunIndirectScale;                                  // 0x023C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaticIrraidianceScale;                            // 0x0240(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TintColor;                                         // 0x0244(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_254[0xAC];                                     // 0x0254(0x00AC)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GIVolumeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GIVolumeComponent")
	}
	static class UGIVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGIVolumeComponent>();
	}
};
DUMPER7_ASSERTS_UGIVolumeComponent;

// Class VolumeGIRender.ProbeVolumeActor
// 0x0008 (0x02B8 - 0x02B0)
class AProbeVolumeActor final : public AActor
{
public:
	class UGIVolumeComponent*                     GIVolumeComp;                                      // 0x02B0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProbeVolumeActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProbeVolumeActor")
	}
	static class AProbeVolumeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProbeVolumeActor>();
	}
};
DUMPER7_ASSERTS_AProbeVolumeActor;

// Class VolumeGIRender.VolumeGIRenderSystem
// 0x0008 (0x0040 - 0x0038)
class UVolumeGIRenderSystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VolumeGIRenderSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VolumeGIRenderSystem")
	}
	static class UVolumeGIRenderSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVolumeGIRenderSystem>();
	}
};
DUMPER7_ASSERTS_UVolumeGIRenderSystem;

}

