#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BaseRole

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "KuroAnim_structs.hpp"
#include "KuroAnim_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BaseRole.ABP_BaseRole_C
// 0x2B780 (0x2C4B0 - 0x0D30)
class UABP_BaseRole_C : public UKuroAnimInstanceRole
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x0D38(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x0D58(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_32;                  // 0x0D90(0x0138)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x0EC8(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x0F28(0x0060)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_16;                  // 0x0F88(0x00B0)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot_1;                      // 0x1038(0x00B0)()
	struct FAnimNode_CombineCurves                AnimGraphNode_CombineCurves_2;                     // 0x10E8(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x1148(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x11A8(0x0060)()
	struct FAnimNode_CombineCurves                AnimGraphNode_CombineCurves_1;                     // 0x1208(0x0060)()
	struct FAnimNode_CurveFix                     AnimGraphNode_CurveFix;                            // 0x1268(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x1298(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_31;                  // 0x12D0(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_30;                  // 0x1408(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_29;                  // 0x1540(0x0138)()
	uint8                                         Pad_1678[0x8];                                     // 0x1678(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_32;                   // 0x1680(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0x1830(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0x19E0(0x01B0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_9;                       // 0x1B90(0x00C8)()
	uint8                                         Pad_1C58[0x8];                                     // 0x1C58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0x1C60(0x01B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_77;                    // 0x1E10(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_28;                  // 0x1E40(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_27;                  // 0x1F78(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_26;                  // 0x20B0(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_25;                  // 0x21E8(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0x2320(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0x24D0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0x2680(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0x2830(0x01B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_76;                    // 0x29E0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_562;                // 0x2A10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_561;                // 0x2A38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_560;                // 0x2A60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_559;                // 0x2A88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_558;                // 0x2AB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_557;                // 0x2AD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_556;                // 0x2B00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_555;                // 0x2B28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_554;                // 0x2B50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_553;                // 0x2B78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_552;                // 0x2BA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_551;                // 0x2BC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_550;                // 0x2BF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_549;                // 0x2C18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_548;                // 0x2C40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_547;                // 0x2C68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_546;                // 0x2C90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_545;                // 0x2CB8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_75;                    // 0x2CE0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74;                    // 0x2D10(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_16;                    // 0x2D40(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_314;                     // 0x2D90(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_73;                    // 0x2DC8(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_15;                    // 0x2DF8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_72;                    // 0x2E48(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_313;                     // 0x2E78(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_71;                    // 0x2EB0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_70;                    // 0x2EE0(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_14;                    // 0x2F10(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_312;                     // 0x2F60(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69;                    // 0x2F98(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_68;                    // 0x2FC8(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_13;                    // 0x2FF8(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_311;                     // 0x3048(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0x3080(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_12;                    // 0x30B0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0x3100(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_310;                     // 0x3130(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0x3168(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_11;                    // 0x3198(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0x31E8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_309;                     // 0x3218(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_66;                     // 0x3250(0x0198)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0x33E8(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_10;                    // 0x3418(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_15;                  // 0x3468(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0x3518(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0x3548(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x3578(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_544;                // 0x35B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_543;                // 0x35D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_542;                // 0x3600(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_27;                    // 0x3628(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0x3700(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0x3730(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_308;                     // 0x3760(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0x3798(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_307;                     // 0x37C8(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_306;                     // 0x3800(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_65;                     // 0x3838(0x0198)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0x39D0(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_24;                  // 0x3B80(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_23;                  // 0x3CB8(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0x3DF0(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_22;                  // 0x3FA0(0x0138)()
	uint8                                         Pad_40D8[0x8];                                     // 0x40D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0x40E0(0x01B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x4290(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x42C8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x42E8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_21;                  // 0x4308(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x4440(0x0128)()
	struct FAnimNode_SightLock                    AnimGraphNode_SightLock;                           // 0x4568(0x01E8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x4750(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x4878(0x0128)()
	struct FAnimNode_FeedbackRotate               AnimGraphNode_FeedbackRotate;                      // 0x49A0(0x0320)()
	struct FAnimNode_KuroHumanIK                  AnimGraphNode_KuroHumanIK;                         // 0x4CC0(0x02F0)()
	struct FAnimNode_KuroCacheBones               AnimGraphNode_KuroCacheBones;                      // 0x4FB0(0x0150)()
	struct FAnimNode_SimpleDCC                    AnimGraphNode_SimpleDCC;                           // 0x5100(0x0180)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x5280(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_20;                  // 0x52B8(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0x53F0(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_19;                  // 0x55A0(0x0138)()
	uint8                                         Pad_56D8[0x8];                                     // 0x56D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x56E0(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x5890(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x59C8(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x5B00(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x5C38(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x5D70(0x0138)()
	uint8                                         Pad_5EA8[0x8];                                     // 0x5EA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x5EB0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x6060(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x6210(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x63C0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x6570(0x01B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0x6720(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x6750(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x6780(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_8;                       // 0x67B0(0x00C8)()
	uint8                                         Pad_6878[0x8];                                     // 0x6878(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x6880(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_541;                // 0x6A30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_540;                // 0x6A58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_539;                // 0x6A80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_538;                // 0x6AA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_537;                // 0x6AD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_536;                // 0x6AF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_535;                // 0x6B20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_534;                // 0x6B48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_533;                // 0x6B70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_532;                // 0x6B98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_531;                // 0x6BC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_530;                // 0x6BE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_529;                // 0x6C10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_528;                // 0x6C38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_527;                // 0x6C60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_526;                // 0x6C88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_525;                // 0x6CB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_524;                // 0x6CD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_523;                // 0x6D00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_522;                // 0x6D28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_521;                // 0x6D50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_520;                // 0x6D78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_519;                // 0x6DA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_518;                // 0x6DC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x6DF0(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_9;                     // 0x6E20(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0x6E70(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x6EA0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0x6ED0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_305;                     // 0x6F00(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0x6F38(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_8;                     // 0x6F68(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0x6FB8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0x6FE8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0x7018(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_304;                     // 0x7048(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0x7080(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x70B0(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_7;                     // 0x70E0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x7130(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x7160(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_303;                     // 0x7190(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x71C8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x71F8(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_6;                     // 0x7228(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x7278(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x72A8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_302;                     // 0x72D8(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x7310(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x7340(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_5;                     // 0x7370(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x73C0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x73F0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_301;                     // 0x7420(0x0038)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_4;                     // 0x7458(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x74A8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x74D8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x7508(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x7538(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_300;                     // 0x7568(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_64;                     // 0x75A0(0x0198)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_14;                  // 0x7738(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_26;                    // 0x77E8(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_201;                  // 0x78C0(0x00D8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x7998(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x79D0(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x7B08(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x7C40(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x7DF0(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x7FA0(0x0138)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x80D8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x8108(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x8138(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x8270(0x01B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x8420(0x0030)()
	struct FAnimNode_AdditiveBoneBlend            AnimGraphNode_AdditiveBoneBlend_3;                 // 0x8450(0x01B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x8608(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x8640(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x8778(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x88B0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x8A60(0x01B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x8C10(0x0060)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_517;                // 0x8C70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_516;                // 0x8C98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_515;                // 0x8CC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_514;                // 0x8CE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_513;                // 0x8D10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_512;                // 0x8D38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_511;                // 0x8D60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_510;                // 0x8D88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_509;                // 0x8DB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x8DD8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_299;                     // 0x8E08(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_508;                // 0x8E40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x8E68(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_298;                     // 0x8E98(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x8ED0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x8F00(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x8F30(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_9;                   // 0x8F60(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_297;                     // 0x9020(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_63;                     // 0x9058(0x0198)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x91F0(0x0070)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x9260(0x0138)()
	uint8                                         Pad_9398[0x8];                                     // 0x9398(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x93A0(0x01B0)()
	struct FAnimNode_CombineCurves                AnimGraphNode_CombineCurves;                       // 0x9550(0x0060)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_200;                  // 0x95B0(0x00D8)()
	uint8                                         Pad_9688[0x8];                                     // 0x9688(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x9690(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x9840(0x0138)()
	uint8                                         Pad_9978[0x8];                                     // 0x9978(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x9980(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_507;                // 0x9B30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_506;                // 0x9B58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_505;                // 0x9B80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_504;                // 0x9BA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_503;                // 0x9BD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_502;                // 0x9BF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_501;                // 0x9C20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_500;                // 0x9C48(0x0028)()
	struct FAnimNode_AdditiveBoneBlend            AnimGraphNode_AdditiveBoneBlend_2;                 // 0x9C70(0x01B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x9E28(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x9E58(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x9E88(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_296;                     // 0x9EB8(0x0038)()
	struct FAnimNode_AdditiveBoneBlend            AnimGraphNode_AdditiveBoneBlend_1;                 // 0x9EF0(0x01B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0xA0A8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0xA0D8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0xA108(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_295;                     // 0xA138(0x0038)()
	struct FAnimNode_AdditiveBoneBlend            AnimGraphNode_AdditiveBoneBlend;                   // 0xA170(0x01B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0xA328(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0xA358(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0xA388(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_294;                     // 0xA3B8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_499;                // 0xA3F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0xA418(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_293;                     // 0xA448(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_62;                     // 0xA480(0x0198)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0xA618(0x0138)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_13;                  // 0xA750(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0xA800(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_199;                  // 0xA838(0x00D8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0xA910(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_498;                // 0xA948(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_497;                // 0xA970(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_496;                // 0xA998(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_495;                // 0xA9C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_494;                // 0xA9E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_493;                // 0xAA10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_492;                // 0xAA38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_491;                // 0xAA60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_490;                // 0xAA88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_489;                // 0xAAB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_488;                // 0xAAD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_487;                // 0xAB00(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_42;                 // 0xAB28(0x0118)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_292;                     // 0xAC40(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_198;                  // 0xAC78(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_291;                     // 0xAD50(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_61;                     // 0xAD88(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_290;                     // 0xAF20(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_486;                // 0xAF58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_485;                // 0xAF80(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_41;                 // 0xAFA8(0x0118)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_289;                     // 0xB0C0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_197;                  // 0xB0F8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_288;                     // 0xB1D0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_60;                     // 0xB208(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_287;                     // 0xB3A0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_196;                  // 0xB3D8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_286;                     // 0xB4B0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_484;                // 0xB4E8(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_59;                     // 0xB510(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_285;                     // 0xB6A8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_483;                // 0xB6E0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_195;                  // 0xB708(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_284;                     // 0xB7E0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_58;                     // 0xB818(0x0198)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0xB9B0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_482;                // 0xB9E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_481;                // 0xBA10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_480;                // 0xBA38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_479;                // 0xBA60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_478;                // 0xBA88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_477;                // 0xBAB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_476;                // 0xBAD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_475;                // 0xBB00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_474;                // 0xBB28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_473;                // 0xBB50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_472;                // 0xBB78(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_194;                  // 0xBBA0(0x00D8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_40;                 // 0xBC78(0x0118)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_25;                    // 0xBD90(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_283;                     // 0xBE68(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0xBEA0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_282;                     // 0xBED0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_471;                // 0xBF08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_470;                // 0xBF30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_469;                // 0xBF58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_468;                // 0xBF80(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_193;                  // 0xBFA8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_281;                     // 0xC080(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_192;                  // 0xC0B8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_280;                     // 0xC190(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_191;                  // 0xC1C8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_279;                     // 0xC2A0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_190;                  // 0xC2D8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_278;                     // 0xC3B0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_57;                     // 0xC3E8(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_277;                     // 0xC580(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_467;                // 0xC5B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_466;                // 0xC5E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_465;                // 0xC608(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_464;                // 0xC630(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0xC658(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_189;                  // 0xC688(0x00D8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_24;                    // 0xC760(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_276;                     // 0xC838(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0xC870(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_188;                  // 0xC8A0(0x00D8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_23;                    // 0xC978(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_275;                     // 0xCA50(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0xCA88(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0xCAB8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_187;                  // 0xCAE8(0x00D8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_7;                       // 0xCBC0(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_22;                    // 0xCC88(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_274;                     // 0xCD60(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_56;                     // 0xCD98(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_273;                     // 0xCF30(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_463;                // 0xCF68(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_186;                  // 0xCF90(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_272;                     // 0xD068(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_55;                     // 0xD0A0(0x0198)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0xD238(0x0060)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_39;                 // 0xD298(0x0118)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_271;                     // 0xD3B0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_54;                     // 0xD3E8(0x0198)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0xD580(0x0138)()
	uint8                                         Pad_D6B8[0x8];                                     // 0xD6B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0xD6C0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0xD870(0x01B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0xDA20(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_462;                // 0xDA58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_461;                // 0xDA80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_460;                // 0xDAA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_459;                // 0xDAD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_458;                // 0xDAF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_457;                // 0xDB20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_456;                // 0xDB48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_455;                // 0xDB70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_454;                // 0xDB98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_453;                // 0xDBC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_452;                // 0xDBE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_451;                // 0xDC10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_450;                // 0xDC38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_449;                // 0xDC60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_448;                // 0xDC88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_447;                // 0xDCB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_446;                // 0xDCD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_445;                // 0xDD00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_444;                // 0xDD28(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_270;                     // 0xDD50(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_185;                  // 0xDD88(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_269;                     // 0xDE60(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_184;                  // 0xDE98(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_268;                     // 0xDF70(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_183;                  // 0xDFA8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_267;                     // 0xE080(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_53;                     // 0xE0B8(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_266;                     // 0xE250(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_443;                // 0xE288(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_38;                 // 0xE2B0(0x0118)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_265;                     // 0xE3C8(0x0038)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_37;                 // 0xE400(0x0118)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_264;                     // 0xE518(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_52;                     // 0xE550(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_263;                     // 0xE6E8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_442;                // 0xE720(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_441;                // 0xE748(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_440;                // 0xE770(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_439;                // 0xE798(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_438;                // 0xE7C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_437;                // 0xE7E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_436;                // 0xE810(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_435;                // 0xE838(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_434;                // 0xE860(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_433;                // 0xE888(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_432;                // 0xE8B0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_182;                  // 0xE8D8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_262;                     // 0xE9B0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_181;                  // 0xE9E8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_261;                     // 0xEAC0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_180;                  // 0xEAF8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_260;                     // 0xEBD0(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_259;                     // 0xEC08(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_51;                     // 0xEC40(0x0198)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0xEDD8(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_431;                // 0xEE88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_430;                // 0xEEB0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_179;                  // 0xEED8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_258;                     // 0xEFB0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_178;                  // 0xEFE8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_257;                     // 0xF0C0(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_256;                     // 0xF0F8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_50;                     // 0xF130(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_255;                     // 0xF2C8(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_254;                     // 0xF300(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_429;                // 0xF338(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_428;                // 0xF360(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_427;                // 0xF388(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_177;                  // 0xF3B0(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_253;                     // 0xF488(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_176;                  // 0xF4C0(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_252;                     // 0xF598(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_251;                     // 0xF5D0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_175;                  // 0xF608(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_250;                     // 0xF6E0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_49;                     // 0xF718(0x0198)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0xF8B0(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_426;                // 0xF960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_425;                // 0xF988(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_424;                // 0xF9B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_423;                // 0xF9D8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_174;                  // 0xFA00(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_249;                     // 0xFAD8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_173;                  // 0xFB10(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_248;                     // 0xFBE8(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_247;                     // 0xFC20(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_172;                  // 0xFC58(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_246;                     // 0xFD30(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_171;                  // 0xFD68(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_245;                     // 0xFE40(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_48;                     // 0xFE78(0x0198)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_244;                     // 0x10010(0x0038)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_36;                 // 0x10048(0x0118)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_21;                    // 0x10160(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_170;                  // 0x10238(0x00D8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x10310(0x00B0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_35;                 // 0x103C0(0x0118)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_20;                    // 0x104D8(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_169;                  // 0x105B0(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_243;                     // 0x10688(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_422;                // 0x106C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_421;                // 0x106E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_420;                // 0x10710(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_168;                  // 0x10738(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_242;                     // 0x10810(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_167;                  // 0x10848(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_241;                     // 0x10920(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_166;                  // 0x10958(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_240;                     // 0x10A30(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_239;                     // 0x10A68(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_47;                     // 0x10AA0(0x0198)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x10C38(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_419;                // 0x10CE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_418;                // 0x10D10(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_6;                       // 0x10D38(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_165;                  // 0x10E00(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_164;                  // 0x10ED8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_238;                     // 0x10FB0(0x0038)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_5;                       // 0x10FE8(0x00C8)()
