#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_EMotorcycleTrailMd10012

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_EMotorcycleTrailMd10012.ABP_EMotorcycleTrailMd10012_C
// 0x04B0 (0x0C80 - 0x07D0)
class UABP_EMotorcycleTrailMd10012_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x07D8(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0810(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0830(0x0020)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup;                  // 0x0850(0x02F0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0B40(0x0138)()

public:
	void ExecuteUbergraph_ABP_EMotorcycleTrailMd10012(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_EMotorcycleTrailMd10012_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_EMotorcycleTrailMd10012_C")
	}
	static class UABP_EMotorcycleTrailMd10012_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_EMotorcycleTrailMd10012_C>();
	}
};
DUMPER7_ASSERTS_UABP_EMotorcycleTrailMd10012_C;

}

