#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Seq_Nvzhu_Final

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Seq_Nvzhu_Final.ABP_Seq_Nvzhu_Final_C
// 0x0240 (0x0A10 - 0x07D0)
class UABP_Seq_Nvzhu_Final_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x07D8(0x0038)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_2;                   // 0x0810(0x00A8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x08B8(0x00A8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x0960(0x00A8)()

public:
	void ExecuteUbergraph_ABP_Seq_Nvzhu_Final(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Seq_Nvzhu_Final_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Seq_Nvzhu_Final_C")
	}
	static class UABP_Seq_Nvzhu_Final_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Seq_Nvzhu_Final_C>();
	}
};
DUMPER7_ASSERTS_UABP_Seq_Nvzhu_Final_C;

}

