#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotifyStateGhost

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimNotifyStateGhost.AnimNotifyStateGhost_C.K2_NotifyBegin
// 0x0018 (0x0018 - 0x0000)
struct AnimNotifyStateGhost_C_K2_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_AnimNotifyStateGhost_C_K2_NotifyBegin;

// Function AnimNotifyStateGhost.AnimNotifyStateGhost_C.K2_NotifyEnd
// 0x0018 (0x0018 - 0x0000)
struct AnimNotifyStateGhost_C_K2_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_AnimNotifyStateGhost_C_K2_NotifyEnd;

// Function AnimNotifyStateGhost.AnimNotifyStateGhost_C.K2_ValidateAssets
// 0x0001 (0x0001 - 0x0000)
struct AnimNotifyStateGhost_C_K2_ValidateAssets final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_AnimNotifyStateGhost_C_K2_ValidateAssets;

// Function AnimNotifyStateGhost.AnimNotifyStateGhost_C.GetNotifyName
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyStateGhost_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AnimNotifyStateGhost_C_GetNotifyName;

}

