#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FloatingStaticMesh

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FloatingStaticMesh.BP_FloatingStaticMesh_C
// 0x0160 (0x0640 - 0x04E0)
class ABP_FloatingStaticMesh_C final : public AKuroFloatingStaticMesh
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UKuroVirtualAttachmentParentComponent*  KuroVirtualAttachmentParent;                       // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComp;                                    // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          使用材质参数;                                      // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      FloatParameters;                                   // 0x0508(0x0050)(Edit, BlueprintVisible)
	TMap<class FName, struct FLinearColor>        ColorParameters;                                   // 0x0558(0x0050)(Edit, BlueprintVisible)
	struct FLinearColor                           EmissionDayColor;                                  // 0x05A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EmissionColor;                                     // 0x05B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseWholeDayEmission;                               // 0x05C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AActor*, struct FTransformDouble>  ChildActors;                                       // 0x05D0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<float>                                 CustomData;                                        // 0x0620(0x0010)(Edit, BlueprintVisible)
	bool                                          SpecialBlueprintActor;                             // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OverrideSuperFarActor;                             // 0x0631(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HiddenState;                                       // 0x0632(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_FloatingStaticMesh(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetMaterialParams();
	void RefreshChildActors();
	void CopyCustomPrimitiveData(class UStaticMeshComponent* Target);
	void SetCustomData();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FloatingStaticMesh_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FloatingStaticMesh_C")
	}
	static class ABP_FloatingStaticMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FloatingStaticMesh_C>();
	}
};
DUMPER7_ASSERTS_ABP_FloatingStaticMesh_C;

}

