#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KuroMasterSeqEvent

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "SpineThingsInfo_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.ExecuteUbergraph_BP_KuroMasterSeqEvent
// 0x0058 (0x0058 - 0x0000)
struct BP_KuroMasterSeqEvent_C_ExecuteUbergraph_BP_KuroMasterSeqEvent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_BaseRole_Seq_V2_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseRole_Seq_V2_C*                  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ScreenEffectSystem_C*               CallFunc_GetScreenEffectSystem_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_ExecuteUbergraph_BP_KuroMasterSeqEvent;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_KuroMasterSeqEvent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_ReceiveTick;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.主触发切镜
// 0x0010 (0x0010 - 0x0000)
struct BP_KuroMasterSeqEvent_C_主触发切镜 final
{
public:
	bool                                          shouldBlend;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         blendTime;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EViewTargetBlendFunction                      blendFunction;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         blendExp;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_主触发切镜;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.调整镜头裁剪距离
// 0x0028 (0x0028 - 0x0000)
struct BP_KuroMasterSeqEvent_C_调整镜头裁剪距离 final
{
public:
	int32                                         NearClip;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_调整镜头裁剪距离;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.开关人物飘带
// 0x0001 (0x0001 - 0x0000)
struct BP_KuroMasterSeqEvent_C_开关人物飘带 final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_开关人物飘带;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.执行流程行为
// 0x0010 (0x0010 - 0x0000)
struct BP_KuroMasterSeqEvent_C_执行流程行为 final
{
public:
	class FString                                 key;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_执行流程行为;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.开始叠化
// 0x0001 (0x0001 - 0x0000)
struct BP_KuroMasterSeqEvent_C_开始叠化 final
{
public:
	bool                                          CallFunc_IsGame_ReturnValue;                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_开始叠化;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.打开章节提示
// 0x0008 (0x0008 - 0x0000)
struct BP_KuroMasterSeqEvent_C_打开章节提示 final
{
public:
	int32                                         ChapterState;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChapterId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_打开章节提示;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.展示游戏Logo
// 0x0004 (0x0004 - 0x0000)
struct BP_KuroMasterSeqEvent_C_展示游戏Logo final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_展示游戏Logo;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.显示预览图
// 0x0048 (0x0048 - 0x0000)
struct BP_KuroMasterSeqEvent_C_显示预览图 final
{
public:
	class FString                                 MaleAssetPath;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FemaleAssetPath;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 maleSpineName;                                     // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 femaleSpineName;                                   // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          needLoop;                                          // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_显示预览图;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.显示预览图(数组)
// 0x0040 (0x0040 - 0x0000)
struct BP_KuroMasterSeqEvent_C_显示预览图_数组_ final
{
public:
	class FString                                 MaleAssetPath;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FemaleAssetPath;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FSpineThingsInfo>               maleSpineArray;                                    // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSpineThingsInfo>               femaleSpineArray;                                  // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_显示预览图_数组_;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.播放预览图动画
// 0x0010 (0x0010 - 0x0000)
struct BP_KuroMasterSeqEvent_C_播放预览图动画 final
{
public:
	class FString                                 seqName;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_播放预览图动画;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.执行实体帧事件
// 0x0018 (0x0018 - 0x0000)
struct BP_KuroMasterSeqEvent_C_执行实体帧事件 final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         EntityId;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_执行实体帧事件;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.播放Spine动画
// 0x0018 (0x0018 - 0x0000)
struct BP_KuroMasterSeqEvent_C_播放Spine动画 final
{
public:
	class FString                                 SpineName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          needLoop;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_播放Spine动画;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.播放Spine动画(性别)
// 0x0028 (0x0028 - 0x0000)
struct BP_KuroMasterSeqEvent_C_播放Spine动画_性别_ final
{
public:
	class FString                                 maleSpineName1;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 femaleSpineName1;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          needLoop;                                          // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_播放Spine动画_性别_;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.播放Spine动画(数组)
// 0x0020 (0x0020 - 0x0000)
struct BP_KuroMasterSeqEvent_C_播放Spine动画_数组_ final
{
public:
	TArray<struct FSpineThingsInfo>               maleSpineArray;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSpineThingsInfo>               femaleSpineArray;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_播放Spine动画_数组_;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.关闭Spine动画
// 0x0010 (0x0010 - 0x0000)
struct BP_KuroMasterSeqEvent_C_关闭Spine动画 final
{
public:
	class FString                                 spineName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_关闭Spine动画;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.关闭Spine动画(数组)
// 0x0010 (0x0010 - 0x0000)
struct BP_KuroMasterSeqEvent_C_关闭Spine动画_数组_ final
{
public:
	TArray<class FString>                         spineArray;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_关闭Spine动画_数组_;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.背景Icon
// 0x0010 (0x0010 - 0x0000)
struct BP_KuroMasterSeqEvent_C_背景Icon final
{
public:
	bool                                          显示;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Icon;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_背景Icon;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.额外Seq播放
// 0x0028 (0x0028 - 0x0000)
struct BP_KuroMasterSeqEvent_C_额外Seq播放 final
{
public:
	class ULevelSequence*                         Seq;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   componentName;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   boneName;                                          // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         frame;                                             // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_额外Seq播放;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.绑定物品检视Actor
// 0x0018 (0x0018 - 0x0000)
struct BP_KuroMasterSeqEvent_C_绑定物品检视Actor final
{
public:
	struct FMovieSceneObjectBindingID             binding;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_绑定物品检视Actor;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.启用剧情交互按钮
// 0x0001 (0x0001 - 0x0000)
struct BP_KuroMasterSeqEvent_C_启用剧情交互按钮 final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_启用剧情交互按钮;

// Function BP_KuroMasterSeqEvent.BP_KuroMasterSeqEvent_C.相机振动
// 0x0038 (0x0038 - 0x0000)
struct BP_KuroMasterSeqEvent_C_相机振动 final
{
public:
	bool                                          启用;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   资产;                                              // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_KuroMasterSeqEvent_C_相机振动;

}

