#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MotorExtraComponent

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "KuroRenderingRuntimeBPPlugin_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MotorExtraComponent.BP_MotorExtraComponent_C
// 0x0028 (0x0058 - 0x0030)
class UBP_MotorExtraComponent_C final : public UObject
{
public:
	class UKuroMaterialControllerComponent*       MaterialControllerComp;                            // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 MotorActor;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            DecalActor;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneLensflare_Motor_C*             LensflareActor;                                    // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VolumetricConeLightShaft_InMotor_C* VolumeLightActor;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetupAoDecal_Func(class UPD_MotorExtraComponentData_C* MotorSetupDA, class AActor* MotorActor_0, class USkeletalMeshComponent* MotorSkeletalMeshActor);
	void SetupSceneLensflare_Func(class UPD_MotorExtraComponentData_C* MotorSetupDA, class AActor* MotorActor_0, class USkeletalMeshComponent* MotorSkeletalMeshActor);
	void SetupVolumeLight_Func(class UPD_MotorExtraComponentData_C* MotorSetupDA, class AActor* MotorActor_0, class USkeletalMeshComponent* MotorSkeletalMeshActor);
	void AddAllMotorExtraComponent_Func(class UObject* MotorSetupDA, class AActor* MotorActor_0);
	void RemoveAllMotorExtraComponent_Func();
	void HiddenAllMotorExtraComponent_Func();
	void DisplayAllMotorExtraComponent_Func();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MotorExtraComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MotorExtraComponent_C")
	}
	static class UBP_MotorExtraComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MotorExtraComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_MotorExtraComponent_C;

}

