#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PerformanceDisableLight_MP4_OnlyEditor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PerformanceDisableLight_MP4_OnlyEditor.BP_PerformanceDisableLight_MP4_OnlyEditor_C
// 0x0028 (0x02D8 - 0x02B0)
class ABP_PerformanceDisableLight_MP4_OnlyEditor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LightIntensity_MP4;                                // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MainCommand;                                       // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PerformanceDisableLight_MP4_OnlyEditor(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	void DisableLightFun();
	void DisableLightFun_MP4();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PerformanceDisableLight_MP4_OnlyEditor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PerformanceDisableLight_MP4_OnlyEditor_C")
	}
	static class ABP_PerformanceDisableLight_MP4_OnlyEditor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PerformanceDisableLight_MP4_OnlyEditor_C>();
	}
};
DUMPER7_ASSERTS_ABP_PerformanceDisableLight_MP4_OnlyEditor_C;

}

