#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SM_TaskRandomMontage

#include "Basic.hpp"

#include "SMSystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SM_TaskRandomMontage.BP_SM_TaskRandomMontage_C
// 0x0020 (0x0050 - 0x0030)
class UBP_SM_TaskRandomMontage_C final : public UASMTask
{
public:
	TArray<class FString>                         MontageNames;                                      // 0x0030(0x0010)(Edit, BlueprintVisible)
	bool                                          加载期间隐藏模型;                                  // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          允许打断;                                          // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BlendInTime;                                       // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          客户端随机;                                        // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SM_TaskRandomMontage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SM_TaskRandomMontage_C")
	}
	static class UBP_SM_TaskRandomMontage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SM_TaskRandomMontage_C>();
	}
};
DUMPER7_ASSERTS_UBP_SM_TaskRandomMontage_C;

}

