#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SeqCustom

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SeqCustom.BP_SeqCustom_C
// 0x0088 (0x0338 - 0x02B0)
class ABP_SeqCustom_C final : public AActor
{
public:
	class USeqCustomComp_C*                       SeqCustomComp;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Mesh;                                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FTransform>          BoneData;                                          // 0x02D0(0x0050)(Edit, BlueprintVisible)
	TArray<class FName>                           SupportNames;                                      // 0x0320(0x0010)(Edit, BlueprintVisible)
	int32                                         TalkID;                                            // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TalkID_SP;                                         // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	bool SetAnimDataVector(const TMap<class FName, struct FVector>& VectorCurveData);
	bool SetAnimDataFloat(const TArray<struct FNamedCurveValue>& FloatCurveData);
	TArray<class FName> GetSupportGroupNames();
	bool GetAnimDataVector(TMap<class FName, struct FVector>* VectorCurveData);
	bool GetAnimDataFloat(TArray<struct FNamedCurveValue>* FloatCurveData);
	bool SetAnimDataTransform(const TMap<class FName, struct FTransform>& FloatCurveData);
	bool GetAnimDataTransform(TMap<class FName, struct FTransform>* FloatCurveData);
	bool IsCustomSupport();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SeqCustom_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SeqCustom_C")
	}
	static class ABP_SeqCustom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SeqCustom_C>();
	}
};
DUMPER7_ASSERTS_ABP_SeqCustom_C;

}

