#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SceneLensflare_Motor

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_structs.hpp"


namespace SDK::Params
{

// Function BP_SceneLensflare_Motor.BP_SceneLensflare_Motor_C.ExecuteUbergraph_BP_SceneLensflare_Motor
// 0x0020 (0x0020 - 0x0000)
struct BP_SceneLensflare_Motor_C_ExecuteUbergraph_BP_SceneLensflare_Motor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_Event_DynMaterial_2;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_Event_DynMaterial_1;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_Event_DynMaterial;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SceneLensflare_Motor_C_ExecuteUbergraph_BP_SceneLensflare_Motor;

// Function BP_SceneLensflare_Motor.BP_SceneLensflare_Motor_C.ApplyDynamicMaterialGlare
// 0x0008 (0x0008 - 0x0000)
struct BP_SceneLensflare_Motor_C_ApplyDynamicMaterialGlare final
{
public:
	class UMaterialInstanceDynamic*               DynMaterial;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SceneLensflare_Motor_C_ApplyDynamicMaterialGlare;

// Function BP_SceneLensflare_Motor.BP_SceneLensflare_Motor_C.ApplyDynamicMaterialHalo
// 0x0008 (0x0008 - 0x0000)
struct BP_SceneLensflare_Motor_C_ApplyDynamicMaterialHalo final
{
public:
	class UMaterialInstanceDynamic*               DynMaterial;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SceneLensflare_Motor_C_ApplyDynamicMaterialHalo;

// Function BP_SceneLensflare_Motor.BP_SceneLensflare_Motor_C.ApplyDynamicMaterialGhost
// 0x0008 (0x0008 - 0x0000)
struct BP_SceneLensflare_Motor_C_ApplyDynamicMaterialGhost final
{
public:
	class UMaterialInstanceDynamic*               DynMaterial;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SceneLensflare_Motor_C_ApplyDynamicMaterialGhost;

// Function BP_SceneLensflare_Motor.BP_SceneLensflare_Motor_C.GetCustomGhostParameter
// 0x0080 (0x0080 - 0x0000)
struct BP_SceneLensflare_Motor_C_GetCustomGhostParameter final
{
public:
	struct FLensflareSamplerActorGhostParameter   ReturnValue;                                       // 0x0000(0x0040)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FLensflareSamplerActorGhostParameter   K2Node_MakeStruct_LensflareSamplerActorGhostParameter; // 0x0040(0x0040)(NoDestructor)
};
DUMPER7_ASSERTS_BP_SceneLensflare_Motor_C_GetCustomGhostParameter;

// Function BP_SceneLensflare_Motor.BP_SceneLensflare_Motor_C.GetCustomHaloParameter
// 0x0090 (0x0090 - 0x0000)
struct BP_SceneLensflare_Motor_C_GetCustomHaloParameter final
{
public:
	struct FLensflareSamplerActorHaloParameter    ReturnValue;                                       // 0x0000(0x0048)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FLensflareSamplerActorHaloParameter    K2Node_MakeStruct_LensflareSamplerActorHaloParameter; // 0x0048(0x0048)(NoDestructor)
};
DUMPER7_ASSERTS_BP_SceneLensflare_Motor_C_GetCustomHaloParameter;

// Function BP_SceneLensflare_Motor.BP_SceneLensflare_Motor_C.GetCustomGlareParameter
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SceneLensflare_Motor_C_GetCustomGlareParameter final
{
public:
	struct FLensflareSamplerActorGlareParameter   ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FLensflareSamplerActorGlareParameter   K2Node_MakeStruct_LensflareSamplerActorGlareParameter; // 0x0050(0x0050)(NoDestructor)
};
DUMPER7_ASSERTS_BP_SceneLensflare_Motor_C_GetCustomGlareParameter;

// Function BP_SceneLensflare_Motor.BP_SceneLensflare_Motor_C.GetLensflareParameter
// 0x0010 (0x0010 - 0x0000)
struct BP_SceneLensflare_Motor_C_GetLensflareParameter final
{
public:
	struct FLensflareSamplerActorParameter        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FLensflareSamplerActorParameter        K2Node_MakeStruct_LensflareSamplerActorParameter;  // 0x0008(0x0008)(NoDestructor)
};
DUMPER7_ASSERTS_BP_SceneLensflare_Motor_C_GetLensflareParameter;

}

