#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrashSight

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class CrashSight.CrashSightSetting
// 0x0048 (0x0078 - 0x0030)
class UCrashSightSetting final : public UObject
{
public:
	bool                                          bNeedUploadLog;                                    // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInternational;                                    // 0x0031(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIOSInitCrashHandler;                              // 0x0032(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AndroidAppID;                                      // 0x0038(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AndroidUploadURL;                                  // 0x0048(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IOSAppID;                                          // 0x0058(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IOSUploadURL;                                      // 0x0068(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrashSightSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrashSightSetting")
	}
	static class UCrashSightSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrashSightSetting>();
	}
};
DUMPER7_ASSERTS_UCrashSightSetting;

}

