#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroDynamicMeshBatch

#include "Basic.hpp"


namespace SDK::Params
{

// Function KuroDynamicMeshBatch.BatchableComponent.SetDynamicUpdate
// 0x0001 (0x0001 - 0x0000)
struct BatchableComponent_SetDynamicUpdate final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BatchableComponent_SetDynamicUpdate;

// Function KuroDynamicMeshBatch.BatchableComponent.ShouldBatch
// 0x0001 (0x0001 - 0x0000)
struct BatchableComponent_ShouldBatch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BatchableComponent_ShouldBatch;

// Function KuroDynamicMeshBatch.BatchSystem.SetActorDynamicUpdate
// 0x0010 (0x0010 - 0x0000)
struct BatchSystem_SetActorDynamicUpdate final
{
public:
	class USceneComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDynamic;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BatchSystem_SetActorDynamicUpdate;

// Function KuroDynamicMeshBatch.BatchSystemFunctionLibrary.GetBatchSystemSubsystem
// 0x0010 (0x0010 - 0x0000)
struct BatchSystemFunctionLibrary_GetBatchSystemSubsystem final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBatchSystemSubsystem*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BatchSystemFunctionLibrary_GetBatchSystemSubsystem;

// Function KuroDynamicMeshBatch.BatchSystemFunctionLibrary.ProcessAllBatches
// 0x0008 (0x0008 - 0x0000)
struct BatchSystemFunctionLibrary_ProcessAllBatches final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BatchSystemFunctionLibrary_ProcessAllBatches;

// Function KuroDynamicMeshBatch.PropBatchComponent.SetupFromDataAsset
// 0x0010 (0x0010 - 0x0000)
struct PropBatchComponent_SetupFromDataAsset final
{
public:
	class UPropGroupDataAsset*                    InDataAsset;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropBatchComponent_SetupFromDataAsset;

}

