#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroBullet

#include "Basic.hpp"

#include "KuroBullet_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function KuroBullet.BulletHitWorldEntityBridge.GetCamp
// 0x0008 (0x0008 - 0x0000)
struct BulletHitWorldEntityBridge_GetCamp final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletHitWorldEntityBridge_GetCamp;

// Function KuroBullet.BulletHitWorldEntityBridge.GetCampRelationship
// 0x000C (0x000C - 0x0000)
struct BulletHitWorldEntityBridge_GetCampRelationship final
{
public:
	int32                                         Camp1;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Camp2;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletHitWorldEntityBridge_GetCampRelationship;

// Function KuroBullet.BulletHitWorldEntityBridge.HasTag
// 0x0014 (0x0014 - 0x0000)
struct BulletHitWorldEntityBridge_HasTag final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0004(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletHitWorldEntityBridge_HasTag;

// Function KuroBullet.BulletHitWorldEntityBridge.NotifyExistedImmediatelyOperation
// 0x0058 (0x0058 - 0x0000)
struct BulletHitWorldEntityBridge_NotifyExistedImmediatelyOperation final
{
public:
	struct FBulletHitWorldEntityOperation         Operation;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletHitWorldEntityBridge_NotifyExistedImmediatelyOperation;

// Function KuroBullet.BulletHitWorldEntityManager.CreateInstance
// 0x0010 (0x0010 - 0x0000)
struct BulletHitWorldEntityManager_CreateInstance final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBulletHitWorldEntityManager*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletHitWorldEntityManager_CreateInstance;

// Function KuroBullet.BulletHitWorldEntityManager.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct BulletHitWorldEntityManager_GetInstance final
{
public:
	class UBulletHitWorldEntityManager*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletHitWorldEntityManager_GetInstance;

// Function KuroBullet.BulletHitWorldEntityManager.GetBulletHitWorldEntityBridge
// 0x0008 (0x0008 - 0x0000)
struct BulletHitWorldEntityManager_GetBulletHitWorldEntityBridge final
{
public:
	class UBulletHitWorldEntityBridge*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletHitWorldEntityManager_GetBulletHitWorldEntityBridge;

// Function KuroBullet.BulletHitWorldEntityManager.GetEntityCanDodge
// 0x0008 (0x0008 - 0x0000)
struct BulletHitWorldEntityManager_GetEntityCanDodge final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletHitWorldEntityManager_GetEntityCanDodge;

// Function KuroBullet.BulletHitWorldEntityManager.GetOperationList
// 0x0010 (0x0010 - 0x0000)
struct BulletHitWorldEntityManager_GetOperationList final
{
public:
	TArray<struct FBulletHitWorldEntityOperation> OutOperationList;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletHitWorldEntityManager_GetOperationList;

// Function KuroBullet.BulletHitWorldEntityManager.SetBulletHitWorldEntityBridge
// 0x0008 (0x0008 - 0x0000)
struct BulletHitWorldEntityManager_SetBulletHitWorldEntityBridge final
{
public:
	class UBulletHitWorldEntityBridge*            Bridge;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletHitWorldEntityManager_SetBulletHitWorldEntityBridge;

// Function KuroBullet.BulletHitWorldEntityManager.SetEntityCamp
// 0x0008 (0x0008 - 0x0000)
struct BulletHitWorldEntityManager_SetEntityCamp final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Camp;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletHitWorldEntityManager_SetEntityCamp;

// Function KuroBullet.BulletHitWorldEntityManager.SetEntityCanDodge
// 0x0008 (0x0008 - 0x0000)
struct BulletHitWorldEntityManager_SetEntityCanDodge final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanDodge;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletHitWorldEntityManager_SetEntityCanDodge;

// Function KuroBullet.KscBulletManager.CreateInstance
// 0x0010 (0x0010 - 0x0000)
struct KscBulletManager_CreateInstance final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKscBulletManager*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KscBulletManager_CreateInstance;

// Function KuroBullet.KscBulletManager.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct KscBulletManager_GetInstance final
{
public:
	class UKscBulletManager*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KscBulletManager_GetInstance;

}

