#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "KuroComponent_structs.hpp"


namespace SDK::Params
{

// Function KuroComponent.GpuNpcDitherComponent.ResetDitherForAllInstance
// 0x0004 (0x0004 - 0x0000)
struct GpuNpcDitherComponent_ResetDitherForAllInstance final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GpuNpcDitherComponent_ResetDitherForAllInstance;

// Function KuroComponent.KuroCharacterAnimationComponent.AddModelLocation
// 0x000C (0x000C - 0x0000)
struct KuroCharacterAnimationComponent_AddModelLocation final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroCharacterAnimationComponent_AddModelLocation;

// Function KuroComponent.KuroCharacterAnimationComponent.AddModelQuat
// 0x0020 (0x0020 - 0x0000)
struct KuroCharacterAnimationComponent_AddModelQuat final
{
public:
	struct FQuat                                  Quat;                                              // 0x0000(0x0010)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          LockCenter;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroCharacterAnimationComponent_AddModelQuat;

// Function KuroComponent.KuroCharacterAnimationComponent.D_GetTransformOffsetInWorld
// 0x0080 (0x0080 - 0x0000)
struct KuroCharacterAnimationComponent_D_GetTransformOffsetInWorld final
{
public:
	struct FTransformDouble                       Child;                                             // 0x0000(0x0040)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransformDouble                       Parent;                                            // 0x0040(0x0040)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroCharacterAnimationComponent_D_GetTransformOffsetInWorld;

// Function KuroComponent.KuroCharacterAnimationComponent.GetTransformOffsetInWorld
// 0x0060 (0x0060 - 0x0000)
struct KuroCharacterAnimationComponent_GetTransformOffsetInWorld final
{
public:
	struct FTransform                             Child;                                             // 0x0000(0x0030)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             Parent;                                            // 0x0030(0x0030)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroCharacterAnimationComponent_GetTransformOffsetInWorld;

// Function KuroComponent.KuroCharacterAnimationComponent.SetOriginLocation
// 0x000C (0x000C - 0x0000)
struct KuroCharacterAnimationComponent_SetOriginLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroCharacterAnimationComponent_SetOriginLocation;

// Function KuroComponent.KuroRegionDetectComponent.GetRegionDetectId
// 0x0004 (0x0004 - 0x0000)
struct KuroRegionDetectComponent_GetRegionDetectId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRegionDetectComponent_GetRegionDetectId;

// Function KuroComponent.KuroRegionDetectComponent.GetRegionEvent
// 0x0020 (0x0020 - 0x0000)
struct KuroRegionDetectComponent_GetRegionEvent final
{
public:
	class FString                                 RegionName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Id;                                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroRegionEventBinder*                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRegionDetectComponent_GetRegionEvent;

// Function KuroComponent.KuroRegionDetectComponent.RemoveRegionDetect
// 0x0004 (0x0004 - 0x0000)
struct KuroRegionDetectComponent_RemoveRegionDetect final
{
public:
	int32                                         Id;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRegionDetectComponent_RemoveRegionDetect;

// Function KuroComponent.KuroRegionDetectComponent.SetDebugMode
// 0x0001 (0x0001 - 0x0000)
struct KuroRegionDetectComponent_SetDebugMode final
{
public:
	bool                                          IsOpen;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroRegionDetectComponent_SetDebugMode;

// Function KuroComponent.KuroRegionDetectComponent.SetEventTarget
// 0x0010 (0x0010 - 0x0000)
struct KuroRegionDetectComponent_SetEventTarget final
{
public:
	class AActor*                                 DetectTarget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Id;                                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroRegionDetectComponent_SetEventTarget;

// Function KuroComponent.KuroRegionDetectComponent.SetEventTargets
// 0x0018 (0x0018 - 0x0000)
struct KuroRegionDetectComponent_SetEventTargets final
{
public:
	TArray<class AActor*>                         DetectTargets;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         Id;                                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroRegionDetectComponent_SetEventTargets;

// Function KuroComponent.KuroRegionDetectComponent.Detect
// 0x0030 (0x0030 - 0x0000)
struct KuroRegionDetectComponent_Detect final
{
public:
	struct FVectorDouble                          Point;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RegionName;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroRegionDetectComponent_Detect;

// Function KuroComponent.KuroSceneItemGuidePathComponent.StartTick
// 0x0044 (0x0044 - 0x0000)
struct KuroSceneItemGuidePathComponent_StartTick final
{
public:
	struct FLinearColor                           Normal;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ChangeCoefficient;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Finish;                                            // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x0030(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalCountDown;                                    // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurCountDown;                                      // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemGuidePathComponent_StartTick;

// Function KuroComponent.KuroSceneItemModelBufferComponent.AddModelLocation
// 0x000C (0x000C - 0x0000)
struct KuroSceneItemModelBufferComponent_AddModelLocation final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemModelBufferComponent_AddModelLocation;

// Function KuroComponent.KuroSceneItemModelBufferComponent.AddModelQuat
// 0x0020 (0x0020 - 0x0000)
struct KuroSceneItemModelBufferComponent_AddModelQuat final
{
public:
	struct FQuat                                  Quat;                                              // 0x0000(0x0010)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          LockCenter;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSceneItemModelBufferComponent_AddModelQuat;

// Function KuroComponent.KuroSceneItemModelBufferComponent.D_GetTransformOffsetInWorld
// 0x00C0 (0x00C0 - 0x0000)
struct KuroSceneItemModelBufferComponent_D_GetTransformOffsetInWorld final
{
public:
	struct FTransformDouble                       Child;                                             // 0x0000(0x0040)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransformDouble                       Parent;                                            // 0x0040(0x0040)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransformDouble                       Out;                                               // 0x0080(0x0040)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemModelBufferComponent_D_GetTransformOffsetInWorld;

// Function KuroComponent.KuroSceneItemModelBufferComponent.GetTransformOffsetInWorld
// 0x0060 (0x0060 - 0x0000)
struct KuroSceneItemModelBufferComponent_GetTransformOffsetInWorld final
{
public:
	struct FTransform                             Child;                                             // 0x0000(0x0030)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             Parent;                                            // 0x0030(0x0030)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemModelBufferComponent_GetTransformOffsetInWorld;

// Function KuroComponent.KuroSceneItemModelBufferComponent.SetUpMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct KuroSceneItemModelBufferComponent_SetUpMeshComponent final
{
public:
	class USkeletalMeshComponent*                 InMeshComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemModelBufferComponent_SetUpMeshComponent;

// Function KuroComponent.KuroSceneItemModelBufferComponent.SetActorTransformExceptSkeletalMesh
// 0x00C0 (0x00C0 - 0x0000)
struct KuroSceneItemModelBufferComponent_SetActorTransformExceptSkeletalMesh final
{
public:
	struct FVectorDouble                          NewLocation;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               NewRotation;                                       // 0x0018(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepHitResult;                                    // 0x0028(0x0094)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x00BC(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreOverlap;                                    // 0x00BD(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00BE(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BF[0x1];                                       // 0x00BF(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSceneItemModelBufferComponent_SetActorTransformExceptSkeletalMesh;

// Function KuroComponent.KuroSceneItemMoveComponent.FindTimeByValueIn01Curve
// 0x0020 (0x0020 - 0x0000)
struct KuroSceneItemMoveComponent_FindTimeByValueIn01Curve final
{
public:
	const class UCurveFloat*                      Curve;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetValue;                                       // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ResultTime;                                        // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxSearchDepth;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Tolerance;                                         // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_FindTimeByValueIn01Curve;

// Function KuroComponent.KuroSceneItemMoveComponent.AddMoveTarget
// 0x0028 (0x0028 - 0x0000)
struct KuroSceneItemMoveComponent_AddMoveTarget final
{
public:
	struct FVectorDouble                          Loc;                                               // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveTime;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaitTime;                                          // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSpeed;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration;                                      // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_AddMoveTarget;

// Function KuroComponent.KuroSceneItemMoveComponent.AddRotationStep
// 0x0030 (0x0030 - 0x0000)
struct KuroSceneItemMoveComponent_AddRotationStep final
{
public:
	struct FRotator                               BeginRotation;                                     // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               EndRotation;                                       // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         TimeSec;                                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CdSec;                                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            RotateCurve;                                       // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_AddRotationStep;

// Function KuroComponent.KuroSceneItemMoveComponent.CalcVelocity
// 0x0004 (0x0004 - 0x0000)
struct KuroSceneItemMoveComponent_CalcVelocity final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_CalcVelocity;

// Function KuroComponent.KuroSceneItemMoveComponent.GetNextMoveTarget
// 0x0038 (0x0038 - 0x0000)
struct KuroSceneItemMoveComponent_GetNextMoveTarget final
{
public:
	struct FVectorDouble                          NextTarget;                                        // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVectorDouble                          CurrentVelocity;                                   // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_GetNextMoveTarget;

// Function KuroComponent.KuroSceneItemMoveComponent.InitRotationData
// 0x0010 (0x0010 - 0x0000)
struct KuroSceneItemMoveComponent_InitRotationData final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLoop;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_InitRotationData;

// Function KuroComponent.KuroSceneItemMoveComponent.Kuro_SetGravityDirect
// 0x000C (0x000C - 0x0000)
struct KuroSceneItemMoveComponent_Kuro_SetGravityDirect final
{
public:
	struct FVector                                InGravityDirect;                                   // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_Kuro_SetGravityDirect;

// Function KuroComponent.KuroSceneItemMoveComponent.SetAvoidanceEnabled
// 0x0001 (0x0001 - 0x0000)
struct KuroSceneItemMoveComponent_SetAvoidanceEnabled final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_SetAvoidanceEnabled;

// Function KuroComponent.KuroSceneItemMoveComponent.SetAvoidanceGroupMask
// 0x0004 (0x0004 - 0x0000)
struct KuroSceneItemMoveComponent_SetAvoidanceGroupMask final
{
public:
	struct FNavAvoidanceMask                      GroupMask;                                         // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_SetAvoidanceGroupMask;

// Function KuroComponent.KuroSceneItemMoveComponent.SetEnableDebugForMove
// 0x0001 (0x0001 - 0x0000)
struct KuroSceneItemMoveComponent_SetEnableDebugForMove final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_SetEnableDebugForMove;

// Function KuroComponent.KuroSceneItemMoveComponent.SetGroupsToAvoidMask
// 0x0004 (0x0004 - 0x0000)
struct KuroSceneItemMoveComponent_SetGroupsToAvoidMask final
{
public:
	struct FNavAvoidanceMask                      GroupMask;                                         // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_SetGroupsToAvoidMask;

// Function KuroComponent.KuroSceneItemMoveComponent.SetGroupsToIgnoreMask
// 0x0004 (0x0004 - 0x0000)
struct KuroSceneItemMoveComponent_SetGroupsToIgnoreMask final
{
public:
	struct FNavAvoidanceMask                      GroupMask;                                         // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_SetGroupsToIgnoreMask;

// Function KuroComponent.KuroSceneItemMoveComponent.SetMaxDeltaDegreePerSecondForUpdatingLookAt
// 0x0004 (0x0004 - 0x0000)
struct KuroSceneItemMoveComponent_SetMaxDeltaDegreePerSecondForUpdatingLookAt final
{
public:
	float                                         MaxDegreePerSecond;                                // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_SetMaxDeltaDegreePerSecondForUpdatingLookAt;

// Function KuroComponent.KuroSceneItemMoveComponent.SetTickingMoveEnable
// 0x0001 (0x0001 - 0x0000)
struct KuroSceneItemMoveComponent_SetTickingMoveEnable final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_SetTickingMoveEnable;

// Function KuroComponent.KuroSceneItemMoveComponent.SetTickingRotateEnable
// 0x0001 (0x0001 - 0x0000)
struct KuroSceneItemMoveComponent_SetTickingRotateEnable final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_SetTickingRotateEnable;

// Function KuroComponent.KuroSceneItemMoveComponent.StartMoveWithSplineAtConstantTime
// 0x0028 (0x0028 - 0x0000)
struct KuroSceneItemMoveComponent_StartMoveWithSplineAtConstantTime final
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Repeat;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Cycle;                                             // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          KeepLookAt;                                        // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeSec;                                           // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            TimeDisCurve;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTimeOffset;                                   // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartDis;                                          // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDis;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_StartMoveWithSplineAtConstantTime;

// Function KuroComponent.KuroSceneItemMoveComponent.StartMoveWithSplineAtDynamicSpeed
// 0x0028 (0x0028 - 0x0000)
struct KuroSceneItemMoveComponent_StartMoveWithSplineAtDynamicSpeed final
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxMoveTimes;                                      // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Cycle;                                             // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          KeepLookAt;                                        // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InitSpeed;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration;                                      // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetSpeed;                                       // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartDis;                                          // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDis;                                            // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_StartMoveWithSplineAtDynamicSpeed;

// Function KuroComponent.KuroSceneItemMoveComponent.StartRotate
// 0x0001 (0x0001 - 0x0000)
struct KuroSceneItemMoveComponent_StartRotate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_StartRotate;

// Function KuroComponent.KuroSceneItemMoveComponent.StopAllMove
// 0x0002 (0x0002 - 0x0000)
struct KuroSceneItemMoveComponent_StopAllMove final
{
public:
	bool                                          bBroadcastStopCallback;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBroadcastIndexCallback;                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_StopAllMove;

// Function KuroComponent.KuroSceneItemMoveComponent.StopRotate
// 0x0003 (0x0003 - 0x0000)
struct KuroSceneItemMoveComponent_StopRotate final
{
public:
	EKuroSceneItemStopRotateMethod                StopMethod;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBroadcastRotateStopCallback;                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_StopRotate;

// Function KuroComponent.KuroSceneItemMoveComponent.UpdateDynamicSpeedSplineMoveParams
// 0x0010 (0x0010 - 0x0000)
struct KuroSceneItemMoveComponent_UpdateDynamicSpeedSplineMoveParams final
{
public:
	float                                         CurrentSpeed;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration;                                      // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetSpeed;                                       // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_UpdateDynamicSpeedSplineMoveParams;

// Function KuroComponent.KuroSceneItemMoveComponent.UpdateSplineMoveDistance
// 0x0008 (0x0008 - 0x0000)
struct KuroSceneItemMoveComponent_UpdateSplineMoveDistance final
{
public:
	float                                         NewDistanceAloneSpline;                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_UpdateSplineMoveDistance;

// Function KuroComponent.KuroSceneItemMoveComponent.UpdateSplineMoveDistanceByPosition
// 0x0020 (0x0020 - 0x0000)
struct KuroSceneItemMoveComponent_UpdateSplineMoveDistanceByPosition final
{
public:
	struct FVectorDouble                          NewPosition;                                       // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_UpdateSplineMoveDistanceByPosition;

// Function KuroComponent.KuroSceneItemMoveComponent.GetDistanceAlongSpline
// 0x0004 (0x0004 - 0x0000)
struct KuroSceneItemMoveComponent_GetDistanceAlongSpline final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_GetDistanceAlongSpline;

// Function KuroComponent.KuroSceneItemMoveComponent.GetSimpleRunState
// 0x0001 (0x0001 - 0x0000)
struct KuroSceneItemMoveComponent_GetSimpleRunState final
{
public:
	ESimpleRunState                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_GetSimpleRunState;

// Function KuroComponent.KuroSceneItemMoveComponent.GetSplineRunState
// 0x0001 (0x0001 - 0x0000)
struct KuroSceneItemMoveComponent_GetSplineRunState final
{
public:
	ESplineRunState                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_GetSplineRunState;

// Function KuroComponent.KuroSceneItemMoveComponent.IsMoving
// 0x0002 (0x0002 - 0x0000)
struct KuroSceneItemMoveComponent_IsMoving final
{
public:
	bool                                          ConsiderSimpleWaitAsMoving;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_IsMoving;

// Function KuroComponent.KuroSceneItemMoveComponent.IsRotating
// 0x0001 (0x0001 - 0x0000)
struct KuroSceneItemMoveComponent_IsRotating final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_IsRotating;

// Function KuroComponent.KuroSceneItemMoveComponent.Kuro_GetGravityDirect
// 0x000C (0x000C - 0x0000)
struct KuroSceneItemMoveComponent_Kuro_GetGravityDirect final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneItemMoveComponent_Kuro_GetGravityDirect;

}

