#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroFuncOpenLibrary

#include "Basic.hpp"

#include "JsEnv_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KuroFuncOpenLibrary.FuncOpenBlueprintFunctionLibrary.FreeArrayBuffer
// 0x0010 (0x0010 - 0x0000)
struct FuncOpenBlueprintFunctionLibrary_FreeArrayBuffer final
{
public:
	struct FArrayBuffer                           InArrayBuffer;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FuncOpenBlueprintFunctionLibrary_FreeArrayBuffer;

// Function KuroFuncOpenLibrary.FuncOpenBlueprintFunctionLibrary.GetEBuffer
// 0x0010 (0x0010 - 0x0000)
struct FuncOpenBlueprintFunctionLibrary_GetEBuffer final
{
public:
	struct FArrayBuffer                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FuncOpenBlueprintFunctionLibrary_GetEBuffer;

// Function KuroFuncOpenLibrary.FuncOpenBlueprintFunctionLibrary.SetFirstTimestamp
// 0x0008 (0x0008 - 0x0000)
struct FuncOpenBlueprintFunctionLibrary_SetFirstTimestamp final
{
public:
	int64                                         timestamp;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FuncOpenBlueprintFunctionLibrary_SetFirstTimestamp;

// Function KuroFuncOpenLibrary.FuncOpenBlueprintFunctionLibrary.SetIsCheckEncrypt
// 0x0010 (0x0010 - 0x0000)
struct FuncOpenBlueprintFunctionLibrary_SetIsCheckEncrypt final
{
public:
	class FString                                 Str;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FuncOpenBlueprintFunctionLibrary_SetIsCheckEncrypt;

// Function KuroFuncOpenLibrary.FuncOpenBlueprintFunctionLibrary.TryOpen
// 0x0010 (0x0010 - 0x0000)
struct FuncOpenBlueprintFunctionLibrary_TryOpen final
{
public:
	struct FArrayBuffer                           InArrayBuffer;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FuncOpenBlueprintFunctionLibrary_TryOpen;

// Function KuroFuncOpenLibrary.KuroCharacterShadowBlueprintFunctionLibrary.Set
// 0x0010 (0x0010 - 0x0000)
struct KuroCharacterShadowBlueprintFunctionLibrary_Set final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroCharacterShadowBlueprintFunctionLibrary_Set;

// Function KuroFuncOpenLibrary.KuroCharacterShadowBlueprintFunctionLibrary.SetR
// 0x0010 (0x0010 - 0x0000)
struct KuroCharacterShadowBlueprintFunctionLibrary_SetR final
{
public:
	struct FArrayBuffer                           R;                                                 // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroCharacterShadowBlueprintFunctionLibrary_SetR;

}

