#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroBulletCore

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "KuroBulletCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KuroBulletCore.BulletEntity.OnObstacleTrace
// 0x0020 (0x0020 - 0x0000)
struct BulletEntity_OnObstacleTrace final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTraceBaseElement*                      Element;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Frame;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Index_0;                                           // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletEntity_OnObstacleTrace;

// Function KuroBulletCore.BulletWorld.AddCommonBulletDataTable
// 0x0008 (0x0008 - 0x0000)
struct BulletWorld_AddCommonBulletDataTable final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_AddCommonBulletDataTable;

// Function KuroBulletCore.BulletWorld.CreateBullet
// 0x0090 (0x0090 - 0x0000)
struct BulletWorld_CreateBullet final
{
public:
	TScriptInterface<class IBulletContext>        BulletContext;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	int64                                         BulletConfigId;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBulletSpawnParams                     SpawnParams;                                       // 0x0020(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0080(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletWorld_CreateBullet;

// Function KuroBulletCore.BulletWorld.DestroyAllBulletsByOwner
// 0x0008 (0x0008 - 0x0000)
struct BulletWorld_DestroyAllBulletsByOwner final
{
public:
	const class AActor*                           Owner;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_DestroyAllBulletsByOwner;

// Function KuroBulletCore.BulletWorld.DestroyBullet
// 0x0010 (0x0010 - 0x0000)
struct BulletWorld_DestroyBullet final
{
public:
	class UBulletEntity*                          BulletEntity;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClearContext;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletWorld_DestroyBullet;

// Function KuroBulletCore.BulletWorld.DestroyBulletById
// 0x0008 (0x0008 - 0x0000)
struct BulletWorld_DestroyBulletById final
{
public:
	int32                                         BulletEntityId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClearContext;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletWorld_DestroyBulletById;

// Function KuroBulletCore.BulletWorld.DestroyPattern
// 0x0004 (0x0004 - 0x0000)
struct BulletWorld_DestroyPattern final
{
public:
	int32                                         PatternId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_DestroyPattern;

// Function KuroBulletCore.BulletWorld.DestroyPatternsByOwner
// 0x0008 (0x0008 - 0x0000)
struct BulletWorld_DestroyPatternsByOwner final
{
public:
	const class AActor*                           Owner;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_DestroyPatternsByOwner;

// Function KuroBulletCore.BulletWorld.EnableFlatGround
// 0x0008 (0x0008 - 0x0000)
struct BulletWorld_EnableFlatGround final
{
public:
	double                                        Height;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_EnableFlatGround;

// Function KuroBulletCore.BulletWorld.EnableFlatGroundByAbovePoint
// 0x0018 (0x0018 - 0x0000)
struct BulletWorld_EnableFlatGroundByAbovePoint final
{
public:
	struct FVectorDouble                          AbovePoint;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_EnableFlatGroundByAbovePoint;

// Function KuroBulletCore.BulletWorld.FindBulletConfig
// 0x0258 (0x0258 - 0x0000)
struct BulletWorld_FindBulletConfig final
{
public:
	int64                                         BulletConfigId;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             OwnerBulletDataTable;                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKuroBulletData                        OutRow;                                            // 0x0010(0x0240)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0250(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletWorld_FindBulletConfig;

// Function KuroBulletCore.BulletWorld.InitBulletConfig
// 0x0020 (0x0020 - 0x0000)
struct BulletWorld_InitBulletConfig final
{
public:
	class UBulletEntity*                          BulletEntity;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         BulletConfigId;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             OwnerBulletDataTable;                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletWorld_InitBulletConfig;

// Function KuroBulletCore.BulletWorld.RegisterBulletActionClass
// 0x0010 (0x0010 - 0x0000)
struct BulletWorld_RegisterBulletActionClass final
{
public:
	EKuroBulletCoreActionType                     ActionType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UBulletActionBase>          ActionClass;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_RegisterBulletActionClass;

// Function KuroBulletCore.BulletWorld.RegisterBulletActionClassByTag
// 0x0018 (0x0018 - 0x0000)
struct BulletWorld_RegisterBulletActionClassByTag final
{
public:
	struct FGameplayTag                           ActionTag;                                         // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UBulletActionBase>          ActionClass;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_RegisterBulletActionClassByTag;

// Function KuroBulletCore.BulletWorld.SetKFCAlgorithm
// 0x0008 (0x0008 - 0x0000)
struct BulletWorld_SetKFCAlgorithm final
{
public:
	class UKuroFastCollisionAlgorithm*            Algorithm;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_SetKFCAlgorithm;

// Function KuroBulletCore.BulletWorld.SetShowBulletCollision
// 0x0001 (0x0001 - 0x0000)
struct BulletWorld_SetShowBulletCollision final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_SetShowBulletCollision;

// Function KuroBulletCore.BulletWorld.SetShowEmitterDebugDraw
// 0x0001 (0x0001 - 0x0000)
struct BulletWorld_SetShowEmitterDebugDraw final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_SetShowEmitterDebugDraw;

// Function KuroBulletCore.BulletWorld.SpawnPattern
// 0x0020 (0x0020 - 0x0000)
struct BulletWorld_SpawnPattern final
{
public:
	TScriptInterface<class IBulletContext>        PatternContext;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	const class UKuroBulletPatternDataAsset*      PatternDA;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BulletWorld_SpawnPattern;

// Function KuroBulletCore.BulletWorld.GetBulletEntity
// 0x0010 (0x0010 - 0x0000)
struct BulletWorld_GetBulletEntity final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBulletEntity*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BulletWorld_GetBulletEntity;

// Function KuroBulletCore.KuroBulletCoreSubsystem.CreateWorld
// 0x0008 (0x0008 - 0x0000)
struct KuroBulletCoreSubsystem_CreateWorld final
{
public:
	class UBulletWorld*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBulletCoreSubsystem_CreateWorld;

// Function KuroBulletCore.KuroBulletCoreSubsystem.GetBulletWorld
// 0x0008 (0x0008 - 0x0000)
struct KuroBulletCoreSubsystem_GetBulletWorld final
{
public:
	class UBulletWorld*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBulletCoreSubsystem_GetBulletWorld;

// Function KuroBulletCore.KuroBulletFunctionLibrary.DestroyBulletById
// 0x0008 (0x0008 - 0x0000)
struct KuroBulletFunctionLibrary_DestroyBulletById final
{
public:
	int32                                         BulletEntityId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClearOwner;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroBulletFunctionLibrary_DestroyBulletById;

// Function KuroBulletCore.KuroBulletFunctionLibrary.DestroyPattern
// 0x0004 (0x0004 - 0x0000)
struct KuroBulletFunctionLibrary_DestroyPattern final
{
public:
	int32                                         PatternId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBulletFunctionLibrary_DestroyPattern;

// Function KuroBulletCore.KuroBulletFunctionLibrary.DestroyPatternsByOwner
// 0x0008 (0x0008 - 0x0000)
struct KuroBulletFunctionLibrary_DestroyPatternsByOwner final
{
public:
	const class AActor*                           Owner;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBulletFunctionLibrary_DestroyPatternsByOwner;

// Function KuroBulletCore.KuroBulletFunctionLibrary.SetShowBulletCollision
// 0x0001 (0x0001 - 0x0000)
struct KuroBulletFunctionLibrary_SetShowBulletCollision final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBulletFunctionLibrary_SetShowBulletCollision;

// Function KuroBulletCore.KuroBulletFunctionLibrary.SetShowEmitterDebugDraw
// 0x0001 (0x0001 - 0x0000)
struct KuroBulletFunctionLibrary_SetShowEmitterDebugDraw final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroBulletFunctionLibrary_SetShowEmitterDebugDraw;

// Function KuroBulletCore.KuroBulletFunctionLibrary.SpawnPattern
// 0x0020 (0x0020 - 0x0000)
struct KuroBulletFunctionLibrary_SpawnPattern final
{
public:
	TScriptInterface<class IBulletContext>        PatternContext;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	const class UKuroBulletPatternDataAsset*      PatternDA;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroBulletFunctionLibrary_SpawnPattern;

}

