#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroBullet

#include "Basic.hpp"

#include "KuroBulletCore_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "KuroSimpleCombat_structs.hpp"
#include "KuroSimpleCombat_classes.hpp"
#include "KuroBullet_structs.hpp"


namespace SDK
{

// Class KuroBullet.KSC_Buff_KuroBullet
// 0x0010 (0x0070 - 0x0060)
class UKSC_Buff_KuroBullet final : public UKSC_Buff
{
public:
	class UKSC_DA_Buff_KuroBullet*                DaBuffKuroBullet_;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_KuroBullet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_KuroBullet")
	}
	static class UKSC_Buff_KuroBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_KuroBullet>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_KuroBullet;

// Class KuroBullet.ActionUpdateCollisionKsc
// 0x0000 (0x0038 - 0x0038)
class UActionUpdateCollisionKsc final : public UActionUpdateCollision
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActionUpdateCollisionKsc")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActionUpdateCollisionKsc")
	}
	static class UActionUpdateCollisionKsc* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionUpdateCollisionKsc>();
	}
};
DUMPER7_ASSERTS_UActionUpdateCollisionKsc;

// Class KuroBullet.ActionUpdateCollisionWorldEntity
// 0x0000 (0x0038 - 0x0038)
class UActionUpdateCollisionWorldEntity final : public UActionUpdateCollision
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActionUpdateCollisionWorldEntity")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActionUpdateCollisionWorldEntity")
	}
	static class UActionUpdateCollisionWorldEntity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionUpdateCollisionWorldEntity>();
	}
};
DUMPER7_ASSERTS_UActionUpdateCollisionWorldEntity;

// Class KuroBullet.ActionUpdateMoveKsc
// 0x0000 (0x0038 - 0x0038)
class UActionUpdateMoveKsc final : public UActionUpdateMove
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActionUpdateMoveKsc")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActionUpdateMoveKsc")
	}
	static class UActionUpdateMoveKsc* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionUpdateMoveKsc>();
	}
};
DUMPER7_ASSERTS_UActionUpdateMoveKsc;

// Class KuroBullet.BulletHitWorldEntityBridge
// 0x0000 (0x0030 - 0x0030)
class UBulletHitWorldEntityBridge : public UObject
{
public:
	int32 GetCamp(int32 EntityId);
	int32 GetCampRelationship(int32 Camp1, int32 Camp2);
	bool HasTag(int32 EntityId, const struct FGameplayTag& Tag);
	void NotifyExistedImmediatelyOperation(const struct FBulletHitWorldEntityOperation& Operation);
	void NotifyExistedOperationList();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BulletHitWorldEntityBridge")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BulletHitWorldEntityBridge")
	}
	static class UBulletHitWorldEntityBridge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBulletHitWorldEntityBridge>();
	}
};
DUMPER7_ASSERTS_UBulletHitWorldEntityBridge;

// Class KuroBullet.BulletHitWorldEntityManager
// 0x00D8 (0x0108 - 0x0030)
class UBulletHitWorldEntityManager final : public UObject
{
public:
	class UBulletWorld*                           BulletWorld;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBulletHitWorldEntityBridge*            BulletHitWorldEntityBridge;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0xC8];                                      // 0x0040(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UBulletHitWorldEntityManager* CreateInstance(class UObject* Outer_0);
	static void DestroyInstance();
	static class UBulletHitWorldEntityManager* GetInstance();

	class UBulletHitWorldEntityBridge* GetBulletHitWorldEntityBridge();
	bool GetEntityCanDodge(int32 EntityId);
	void GetOperationList(TArray<struct FBulletHitWorldEntityOperation>* OutOperationList);
	void SetBulletHitWorldEntityBridge(class UBulletHitWorldEntityBridge* Bridge);
	void SetEntityCamp(int32 EntityId, int32 Camp);
	void SetEntityCanDodge(int32 EntityId, bool bCanDodge);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BulletHitWorldEntityManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BulletHitWorldEntityManager")
	}
	static class UBulletHitWorldEntityManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBulletHitWorldEntityManager>();
	}
};
DUMPER7_ASSERTS_UBulletHitWorldEntityManager;

// Class KuroBullet.CustomBulletContext
// 0x0050 (0x0080 - 0x0030)
class UCustomBulletContext : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OwnerActor;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetSocket;                                      // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          TargetLocation;                                    // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             BulletDataTable;                                   // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Camp;                                              // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OwnerEntityId;                                     // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomBulletContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomBulletContext")
	}
	static class UCustomBulletContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomBulletContext>();
	}
};
DUMPER7_ASSERTS_UCustomBulletContext;

// Class KuroBullet.KSC_DA_Buff_KuroBullet
// 0x0010 (0x01C0 - 0x01B0)
class UKSC_DA_Buff_KuroBullet final : public UKSC_DA_Buff
{
public:
	int64                                         BulletId;                                          // 0x01A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DestroyBulletOnBuffEnd;                            // 0x01B0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B1[0xF];                                      // 0x01B1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_DA_Buff_KuroBullet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_DA_Buff_KuroBullet")
	}
	static class UKSC_DA_Buff_KuroBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_DA_Buff_KuroBullet>();
	}
};
DUMPER7_ASSERTS_UKSC_DA_Buff_KuroBullet;

// Class KuroBullet.KSC_DA_Buff_Period_KuroBullet
// 0x0070 (0x02D0 - 0x0260)
class UKSC_DA_Buff_Period_KuroBullet final : public UKSC_DA_Buff_Period
{
public:
	int64                                         BulletId;                                          // 0x0260(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_BulletTarget                             Target;                                            // 0x0268(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NoTargetNoBullet;                                  // 0x0269(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_BuffBulletInitTrans                      BulletInitTrans;                                   // 0x026A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26B[0x5];                                      // 0x026B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EKSC_Faction>                          IgnoreFaction;                                     // 0x0270(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         Range;                                             // 0x0280(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_284[0xC];                                      // 0x0284(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       SceneRelativeTrans;                                // 0x0290(0x0040)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_DA_Buff_Period_KuroBullet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_DA_Buff_Period_KuroBullet")
	}
	static class UKSC_DA_Buff_Period_KuroBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_DA_Buff_Period_KuroBullet>();
	}
};
DUMPER7_ASSERTS_UKSC_DA_Buff_Period_KuroBullet;

// Class KuroBullet.KSC_Buff_Period_KuroBullet
// 0x0058 (0x0100 - 0x00A8)
class alignas(0x10) UKSC_Buff_Period_KuroBullet final : public UKSC_Buff_Period
{
public:
	uint8                                         Pad_A8[0x48];                                      // 0x00A8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_DA_Buff_Period_KuroBullet*         DaBuffPeriodKuroBullet_;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Buff_Period_KuroBullet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Buff_Period_KuroBullet")
	}
	static class UKSC_Buff_Period_KuroBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Buff_Period_KuroBullet>();
	}
};
DUMPER7_ASSERTS_UKSC_Buff_Period_KuroBullet;

// Class KuroBullet.KSC_DA_Skill_KuroBullet
// 0x0030 (0x01B0 - 0x0180)
class UKSC_DA_Skill_KuroBullet final : public UKSC_DA_Skill_Anim
{
public:
	TArray<struct FKSC_SkillKuroBullet>           Bullets;                                           // 0x0180(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	EKSC_BulletTarget                             Target;                                            // 0x0190(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroBulletSkillDirection                     SkillDirection;                                    // 0x0191(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CastRangeMin;                                      // 0x0194(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int64>                                 AddBuffsToSelf;                                    // 0x0198(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_DA_Skill_KuroBullet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_DA_Skill_KuroBullet")
	}
	static class UKSC_DA_Skill_KuroBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_DA_Skill_KuroBullet>();
	}
};
DUMPER7_ASSERTS_UKSC_DA_Skill_KuroBullet;

// Class KuroBullet.KSC_Skill_KuroBullet
// 0x0028 (0x00D0 - 0x00A8)
class UKSC_Skill_KuroBullet final : public UKSC_Skill_Anim
{
public:
	class UKSC_DA_Skill_KuroBullet*               DaSkillKuroBullet_;                                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x20];                                      // 0x00B0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KSC_Skill_KuroBullet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KSC_Skill_KuroBullet")
	}
	static class UKSC_Skill_KuroBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKSC_Skill_KuroBullet>();
	}
};
DUMPER7_ASSERTS_UKSC_Skill_KuroBullet;

// Class KuroBullet.KscBulletManager
// 0x0018 (0x0048 - 0x0030)
class UKscBulletManager final : public UObject
{
public:
	class UKSC_World*                             KscWorld;                                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBulletWorld*                           BulletWorld;                                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UKscBulletManager* CreateInstance(class UObject* Outer_0);
	static void DestroyInstance();
	static class UKscBulletManager* GetInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KscBulletManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KscBulletManager")
	}
	static class UKscBulletManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKscBulletManager>();
	}
};
DUMPER7_ASSERTS_UKscBulletManager;

// Class KuroBullet.WorldEntityBulletContext
// 0x0018 (0x0098 - 0x0080)
class UWorldEntityBulletContext final : public UCustomBulletContext
{
public:
	struct FWorldEntityBulletParam                ExtraParam;                                        // 0x0080(0x0018)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WorldEntityBulletContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WorldEntityBulletContext")
	}
	static class UWorldEntityBulletContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldEntityBulletContext>();
	}
};
DUMPER7_ASSERTS_UWorldEntityBulletContext;

}

