#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroSceneModifier

#include "Basic.hpp"


namespace SDK::Params
{

// Function KuroSceneModifier.KuroSceneModifierSubsystem.ModifyMaterialsByDataLayer
// 0x0060 (0x0060 - 0x0000)
struct KuroSceneModifierSubsystem_ModifyMaterialsByDataLayer final
{
public:
	TSet<class FName>                             InDataLayers;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UKuroSceneMatModifyDataAsset*     InMatDataAsset;                                    // 0x0050(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisibleBeforeModify;                              // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KuroSceneModifierSubsystem_ModifyMaterialsByDataLayer;

// Function KuroSceneModifier.KuroSceneModifierSubsystem.ResetMaterialsByDataLayer
// 0x0050 (0x0050 - 0x0000)
struct KuroSceneModifierSubsystem_ResetMaterialsByDataLayer final
{
public:
	TSet<class FName>                             InDataLayers;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KuroSceneModifierSubsystem_ResetMaterialsByDataLayer;

}

