#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroNavMeshCookData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KuroNavMeshCookData.NavMeshCookDataSubsystem.D_MultiQueryNavBoundaryEdges
// 0x0018 (0x0018 - 0x0000)
struct NavMeshCookDataSubsystem_D_MultiQueryNavBoundaryEdges final
{
public:
	TArray<struct FBox>                           QueryBoundsArr;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NavMeshCookDataSubsystem_D_MultiQueryNavBoundaryEdges;

// Function KuroNavMeshCookData.NavMeshCookDataSubsystem.D_QueryNavBoundaryEdges
// 0x0038 (0x0038 - 0x0000)
struct NavMeshCookDataSubsystem_D_QueryNavBoundaryEdges final
{
public:
	struct FBox                                   QueryBounds;                                       // 0x0000(0x001C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVectorDouble>                  OutBoundaryEdgesDouble;                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NavMeshCookDataSubsystem_D_QueryNavBoundaryEdges;

}

