#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroSimpleCombat

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum KuroSimpleCombat.EKSC_AttrType
// NumValues: 0x006C
enum class EKSC_AttrType : uint8
{
	EAttributeType_None                      = 0,
	Lv                                       = 1,
	LifeMax                                  = 2,
	Life                                     = 3,
	Shield                                   = 4,
	Atk                                      = 7,
	Crit                                     = 8,
	CritDamage                               = 9,
	Def                                      = 10,
	AtkChange                                = 11,
	MaxLifeShieldChange                      = 12,
	BaseLife                                 = 13,
	CritChange                               = 14,
	DamageChange                             = 15,
	DamageReduce                             = 16,
	DamageLifeSteal                          = 17,
	HealBase                                 = 18,
	DamageReduceCollision                    = 19,
	DamageAbsorptionCount                    = 20,
	DamageChangePhys                         = 21,
	DamageChangeElement1                     = 22,
	DamageChangeElement2                     = 23,
	DamageChangeElement3                     = 24,
	DamageChangeElement4                     = 25,
	DamageChangeElement5                     = 26,
	DamageChangeElement6                     = 27,
	DamageResistancePhys                     = 28,
	DamageResistanceElement1                 = 29,
	DamageResistanceElement2                 = 30,
	DamageResistanceElement3                 = 31,
	DamageResistanceElement4                 = 32,
	DamageResistanceElement5                 = 33,
	DamageResistanceElement6                 = 34,
	HealChange                               = 35,
	HealedChange                             = 36,
	DamageReducePhys                         = 37,
	DamageReduceElement1                     = 38,
	DamageReduceElement2                     = 39,
	DamageReduceElement3                     = 40,
	DamageReduceElement4                     = 41,
	DamageReduceElement5                     = 42,
	DamageReduceElement6                     = 43,
	DamageAmplify1                           = 44,
	DamageAmplify2                           = 45,
	ShieldMax                                = 50,
	ShieldChange                             = 51,
	LifeChange                               = 52,
	DefChange                                = 53,
	AtkExtra                                 = 54,
	DefExtra                                 = 55,
	LifeExtra                                = 56,
	SpecialEnergy1                           = 70,
	SpecialEnergy1Max                        = 71,
	SpecialEnergy1RecoverSpeed               = 72,
	SpecialEnergy1ConsumeSpeed               = 73,
	SpecialEnergy1ChargeEfficiency           = 74,
	SpecialEnergy2                           = 75,
	SpecialEnergy2Max                        = 76,
	SpecialEnergy2RecoverSpeed               = 77,
	SpecialEnergy2ConsumeSpeed               = 78,
	SpecialEnergy2ChargeEfficiency           = 79,
	SpecialEnergy3                           = 80,
	SpecialEnergy3Max                        = 81,
	SpecialEnergy3RecoverSpeed               = 82,
	SpecialEnergy3ConsumeSpeed               = 83,
	SpecialEnergy3ChargeEfficiency           = 84,
	IgnoreDefRate                            = 99,
	IgnoreDamageResistancePhys               = 100,
	IgnoreDamageResistanceElement1           = 101,
	IgnoreDamageResistanceElement2           = 102,
	IgnoreDamageResistanceElement3           = 103,
	IgnoreDamageResistanceElement4           = 104,
	IgnoreDamageResistanceElement5           = 105,
	IgnoreDamageResistanceElement6           = 106,
	SkillCoolDown                            = 117,
	SkillCoolDownChange                      = 118,
	SkillCoolDownChangeMin                   = 119,
	MoveSpeed                                = 190,
	MoveSpeedAdd                             = 191,
	MoveSpeedReduce                          = 192,
	AddBuffDuration                          = 199,
	BuffDuration                             = 200,
	SpecialDamageChange1                     = 201,
	SpecialDamageChange2                     = 202,
	SpecialDamageChange3                     = 203,
	SpecialDamageChange4                     = 204,
	SpecialDamageChange5                     = 205,
	SpecialDamageChange6                     = 206,
	SpecialDamageChange7                     = 207,
	SpecialChange0                           = 210,
	SpecialChange1                           = 211,
	SpecialChange2                           = 212,
	SpecialChange3                           = 213,
	SpecialChange4                           = 214,
	SpecialChange5                           = 215,
	SpecialChange6                           = 216,
	SpecialChange7                           = 217,
	SpecialChange8                           = 218,
	SpecialChange9                           = 219,
	AttackSpeed                              = 220,
	AttackSpeedChange                        = 221,
	SpecialDamageReduce1                     = 230,
	SpecialDamageReduce2                     = 231,
	SpecialDamageReduce3                     = 232,
	SpecialDamageReduce4                     = 233,
	SpecialDamageReduce5                     = 234,
	AttributeType_Max                        = 255,
	EKSC_MAX                                 = 256,
};

// Enum KuroSimpleCombat.EKSC_WorldAttrType
// NumValues: 0x0009
enum class EKSC_WorldAttrType : uint8
{
	EAttributeType_None                      = 0,
	WorldKillZ                               = 1,
	Gold                                     = 2,
	Wave                                     = 3,
	WorldSpeed                               = 4,
	WorldSpeedChange                         = 5,
	BattleStage                              = 6,
	Combo                                    = 7,
	EKSC_MAX                                 = 8,
};

// Enum KuroSimpleCombat.EKSC_Faction
// NumValues: 0x000A
enum class EKSC_Faction : uint8
{
	Faction0                                 = 0,
	Faction1                                 = 1,
	Faction2                                 = 2,
	Faction3                                 = 4,
	Faction4                                 = 8,
	Faction5                                 = 16,
	Faction6                                 = 32,
	Faction7                                 = 64,
	Faction8                                 = 128,
	EKSC_MAX                                 = 129,
};

// Enum KuroSimpleCombat.EKSC_SkillAutoCast
// NumValues: 0x0004
enum class EKSC_SkillAutoCast : uint8
{
	Default                                  = 0,
	AutoCast                                 = 1,
	ManualCast                               = 2,
	EKSC_MAX                                 = 3,
};

// Enum KuroSimpleCombat.EKSC_Skill_State
// NumValues: 0x0008
enum class EKSC_Skill_State : uint8
{
	Ready                                    = 0,
	BeginSkill                               = 1,
	PreCast                                  = 2,
	BeginCast                                = 3,
	EndCast                                  = 4,
	EndSkill                                 = 5,
	CoolDown                                 = 6,
	EKSC_Skill_MAX                           = 7,
};

// Enum KuroSimpleCombat.EKSC_Buff_DurationType
// NumValues: 0x0004
enum class EKSC_Buff_DurationType : uint8
{
	Instant                                  = 0,
	Forever                                  = 1,
	Duration                                 = 2,
	EKSC_Buff_MAX                            = 3,
};

// Enum KuroSimpleCombat.EKSC_Buff_Aura_EnableType
// NumValues: 0x0004
enum class EKSC_Buff_Aura_EnableType : uint8
{
	None                                     = 0,
	SelfWithTag                              = 1,
	TargetWithTag                            = 2,
	EKSC_Buff_Aura_MAX                       = 3,
};

// Enum KuroSimpleCombat.EKSC_Buff_Aura_TargetType
// NumValues: 0x0005
enum class EKSC_Buff_Aura_TargetType : uint8
{
	Friend                                   = 0,
	FriendWithoutSelf                        = 1,
	Enemy                                    = 2,
	Select                                   = 3,
	EKSC_Buff_Aura_MAX                       = 4,
};

// Enum KuroSimpleCombat.EKSC_Buff_ListenEvent_Response
// NumValues: 0x000A
enum class EKSC_Buff_ListenEvent_Response : uint8
{
	AddTag                                   = 0,
	RemoveTag                                = 1,
	ClearTag                                 = 2,
	AddBuff                                  = 3,
	AdditionalAttack                         = 4,
	RemoveBuff                               = 5,
	AddMultiBuff                             = 6,
	SpawnEntity                              = 7,
	TryStartSkill                            = 8,
	EKSC_Buff_ListenEvent_MAX                = 9,
};

// Enum KuroSimpleCombat.EKSC_Buff_ListenEvent_ListenType
// NumValues: 0x0013
enum class EKSC_Buff_ListenEvent_ListenType : uint8
{
	OnDead                                   = 0,
	OnHitBefore                              = 1,
	OnHitAfter                               = 2,
	OnCastBefore                             = 3,
	OnCastAfter                              = 4,
	OnTagCount                               = 5,
	OnLifeChangeDown                         = 6,
	OnCritAfter                              = 7,
	OnTagCountAdd                            = 8,
	OnTagCountRemove                         = 9,
	OnBulletCreate                           = 10,
	OnKill                                   = 11,
	OnAttrChange                             = 12,
	DelayTime                                = 13,
	OnTagChangeAdd                           = 14,
	OnTagChangeRemove                        = 15,
	OnDodge                                  = 16,
	OnLifeChangeUp                           = 17,
	EKSC_Buff_ListenEvent_MAX                = 18,
};

// Enum KuroSimpleCombat.EKSC_Buff_ModifyAttr_BeforeAfterHit_Target
// NumValues: 0x0003
enum class EKSC_Buff_ModifyAttr_BeforeAfterHit_Target : uint8
{
	Source                                   = 0,
	Target                                   = 1,
	EKSC_Buff_ModifyAttr_BeforeAfterHit_MAX  = 2,
};

// Enum KuroSimpleCombat.EKSC_Buff_ModifyAttr_BeforeAfterHit_CheckType
// NumValues: 0x0004
enum class EKSC_Buff_ModifyAttr_BeforeAfterHit_CheckType : uint8
{
	Tag                                      = 0,
	TagCount                                 = 1,
	TagChildCount                            = 2,
	EKSC_Buff_ModifyAttr_BeforeAfterHit_MAX  = 3,
};

// Enum KuroSimpleCombat.EKSC_Buff_StackTimeType
// NumValues: 0x0004
enum class EKSC_Buff_StackTimeType : uint8
{
	ShareTime                                = 0,
	OneSourceOneStack                        = 1,
	MultiStackTime                           = 2,
	EKSC_Buff_MAX                            = 3,
};

// Enum KuroSimpleCombat.EKSC_Buff_StopAction_ActionType
// NumValues: 0x0004
enum class EKSC_Buff_StopAction_ActionType : uint8
{
	StopMove                                 = 0,
	StopAttack                               = 1,
	MoveConfused                             = 2,
	EKSC_Buff_StopAction_MAX                 = 3,
};

// Enum KuroSimpleCombat.EKSC_SetShapeType
// NumValues: 0x0003
enum class EKSC_SetShapeType : uint8
{
	FixValue                                 = 0,
	Scale                                    = 1,
	EKSC_MAX                                 = 2,
};

// Enum KuroSimpleCombat.EKSC_PeriodBuffTagEffect
// NumValues: 0x0003
enum class EKSC_PeriodBuffTagEffect : uint8
{
	AttackSpeed                              = 0,
	CD                                       = 1,
	EKSC_MAX                                 = 2,
};

// Enum KuroSimpleCombat.EKSC_ComparisonSymbols
// NumValues: 0x0008
enum class EKSC_ComparisonSymbols : uint8
{
	Less                                     = 0,
	LessEqual                                = 1,
	Greater                                  = 2,
	GreaterEqual                             = 3,
	Equal                                    = 4,
	Increase                                 = 5,
	Decrease                                 = 6,
	EKSC_MAX                                 = 7,
};

// Enum KuroSimpleCombat.EKSC_EntityType
// NumValues: 0x0007
enum class EKSC_EntityType : uint8
{
	Default                                  = 0,
	Player                                   = 1,
	Monster                                  = 2,
	EliteMonster                             = 3,
	Boss                                     = 4,
	SceneItem                                = 5,
	EKSC_MAX                                 = 6,
};

// Enum KuroSimpleCombat.EKSC_BattleStage
// NumValues: 0x0004
enum class EKSC_BattleStage : uint8
{
	Default                                  = 0,
	Ready                                    = 1,
	TimesUp                                  = 2,
	EKSC_MAX                                 = 3,
};

// Enum KuroSimpleCombat.EKSC_HeadUiType
// NumValues: 0x0008
enum class EKSC_HeadUiType : uint8
{
	Default                                  = 0,
	Player                                   = 1,
	Boss                                     = 2,
	BuffGate                                 = 3,
	TopBoss                                  = 4,
	Digital                                  = 5,
	Marble                                   = 6,
	EKSC_MAX                                 = 7,
};

// Enum KuroSimpleCombat.EKSC_LockTarget
// NumValues: 0x0003
enum class EKSC_LockTarget : uint8
{
	Random                                   = 0,
	Nearest                                  = 1,
	EKSC_MAX                                 = 2,
};

// Enum KuroSimpleCombat.EKSC_ManualSkillAttack
// NumValues: 0x0003
enum class EKSC_ManualSkillAttack : uint8
{
	Normal                                   = 0,
	Explode                                  = 1,
	EKSC_MAX                                 = 2,
};

// Enum KuroSimpleCombat.EKSC_Event_HitTarget
// NumValues: 0x0003
enum class EKSC_Event_HitTarget : uint8
{
	Source                                   = 0,
	Target                                   = 1,
	EKSC_Event_MAX                           = 2,
};

// Enum KuroSimpleCombat.EKSC_OperateType
// NumValues: 0x0005
enum class EKSC_OperateType : uint8
{
	OnPress                                  = 0,
	OnRelease                                = 1,
	OnHold                                   = 2,
	AutoCast                                 = 3,
	EKSC_MAX                                 = 4,
};

// Enum KuroSimpleCombat.EKSC_AdditionalAttackSourceTarget
// NumValues: 0x0005
enum class EKSC_AdditionalAttackSourceTarget : uint8
{
	SourceFriend                             = 0,
	SourceEnemy                              = 1,
	TargetFriend                             = 2,
	TargetEnemy                              = 3,
	EKSC_MAX                                 = 4,
};

// Enum KuroSimpleCombat.EKSC_AdditionalAttackSource
// NumValues: 0x0003
enum class EKSC_AdditionalAttackSource : uint8
{
	Source                                   = 0,
	Target                                   = 1,
	EKSC_MAX                                 = 2,
};

// Enum KuroSimpleCombat.EKSC_ShapeType
// NumValues: 0x0003
enum class EKSC_ShapeType : uint8
{
	Sphere                                   = 0,
	Box                                      = 1,
	EKSC_MAX                                 = 2,
};

// Enum KuroSimpleCombat.EKSC_FXUpdateType
// NumValues: 0x0004
enum class EKSC_FXUpdateType : uint8
{
	Line                                     = 0,
	Target                                   = 1,
	Pierce                                   = 2,
	EKSC_MAX                                 = 3,
};

// Enum KuroSimpleCombat.EKSC_FXBindingType
// NumValues: 0x0004
enum class EKSC_FXBindingType : uint8
{
	Caster                                   = 0,
	Target                                   = 1,
	Value                                    = 2,
	EKSC_MAX                                 = 3,
};

// Enum KuroSimpleCombat.EKSC_FXValueType
// NumValues: 0x0003
enum class EKSC_FXValueType : uint8
{
	Float                                    = 0,
	Vector3                                  = 1,
	EKSC_MAX                                 = 2,
};

// Enum KuroSimpleCombat.EKSC_FXType
// NumValues: 0x0003
enum class EKSC_FXType : uint8
{
	Burst                                    = 0,
	continuous                               = 1,
	EKSC_MAX                                 = 2,
};

// Enum KuroSimpleCombat.EKSC_CalculateType
// NumValues: 0x0009
enum class EKSC_CalculateType : uint8
{
	Hurt                                     = 0,
	Heal                                     = 1,
	PercentageHurt                           = 2,
	MotorFightHurt                           = 3,
	MotorCollisionHurt                       = 4,
	MotorFightHeal                           = 5,
	HurtMultiRelated                         = 6,
	Shield                                   = 7,
	EKSC_MAX                                 = 8,
};

// Enum KuroSimpleCombat.EKSC_Element
// NumValues: 0x000E
enum class EKSC_Element : uint8
{
	Physical                                 = 0,
	Ice                                      = 1,
	Fire                                     = 2,
	Thunder                                  = 3,
	Wind                                     = 4,
	Light                                    = 5,
	Dark                                     = 6,
	SpecialElement1                          = 7,
	SpecialElement2                          = 8,
	SpecialElement3                          = 9,
	SpecialElement4                          = 10,
	SpecialElement5                          = 11,
	ElementTypeMax                           = 12,
	EKSC_MAX                                 = 13,
};

// Enum KuroSimpleCombat.EKSC_TargetFaction
// NumValues: 0x0004
enum class EKSC_TargetFaction : uint8
{
	Friend                                   = 0,
	Enemy                                    = 1,
	All                                      = 2,
	EKSC_MAX                                 = 3,
};

// Enum KuroSimpleCombat.EKSC_FastMoveGroup
// NumValues: 0x000A
enum class EKSC_FastMoveGroup : uint8
{
	SearchType0                              = 0,
	SearchType1                              = 1,
	SearchType2                              = 2,
	SearchType3                              = 3,
	SearchType4                              = 4,
	SearchType5                              = 5,
	SearchType6                              = 6,
	SearchType7                              = 7,
	SearchType8                              = 8,
	EKSC_MAX                                 = 9,
};

// Enum KuroSimpleCombat.EKSC_SearchType
// NumValues: 0x000A
enum class EKSC_SearchType : uint8
{
	SearchType0                              = 0,
	SearchType1                              = 1,
	SearchType2                              = 2,
	SearchType3                              = 4,
	SearchType4                              = 8,
	SearchType5                              = 16,
	SearchType6                              = 32,
	SearchType7                              = 64,
	SearchType8                              = 128,
	EKSC_MAX                                 = 129,
};

// Enum KuroSimpleCombat.EKSC_SkillCastMode
// NumValues: 0x0003
enum class EKSC_SkillCastMode : uint8
{
	Default                                  = 0,
	Single                                   = 1,
	EKSC_MAX                                 = 2,
};

// Enum KuroSimpleCombat.EKSC_ListenCollisionEvent_ResponseTarget
// NumValues: 0x0004
enum class EKSC_ListenCollisionEvent_ResponseTarget : uint8
{
	CollisionTarget                          = 0,
	CurrentPlayer                            = 1,
	TeamPlayer                               = 2,
	EKSC_ListenCollisionEvent_MAX            = 3,
};

// Enum KuroSimpleCombat.EKSC_ListenCollisionEvent_Response
// NumValues: 0x0003
enum class EKSC_ListenCollisionEvent_Response : uint8
{
	AddBuff                                  = 0,
	CreateBullet                             = 1,
	EKSC_ListenCollisionEvent_MAX            = 2,
};

// Enum KuroSimpleCombat.EKSC_ListenCollisionEvent_CollisionType
// NumValues: 0x0003
enum class EKSC_ListenCollisionEvent_CollisionType : uint8
{
	Enemy                                    = 0,
	MoveRangeLimit                           = 1,
	EKSC_ListenCollisionEvent_MAX            = 2,
};

// Enum KuroSimpleCombat.EKSC_ListenCollisionEvent_ListenType
// NumValues: 0x0002
enum class EKSC_ListenCollisionEvent_ListenType : uint8
{
	TeamCollisions                           = 0,
	EKSC_ListenCollisionEvent_MAX            = 1,
};

// Enum KuroSimpleCombat.EKSC_Shape2D_CustomMovementMode
// NumValues: 0x0003
enum class EKSC_Shape2D_CustomMovementMode : uint8
{
	BaseOnDistance                           = 1,
	BaseOnSpeed                              = 2,
	EKSC_Shape2D_MAX                         = 3,
};

// Enum KuroSimpleCombat.EKSC_Shape2D_SelectTarget
// NumValues: 0x0003
enum class EKSC_Shape2D_SelectTarget : uint8
{
	Self                                     = 1,
	SearchTarget                             = 2,
	EKSC_Shape2D_MAX                         = 3,
};

// Enum KuroSimpleCombat.EKSC_SpineAnimNotifyType
// NumValues: 0x0011
enum class EKSC_SpineAnimNotifyType : uint8
{
	AddTag                                   = 0,
	RemoveTag                                = 1,
	ClearTag                                 = 2,
	AddBuff                                  = 3,
	RemoveBuff                               = 4,
	RemoveBuffStacks                         = 5,
	CreateBullet                             = 6,
	PlayEffect                               = 7,
	SearchTarget                             = 8,
	ApplyMovement                            = 9,
	Summon                                   = 10,
	SetSpeed                                 = 11,
	Charge                                   = 12,
	MoveRangeLimit                           = 13,
	SetPosition                              = 14,
	ClearShield                              = 15,
	EKSC_MAX                                 = 16,
};

// Enum KuroSimpleCombat.EKSC_Shape2D_SpecialAnimState
// NumValues: 0x0006
enum class EKSC_Shape2D_SpecialAnimState : uint8
{
	Empty                                    = 0,
	BeHit                                    = 1,
	Break                                    = 2,
	Death                                    = 3,
	Revive                                   = 4,
	EKSC_Shape2D_MAX                         = 5,
};

// Enum KuroSimpleCombat.EKSC_Shape2D_BaseAnimState
// NumValues: 0x0005
enum class EKSC_Shape2D_BaseAnimState : uint8
{
	Idle                                     = 0,
	Rise                                     = 2,
	Fall                                     = 3,
	Victory                                  = 4,
	EKSC_Shape2D_MAX                         = 5,
};

// Enum KuroSimpleCombat.EKSC_ShapeBarSide
// NumValues: 0x0003
enum class EKSC_ShapeBarSide : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	EKSC_MAX                                 = 2,
};

// Enum KuroSimpleCombat.EKSC_ShapeCompType
// NumValues: 0x0004
enum class EKSC_ShapeCompType : uint8
{
	None                                     = 0,
	Circle                                   = 1,
	Box                                      = 2,
	EKSC_MAX                                 = 3,
};

// Enum KuroSimpleCombat.EKSC_ShapeMaterial_BuffTarget
// NumValues: 0x0003
enum class EKSC_ShapeMaterial_BuffTarget : uint8
{
	CurrentPlayer                            = 0,
	TeamPlayer                               = 1,
	EKSC_ShapeMaterial_MAX                   = 2,
};

// Enum KuroSimpleCombat.EKSC_ShapeMaterial_EffectTarget
// NumValues: 0x0004
enum class EKSC_ShapeMaterial_EffectTarget : uint8
{
	PlayOnOwner                              = 0,
	PlayOnTarget                             = 1,
	PlayOnHitPoint                           = 2,
	EKSC_ShapeMaterial_MAX                   = 3,
};

// Enum KuroSimpleCombat.EKSC_ShapeMaterial_GateDirection
// NumValues: 0x0003
enum class EKSC_ShapeMaterial_GateDirection : uint8
{
	Forward                                  = 0,
	Reverse                                  = 1,
	EKSC_ShapeMaterial_MAX                   = 2,
};

// Enum KuroSimpleCombat.EKSC_ShapeMaterial_TriggerType
// NumValues: 0x0007
enum class EKSC_ShapeMaterial_TriggerType : uint8
{
	None                                     = 0,
	OneWayGate                               = 1,
	DirectionalBounce                        = 2,
	NoDirectionalBounce                      = 3,
	Portal                                   = 4,
	Trap                                     = 5,
	EKSC_ShapeMaterial_MAX                   = 6,
};

// Enum KuroSimpleCombat.EKSC_GPUNPCAnimState
// NumValues: 0x000E
enum class EKSC_GPUNPCAnimState : uint8
{
	Stand                                    = 0,
	Run                                      = 1,
	Dead                                     = 2,
	Escape                                   = 3,
	PushBegin                                = 4,
	PushLoop                                 = 5,
	PushEnd                                  = 6,
	PullBegin                                = 7,
	PullLoop                                 = 8,
	PullEnd                                  = 9,
	DeadInWater                              = 10,
	Skill1                                   = 11,
	Skill2                                   = 12,
	EKSC_MAX                                 = 13,
};

// Enum KuroSimpleCombat.EKSC_EntityTowerState
// NumValues: 0x0004
enum class EKSC_EntityTowerState : uint8
{
	Normal                                   = 0,
	CaskSkill                                = 1,
	CoolDown                                 = 2,
	EKSC_MAX                                 = 3,
};

// Enum KuroSimpleCombat.EKSC_MoveMode
// NumValues: 0x0005
enum class EKSC_MoveMode : uint8
{
	KSC_MOVE_None                            = 0,
	KSC_MOVE_Walking                         = 1,
	KSC_MOVE_NavWalking                      = 2,
	KSC_MOVE_Flying                          = 3,
	KSC_MOVE_MAX                             = 4,
};

// Enum KuroSimpleCombat.EKSC_ShapeCollisionObjType
// NumValues: 0x0006
enum class EKSC_ShapeCollisionObjType : uint8
{
	None                                     = 0,
	WorldBound                               = 1,
	ShapeEntity                              = 2,
	ShapeMachine                             = 4,
	ShapeBar                                 = 8,
	EKSC_MAX                                 = 9,
};

// Enum KuroSimpleCombat.EKSC_Shape2DType
// NumValues: 0x0004
enum class EKSC_Shape2DType : uint8
{
	None                                     = 0,
	Circle                                   = 1,
	Box                                      = 2,
	EKSC_MAX                                 = 3,
};

// Enum KuroSimpleCombat.EKSC_SkillDirection
// NumValues: 0x0003
enum class EKSC_SkillDirection : uint8
{
	Target                                   = 0,
	Self                                     = 2,
	EKSC_MAX                                 = 3,
};

// Enum KuroSimpleCombat.EKSC_SkillTarget
// NumValues: 0x0004
enum class EKSC_SkillTarget : uint8
{
	None                                     = 0,
	NearestEnemy                             = 1,
	FieldOfView                              = 2,
	EKSC_MAX                                 = 3,
};

// Enum KuroSimpleCombat.EKSC_HeadHpContextType
// NumValues: 0x0004
enum class EKSC_HeadHpContextType : uint8
{
	Add                                      = 0,
	Update                                   = 1,
	Remove                                   = 2,
	EKSC_MAX                                 = 3,
};

// ScriptStruct KuroSimpleCombat.KSC_RemoveContext
// 0x0050 (0x0050 - 0x0000)
struct FKSC_RemoveContext final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EntityTypeName;                                    // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReasonName;                                        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          Location;                                          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPreview;                                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EntityIdKillBy;                                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EntityTypeKillBy;                                  // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKSC_RemoveContext;

// ScriptStruct KuroSimpleCombat.KSC_AttrBoundLocker
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FKSC_AttrBoundLocker final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKSC_AttrBoundLocker;

// ScriptStruct KuroSimpleCombat.KSC_BulletTargetContext
// 0x0040 (0x0040 - 0x0000)
struct FKSC_BulletTargetContext final
{
public:
	int32                                         TargetEntityId;                                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_SkillComp*                         SkillComp;                                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             TargetTrans;                                       // 0x0010(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_BulletTargetContext;

// ScriptStruct KuroSimpleCombat.KSC_LandFireContext
// 0x0060 (0x0060 - 0x0000)
struct FKSC_LandFireContext final
{
public:
	bool                                          ClearCell;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpawnerEntityId;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EffectRange;                                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FireNum;                                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EKSC_AttrType, int32>                    Params;                                            // 0x0010(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_LandFireContext;

// ScriptStruct KuroSimpleCombat.KSC_Enemy_Delay_KuroMatFX
// 0x0010 (0x0010 - 0x0000)
struct FKSC_Enemy_Delay_KuroMatFX final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroMaterialControllerDataAsset*       KuroMatFX;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_Enemy_Delay_KuroMatFX;

// ScriptStruct KuroSimpleCombat.KSC_SpawnEntity
// 0x0060 (0x0060 - 0x0000)
struct FKSC_SpawnEntity final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       EntityTrans;                                       // 0x0010(0x0040)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsUseAbsoluteTrans;                                // 0x0050(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKSC_SpawnEntity;

// ScriptStruct KuroSimpleCombat.KSC_ListenAttrEventBuff
// 0x0010 (0x0010 - 0x0000)
struct FKSC_ListenAttrEventBuff final
{
public:
	EKSC_AttrType                                 AttrId;                                            // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_ComparisonSymbols                        Comparison;                                        // 0x0001(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AttrValue;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ThresholdValue;                                    // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAccumulate;                                       // 0x000C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKSC_ListenAttrEventBuff;

// ScriptStruct KuroSimpleCombat.KSC_KuroFX
// 0x0050 (0x0050 - 0x0000)
struct FKSC_KuroFX final
{
public:
	class UEffectModelBase*                       FX;                                                // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FX_Offset;                                         // 0x0010(0x0030)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   Socket;                                            // 0x0040(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FX_AttackLocation;                                 // 0x004C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FX_AttackRotation;                                 // 0x004D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FX_AttackScale;                                    // 0x004E(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKSC_KuroFX;

// ScriptStruct KuroSimpleCombat.KSC_DamageTypeFilter
// 0x0030 (0x0030 - 0x0000)
struct FKSC_DamageTypeFilter final
{
public:
	EKSC_CalculateType                            CalculateType;                                     // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EKSC_CalculateType>                    CalculateTypes;                                    // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          IsNot;                                             // 0x0018(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EKSC_Element>                          ElementTypes;                                      // 0x0020(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_DamageTypeFilter;

// ScriptStruct KuroSimpleCombat.KSC_TagFilter
// 0x0028 (0x0028 - 0x0000)
struct FKSC_TagFilter final
{
public:
	bool                                          IsNot;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CompareHasAll;                                     // 0x0001(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CompareTags;                                       // 0x0008(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_TagFilter;

// ScriptStruct KuroSimpleCombat.KSC_Range
// 0x0050 (0x0050 - 0x0000)
struct FKSC_Range final
{
public:
	EKSC_ShapeType                                RangeShapeType;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OffsetTrans;                                       // 0x0010(0x0030)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                HalfExtent;                                        // 0x0040(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x004C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_Range;

// ScriptStruct KuroSimpleCombat.KSC_FXParam
// 0x0020 (0x0020 - 0x0000)
struct FKSC_FXParam final
{
public:
	class FName                                   ParamName;                                         // 0x0000(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_FXValueType                              FXValueType;                                       // 0x000C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_FXBindingType                            FXBindingType;                                     // 0x000D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BindingWorldPos;                                   // 0x000E(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VectorValue;                                       // 0x0010(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_FXParam;

// ScriptStruct KuroSimpleCombat.KSC_DiffTransferAddAttr
// 0x0014 (0x0014 - 0x0000)
struct FKSC_DiffTransferAddAttr final
{
public:
	EKSC_AttrType                                 FromAttr;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FromAttrAmplify;                                   // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_AttrType                                 ThresholdAttr;                                     // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThresholdAttrAmplify;                              // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BaseValue;                                         // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_DiffTransferAddAttr;

// ScriptStruct KuroSimpleCombat.KSC_TransferAddAttr
// 0x000C (0x000C - 0x0000)
struct FKSC_TransferAddAttr final
{
public:
	EKSC_AttrType                                 FromAttr;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Threshold;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Amplify;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_TransferAddAttr;

// ScriptStruct KuroSimpleCombat.KSC_ModifyAttrFromOthers
// 0x0008 (0x0008 - 0x0000)
struct FKSC_ModifyAttrFromOthers final
{
public:
	EKSC_AttrType                                 ToAttrId;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_AttrType                                 FromAttrId;                                        // 0x0001(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Amplify;                                           // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_ModifyAttrFromOthers;

// ScriptStruct KuroSimpleCombat.KSC_SpineAnimNotify
// 0x0140 (0x0140 - 0x0000)
struct FKSC_SpineAnimNotify final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUseFullTime;                                     // 0x0004(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsTriggerOnce;                                     // 0x0005(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUseCurrentPlayer;                                // 0x0006(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_SpineAnimNotifyType                      Type;                                              // 0x0007(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKSC_DA_Buff*                           Buff;                                              // 0x0018(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BuffStackNum;                                      // 0x0020(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKSC_Shape2D_SelectTarget                     SelectTarget;                                      // 0x0024(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BulletID;                                          // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUseBulletDefaultRotation;                        // 0x002C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               BulletDefaultRotation;                             // 0x0030(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffectModelBase*                       Effect;                                            // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             EffectOffset;                                      // 0x0050(0x0030)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SearchRange;                                       // 0x0080(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EKSC_EntityType, int32>                  SearchPriorityMap;                                 // 0x0088(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	EKSC_Shape2D_CustomMovementMode               MovementMode;                                      // 0x00D8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MovementDuration;                                  // 0x00DC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementDistance;                                  // 0x00E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementEndDistance;                               // 0x00E4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            MovementCurve;                                     // 0x00E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MovementIsTrace;                                   // 0x00F0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MovementIsKeep;                                    // 0x00F1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MovementIsKeepEnd;                                 // 0x00F2(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F3[0x1];                                       // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MoveRangeLimitRadius;                              // 0x00F4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveRangeLimitReflectSpeed;                        // 0x00F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveRangeLimitDuration;                            // 0x00FC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKSC_SpawnEntity>               SummonEntities;                                    // 0x0100(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         SpeedValue;                                        // 0x0110(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUseTargetDirection;                              // 0x0114(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SpeedDirection;                                    // 0x0118(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChargeDuration;                                    // 0x0120(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0124(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionLerpTime;                                  // 0x0130(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            PositionLerpCurve;                                 // 0x0138(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_SpineAnimNotify;

// ScriptStruct KuroSimpleCombat.KSC_SpineAnimItem
// 0x0020 (0x0020 - 0x0000)
struct FKSC_SpineAnimItem final
{
public:
	class FString                                 AnimName;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x4];                                       // 0x0010(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AnimTag;                                           // 0x0014(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_SpineAnimItem;

// ScriptStruct KuroSimpleCombat.KSC_DA_Shape2D_WorldBounds_Item
// 0x0030 (0x0030 - 0x0000)
struct FKSC_DA_Shape2D_WorldBounds_Item final
{
public:
	struct FVector2D                              StartPoint;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EndPoint;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtraWidth;                                        // 0x0014(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialID;                                        // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugText;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_DA_Shape2D_WorldBounds_Item;

// ScriptStruct KuroSimpleCombat.KSCDamage
