#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroBullet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum KuroBullet.EBulletHitWorldEntityOperation
// NumValues: 0x0004
enum class EBulletHitWorldEntityOperation : uint8
{
	AddBuff                                  = 0,
	Hit                                      = 1,
	DodgeBullet                              = 2,
	EBulletHitWorldEntityOperation_MAX       = 3,
};

// Enum KuroBullet.EKSC_BuffBulletInitTrans
// NumValues: 0x0003
enum class EKSC_BuffBulletInitTrans : uint8
{
	None                                     = 0,
	World                                    = 1,
	EKSC_MAX                                 = 2,
};

// Enum KuroBullet.EKuroBulletSkillDirection
// NumValues: 0x0003
enum class EKuroBulletSkillDirection : uint8
{
	SkillTarget                              = 0,
	Self                                     = 2,
	EKuroBulletSkillDirection_MAX            = 3,
};

// Enum KuroBullet.EKSC_BulletTarget
// NumValues: 0x0004
enum class EKSC_BulletTarget : uint8
{
	None                                     = 0,
	NearestEnemy                             = 1,
	FieldOfView                              = 2,
	EKSC_MAX                                 = 3,
};

// ScriptStruct KuroBullet.WorldEntityBulletParam
// 0x0018 (0x0018 - 0x0000)
struct FWorldEntityBulletParam final
{
public:
	int64                                         MessageId;                                         // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SkillId;                                           // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         SkillMessageId;                                    // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWorldEntityBulletParam;

// ScriptStruct KuroBullet.BulletHitWorldEntityOperation
// 0x0058 (0x0058 - 0x0000)
struct FBulletHitWorldEntityOperation final
{
public:
	EBulletHitWorldEntityOperation                OperationType;                                     // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorldEntityBulletParam                ExtraParam;                                        // 0x0008(0x0018)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         CasterEntityId;                                    // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EntityId;                                          // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         LongParam1;                                        // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVectorDouble                          Location;                                          // 0x0030(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0048(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBulletHitWorldEntityOperation;

// ScriptStruct KuroBullet.KSC_SkillKuroBullet
// 0x0010 (0x0010 - 0x0000)
struct FKSC_SkillKuroBullet final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         BulletId;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKSC_SkillKuroBullet;

}

