#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroComponent

#include "Basic.hpp"


namespace SDK
{

// Enum KuroComponent.EAnimPerfTestSkelMeshLifeCycle
// NumValues: 0x0003
enum class EAnimPerfTestSkelMeshLifeCycle : uint8
{
	Transient                                = 0,
	KeepInLevel                              = 1,
	EAnimPerfTestSkelMeshLifeCycle_MAX       = 2,
};

// Enum KuroComponent.EAnimPerfTestBornFrom
// NumValues: 0x0004
enum class EAnimPerfTestBornFrom : uint8
{
	PlayerStart                              = 0,
	Pawn                                     = 1,
	Owner                                    = 2,
	EAnimPerfTestBornFrom_MAX                = 3,
};

// Enum KuroComponent.EAnimPerfTestAnimSeqFilterMethod
// NumValues: 0x0006
enum class EAnimPerfTestAnimSeqFilterMethod : uint8
{
	Specific                                 = 0,
	Contains                                 = 1,
	StartsWith                               = 2,
	EndsWith                                 = 3,
	EqualsTo                                 = 4,
	EAnimPerfTestAnimSeqFilterMethod_MAX     = 5,
};

// Enum KuroComponent.EAnimPerfTestRandomGenActorGroup
// NumValues: 0x0003
enum class EAnimPerfTestRandomGenActorGroup : uint8
{
	SpecificSkeletalMeshes                   = 0,
	AllSkeletalMeshes                        = 1,
	EAnimPerfTestRandomGenActorGroup_MAX     = 2,
};

// Enum KuroComponent.EAnimPerfTestActorsGenMethod
// NumValues: 0x0004
enum class EAnimPerfTestActorsGenMethod : uint8
{
	GenFromTemplate                          = 0,
	GenRandomly                              = 1,
	GenAll                                   = 2,
	EAnimPerfTestActorsGenMethod_MAX         = 3,
};

// Enum KuroComponent.EShapeType
// NumValues: 0x0005
enum class EShapeType : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	Sector                                   = 2,
	Cylinder                                 = 3,
	EShapeType_MAX                           = 4,
};

// Enum KuroComponent.EKuroSceneItemStopRotateMethod
// NumValues: 0x0004
enum class EKuroSceneItemStopRotateMethod : uint8
{
	KeepCurrent                              = 0,
	JumpToStart                              = 1,
	JumpToEnd                                = 2,
	EKuroSceneItemStopRotateMethod_MAX       = 3,
};

// Enum KuroComponent.ESplineMoveSubType
// NumValues: 0x0003
enum class ESplineMoveSubType : uint8
{
	SplineMoveWithStaticTimeDisCurve         = 0,
	SplineMoveWithDynamicSpeed               = 1,
	ESplineMoveSubType_MAX                   = 2,
};

// Enum KuroComponent.ESplineRunState
// NumValues: 0x0004
enum class ESplineRunState : uint8
{
	None                                     = 0,
	Trip                                     = 1,
	ReturnTrip                               = 2,
	ESplineRunState_MAX                      = 3,
};

// Enum KuroComponent.ESimpleRunState
// NumValues: 0x0004
enum class ESimpleRunState : uint8
{
	Stop                                     = 0,
	Run                                      = 1,
	Wait                                     = 2,
	ESimpleRunState_MAX                      = 3,
};

// ScriptStruct KuroComponent.GpuNpcTransition
// 0x0050 (0x0050 - 0x0000)
struct FGpuNpcTransition final
{
public:
	TMap<int32, int32>                            Transitions;                                       // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGpuNpcTransition;

// ScriptStruct KuroComponent.GpuNpcConfig
// 0x0058 (0x0058 - 0x0000)
struct FGpuNpcConfig final
{
public:
	int32                                         MaxState;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAngle;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 AnimEndTimes;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 StateAnimMap;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGpuNpcTransition>              TransitionStateMaps;                               // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGpuNpcConfig;

// ScriptStruct KuroComponent.RegionDetectInfo
// 0x00B0 (0x00B0 - 0x0000)
struct FRegionDetectInfo final
{
public:
	TMap<class FString, class UKuroRegionEventBinder*> RegionEventMap;                               // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class AActor>>          EventTargets;                                      // 0x0050(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x50];                                      // 0x0060(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRegionDetectInfo;

// ScriptStruct KuroComponent.RotateStepInfo
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x10) FRotateStepInfo final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            RotateCurve;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRotateStepInfo;

// ScriptStruct KuroComponent.TargetRotationData
// 0x0038 (0x0038 - 0x0000)
struct FTargetRotationData final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRotateStepInfo>                StepInfos;                                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x18];                                      // 0x0020(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTargetRotationData;

// ScriptStruct KuroComponent.SplineMoveStaticTimeDisData
// 0x0020 (0x0020 - 0x0000)
struct FSplineMoveStaticTimeDisData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            TimeDisCurve;                                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSplineMoveStaticTimeDisData;

// ScriptStruct KuroComponent.SplineMoveDynamicSpeedData
// 0x0010 (0x0010 - 0x0000)
struct FSplineMoveDynamicSpeedData final
{
public:
	float                                         TargetSpeed;                                       // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentSpeed;                                      // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDis;                                            // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSplineMoveDynamicSpeedData;

// ScriptStruct KuroComponent.SplineMoveData
// 0x0068 (0x0068 - 0x0000)
struct FSplineMoveData final
{
public:
	class USplineComponent*                       Spline;                                            // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x30];                                       // 0x0008(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSplineMoveStaticTimeDisData           StaticTimeDisData;                                 // 0x0038(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSplineMoveDynamicSpeedData            DynamicSpeedData;                                  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSplineMoveData;

// ScriptStruct KuroComponent.SimpleMoveData
// 0x0098 (0x0098 - 0x0000)
struct alignas(0x08) FSimpleMoveData final
{
public:
	uint8                                         Pad_0[0x98];                                       // 0x0000(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSimpleMoveData;

}

