#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MFRCModule

#include "Basic.hpp"


namespace SDK::Params
{

// Function MFRCModule.MFRCActor.EnableDepthMotion
// 0x0001 (0x0001 - 0x0000)
struct MFRCActor_EnableDepthMotion final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFRCActor_EnableDepthMotion;

// Function MFRCModule.MFRCActor.EnableDrawDebugTexture
// 0x0001 (0x0001 - 0x0000)
struct MFRCActor_EnableDrawDebugTexture final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFRCActor_EnableDrawDebugTexture;

// Function MFRCModule.MFRCActor.EnableSplitUI
// 0x0001 (0x0001 - 0x0000)
struct MFRCActor_EnableSplitUI final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFRCActor_EnableSplitUI;

// Function MFRCModule.MFRCActor.IsEnableDepthMotion
// 0x0001 (0x0001 - 0x0000)
struct MFRCActor_IsEnableDepthMotion final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFRCActor_IsEnableDepthMotion;

// Function MFRCModule.MFRCActor.IsEnableSplitUI
// 0x0001 (0x0001 - 0x0000)
struct MFRCActor_IsEnableSplitUI final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFRCActor_IsEnableSplitUI;

// Function MFRCModule.MFRCActor.IsUseFramebufferColor
// 0x0001 (0x0001 - 0x0000)
struct MFRCActor_IsUseFramebufferColor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFRCActor_IsUseFramebufferColor;

// Function MFRCModule.MFRCActor.UseFrameBuffer
// 0x0001 (0x0001 - 0x0000)
struct MFRCActor_UseFrameBuffer final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFRCActor_UseFrameBuffer;

}

