#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NavmeshPartition

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "NavmeshPartition_structs.hpp"


namespace SDK
{

// Class NavmeshPartition.AudioMaterialComponent
// 0x0010 (0x0230 - 0x0220)
class UAudioMaterialComponent final : public USceneComponent
{
public:
	uint8                                         Pad_218[0x18];                                     // 0x0218(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioMaterialComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioMaterialComponent")
	}
	static class UAudioMaterialComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioMaterialComponent>();
	}
};
DUMPER7_ASSERTS_UAudioMaterialComponent;

// Class NavmeshPartition.NavmeshPartitionBaseActor
// 0x0010 (0x02C0 - 0x02B0)
class ANavmeshPartitionBaseActor : public AActor
{
public:
	class UNavmeshPartitionComponent*             NavmeshPartitionComp;                              // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENavPartition                                 Type;                                              // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NavmeshPartitionBaseActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NavmeshPartitionBaseActor")
	}
	static class ANavmeshPartitionBaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANavmeshPartitionBaseActor>();
	}
};
DUMPER7_ASSERTS_ANavmeshPartitionBaseActor;

// Class NavmeshPartition.NavmeshPartitionActor
// 0x0008 (0x02C8 - 0x02C0)
class ANavmeshPartitionActor final : public ANavmeshPartitionBaseActor
{
public:
	class UAudioMaterialComponent*                AudioMaterialComp;                                 // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NavmeshPartitionActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NavmeshPartitionActor")
	}
	static class ANavmeshPartitionActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANavmeshPartitionActor>();
	}
};
DUMPER7_ASSERTS_ANavmeshPartitionActor;

// Class NavmeshPartition.NavmeshPartitionComponent
// 0x0050 (0x0270 - 0x0220)
class UNavmeshPartitionComponent final : public USceneComponent
{
public:
	uint8                                         Pad_218[0x58];                                     // 0x0218(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NavmeshPartitionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NavmeshPartitionComponent")
	}
	static class UNavmeshPartitionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavmeshPartitionComponent>();
	}
};
DUMPER7_ASSERTS_UNavmeshPartitionComponent;

// Class NavmeshPartition.NavmeshPartitionGlobalBaseActor
// 0x0010 (0x02C0 - 0x02B0)
class ANavmeshPartitionGlobalBaseActor : public AActor
{
public:
	uint8                                         Pad_2B0[0x8];                                      // 0x02B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ENavPartition                                 Type;                                              // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NavmeshPartitionGlobalBaseActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NavmeshPartitionGlobalBaseActor")
	}
	static class ANavmeshPartitionGlobalBaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANavmeshPartitionGlobalBaseActor>();
	}
};
DUMPER7_ASSERTS_ANavmeshPartitionGlobalBaseActor;

// Class NavmeshPartition.NavmeshPartitionGlobalActor
// 0x0000 (0x02C0 - 0x02C0)
class ANavmeshPartitionGlobalActor final : public ANavmeshPartitionGlobalBaseActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NavmeshPartitionGlobalActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NavmeshPartitionGlobalActor")
	}
	static class ANavmeshPartitionGlobalActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANavmeshPartitionGlobalActor>();
	}
};
DUMPER7_ASSERTS_ANavmeshPartitionGlobalActor;

// Class NavmeshPartition.NavmeshPartitionGlobalComponent
// 0x00A0 (0x02C0 - 0x0220)
class UNavmeshPartitionGlobalComponent final : public USceneComponent
{
public:
	uint8                                         Pad_218[0xA8];                                     // 0x0218(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NavmeshPartitionGlobalComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NavmeshPartitionGlobalComponent")
	}
	static class UNavmeshPartitionGlobalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavmeshPartitionGlobalComponent>();
	}
};
DUMPER7_ASSERTS_UNavmeshPartitionGlobalComponent;

// Class NavmeshPartition.NavmeshWaterPartitionActor
// 0x0000 (0x02C0 - 0x02C0)
class ANavmeshWaterPartitionActor final : public ANavmeshPartitionBaseActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NavmeshWaterPartitionActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NavmeshWaterPartitionActor")
	}
	static class ANavmeshWaterPartitionActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANavmeshWaterPartitionActor>();
	}
};
DUMPER7_ASSERTS_ANavmeshWaterPartitionActor;

// Class NavmeshPartition.NavmeshWaterPartitionGlobalActor
// 0x0000 (0x02C0 - 0x02C0)
class ANavmeshWaterPartitionGlobalActor final : public ANavmeshPartitionGlobalBaseActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NavmeshWaterPartitionGlobalActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NavmeshWaterPartitionGlobalActor")
	}
	static class ANavmeshWaterPartitionGlobalActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANavmeshWaterPartitionGlobalActor>();
	}
};
DUMPER7_ASSERTS_ANavmeshWaterPartitionGlobalActor;

}

