#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDA_GIUIData

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PDA_GIUIData.PDA_GIUIData_C
// 0x0018 (0x0050 - 0x0038)
class UPDA_GIUIData_C final : public UPrimaryDataAsset
{
public:
	bool                                          HideSkyBox;                                        // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroWeatherDataAsset*                  UIGIData;                                          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SunVerticalAngle;                                  // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SunHorinzonAngle;                                  // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PDA_GIUIData_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PDA_GIUIData_C")
	}
	static class UPDA_GIUIData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDA_GIUIData_C>();
	}
};
DUMPER7_ASSERTS_UPDA_GIUIData_C;

}

