#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDA_GlobalRenderDataReference

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PDA_GlobalRenderDataReference.PDA_GlobalRenderDataReference_C
// 0x0048 (0x0080 - 0x0038)
class UPDA_GlobalRenderDataReference_C final : public UPrimaryDataAsset
{
public:
	class UMaterialParameterCollection*           GlobalShaderParameters;                            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialParameterCollection*           SceneInteractionShaderParameters;                  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPDA_ModelLensFlareConfig_C*            GlobalLensFlareConfig;                             // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialParameterCollection*           MPC_ShowBrightness;                                // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPDA_DecalShadowConfig_C*               DefaultDecalShadow;                                // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialParameterCollection*           EyesParameters;                                    // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     EmptyMaterial;                                     // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialParameterCollection*           MPC_ShowColorSetting;                              // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialParameterCollection*           MPC_GroundFogMask;                                 // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PDA_GlobalRenderDataReference_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PDA_GlobalRenderDataReference_C")
	}
	static class UPDA_GlobalRenderDataReference_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDA_GlobalRenderDataReference_C>();
	}
};
DUMPER7_ASSERTS_UPDA_GlobalRenderDataReference_C;

}

