#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrefabSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "PrefabSystem_structs.hpp"


namespace SDK
{

// Class PrefabSystem.ActorComponentPrefabData
// 0x01E8 (0x0218 - 0x0030)
class UActorComponentPrefabData final : public UAssetUserData
{
public:
	struct FGuid                                  PrefabInstanceGuid;                                // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  SourcePrefabGuid;                                  // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SourceComponentFileID;                             // 0x0050(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SourceActorFileID;                                 // 0x0054(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OuterPrefabGuid;                                   // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OuterPrefabInstanceFileID;                         // 0x0068(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OuterPrefabInstanceGuid;                           // 0x006C(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, int32>                     WithinOuterPrefabActorFileIDMap;                   // 0x0080(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<struct FGuid, int32>                     WithinOuterPrefabComponentFileIDMap;               // 0x00D0(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             ModifiedPropertyFNames;                            // 0x0120(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<struct FGuid, class FString>             OuterPrefabModifedPropertiesMap;                   // 0x0170(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<TWeakObjectPtr<class UObject>, int32>    DeepCopyObjectsFileIDMap;                          // 0x01C0(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	bool                                          bIsAnyPrefabInstanceRoot;                          // 0x0210(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorComponentPrefabData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorComponentPrefabData")
	}
	static class UActorComponentPrefabData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorComponentPrefabData>();
	}
};
DUMPER7_ASSERTS_UActorComponentPrefabData;

// Class PrefabSystem.PrefabAsset
// 0x00B8 (0x00F0 - 0x0038)
class UPrefabAsset final : public UPrimaryDataAsset
{
public:
	int32                                         NextFileID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        Version;                                           // 0x003C(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReferenceAssets;                                   // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReferenceFNames;                                   // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class UClass*>                         ReferenceClasses;                                  // 0x0070(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                SoftReferenceData;                                 // 0x0080(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FActorSerializeData>            ActorsSerializeData;                               // 0x0090(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FComponentSerializeData>        ComponentsSerializeData;                           // 0x00A0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FNestedPrefabInstanceData>      NestedPrefabInstancesData;                         // 0x00B0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FNestedPrefabInstanceChain>     NestedPrefabInstanceChains;                        // 0x00C0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FVirtualObjectSerializeData>    VirtualObjectsSerializeData;                       // 0x00D0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FPropertyModificationData>      PropertyModificationsSerializeData;                // 0x00E0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabAsset")
	}
	static class UPrefabAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabAsset>();
	}
};
DUMPER7_ASSERTS_UPrefabAsset;

// Class PrefabSystem.PrefabAssetManager
// 0x00A0 (0x00D0 - 0x0030)
class UPrefabAssetManager final : public UObject
{
public:
	uint8                                         Pad_30[0xA0];                                      // 0x0030(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabAssetManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabAssetManager")
	}
	static class UPrefabAssetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabAssetManager>();
	}
};
DUMPER7_ASSERTS_UPrefabAssetManager;

// Class PrefabSystem.PrefabBlueprintFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UPrefabBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ApplyPrefab(class AActor* Actor);
	static class AActor* Instantiate(class UPrefabAsset* PrefabAsset, class USceneComponent* ParentComponent, class ULevel* InLevel, bool bTemporaryEditorActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabBlueprintFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabBlueprintFunctionLibrary")
	}
	static class UPrefabBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabBlueprintFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UPrefabBlueprintFunctionLibrary;

}

