#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoadNetNavigationRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class RoadNetNavigationRuntime.RoadNetNavigationPath
// 0x0018 (0x0048 - 0x0030)
class URoadNetNavigationPath final : public UObject
{
public:
	TArray<struct FVector>                        PathPoints;                                        // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPartial;                                         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RoadNetNavigationPath")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RoadNetNavigationPath")
	}
	static class URoadNetNavigationPath* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadNetNavigationPath>();
	}
};
DUMPER7_ASSERTS_URoadNetNavigationPath;

// Class RoadNetNavigationRuntime.RoadNetNavigationSetting
// 0x0020 (0x0050 - 0x0030)
class URoadNetNavigationSetting final : public UObject
{
public:
	int32                                         MaxPathPoints;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxSearchPoints;                                   // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxCheckCount;                                     // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DotAngleThreshold;                                 // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FinderHalfExtents;                                 // 0x0040(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RoadNetNavigationSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RoadNetNavigationSetting")
	}
	static class URoadNetNavigationSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadNetNavigationSetting>();
	}
};
DUMPER7_ASSERTS_URoadNetNavigationSetting;

// Class RoadNetNavigationRuntime.RoadNetNavigationSystem
// 0x0060 (0x0090 - 0x0030)
class URoadNetNavigationSystem final : public URoadNetNavigationSystemBase
{
public:
	uint8                                         Pad_30[0x60];                                      // 0x0030(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class URoadNetNavigationPath* RoadNet_FindPathToLocationSynchronously(class UObject* WorldContextObject, const struct FVector& PathStart, const struct FVector& PathEnd);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RoadNetNavigationSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RoadNetNavigationSystem")
	}
	static class URoadNetNavigationSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadNetNavigationSystem>();
	}
};
DUMPER7_ASSERTS_URoadNetNavigationSystem;

}

