#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SAimPart

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SAimPart.SAimPart
// 0x0040 (0x0040 - 0x0000)
struct FSAimPart final
{
public:
	class FString                                 BoneName_3_B32CA64F4FF22CB1150F49B45EE2062E;       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                Offset_8_17BDBF8548DAF3771A75FE901798FB03;         // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RadiusIn_12_F71D60C742E3FB5038F20898BE8CA7B0;      // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RadiusOut_18_A7AA7BAD49036AEA3B3A659CA231F81F;     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RadiusOutOnStart_15_B977CFC944BED18496667782EDF56BA9; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileCorrect_20_ED2D52904EF9E12A926033AE49117260; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GamePadCorrect_21_2A96B05646C1B1109647979F423C9943; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 忽略的骨骼碰撞_27_009D4EC542EC81F1E9E721A83D0D3E85; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSAimPart;

}

