#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SBulletDataMove

#include "Basic.hpp"

#include "EBulletFollowType_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SBulletDataMove.SBulletDataMove
// 0x0090 (0x0090 - 0x0000)
struct FSBulletDataMove final
{
public:
	EBulletFollowType                             子弹跟随类型_2_126946AE4F4C7C4DED5920B2CDB6ADF3;   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   骨骼名_36_A0CC7E03462D3A3B7DA899B6FC4A3B47;        // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          跟随骨骼面向发射_39_B592412A4241F96EE16AD08062EDDFB3; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          瞄准发射_46_2B3B53F3485263135D9D449C914400E1;      // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          无限制追踪子弹_58_507F4D9541CB9FA96EAD699350CCCAD4; // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          不改变朝向_71_B261D53346C0307102ABD9879E68D427;    // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         瞄准子弹最大射程_49_AADF854844165B090461409AF69152F4; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         瞄准子弹最大偏转角度_51_8763E4C640A20B5A62DDC3BF30CE8A11; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          初始旋转是否面向目标_53_1B94C21E45F4EABFB7ABD49DEEA8DB2B; // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         初始旋转最大角度_56_F3BB20E24D9A9331837BF2B0F36EDD0E; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         初始速度_14_A1706DE24A202154162601B5A29C6EF3;      // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            速度变化曲线_17_B8430A774F944DA8CDB98E9A18B2AB42;  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               初始速度方向_37_BE0EE92C47487F3307EB71AA1CAD4A39;  // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               方向偏转速度_43_5FB1E1B242378238DBF16A825CF918BA;  // 0x003C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCurveVector*                           方向偏转速度变化曲线_44_387458284BE99FC058CD8A93EAF28739; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         目标偏转速度_33_AAA274AF4AA228BBE471528345BE1E20;  // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            目标偏转速度变化曲线_29_A0D25D094C603DFD41AF4FA9BFAB310A; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                目标偏转速度分量_61_433710E048C4992DE45580821EA22A8C; // 0x0060(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            目标偏转速度分量Y变化曲线_64_DFA134CC4FA35195D440C4ADF9095F8B; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            目标偏转速度分量Z变化曲线_66_B7C8268F449EFA19A5CD87BFAEC30785; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                合外力_69_201020EA440C9B2F258218956E1EBD45;        // 0x0080(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSBulletDataMove;

}

