#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCameraDebugTool_CameraFrameInfo

#include "Basic.hpp"

#include "SCameraDebugTool_ControllerModification_structs.hpp"
#include "SCameraDebugTool_SubCameraModification_structs.hpp"
#include "SCameraDebugTool_CameraModeInfo_structs.hpp"


namespace SDK
{

// UserDefinedStruct SCameraDebugTool_CameraFrameInfo.SCameraDebugTool_CameraFrameInfo
// 0x0100 (0x0100 - 0x0000)
struct FSCameraDebugTool_CameraFrameInfo final
{
public:
	int64                                         FrameNumber_25_5286701F43C845E3669BC79C9D7EF67D;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class FString>            DesiredCameraProps_13_A009612649DCFB89CCCA3BAA5BE5B30E; // 0x0008(0x0050)(Edit, BlueprintVisible)
	TArray<struct FSCameraDebugTool_ControllerModification> ControllerModifications_17_04C4D6194013D006FC7B7292C0F04E43; // 0x0058(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSCameraDebugTool_SubCameraModification> SubCameraModifications_20_1FFC70644FA0422C59DD1EAA04788376; // 0x0068(0x0010)(Edit, BlueprintVisible)
	struct FSCameraDebugTool_CameraModeInfo       CamerModeInfo_31_2BC7238C4EEE76E72C7603A10BFD349C; // 0x0078(0x0088)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSCameraDebugTool_CameraFrameInfo;

}

