#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SceneEffectStatePostVolume

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SceneEffectStatePostVolume.SceneEffectStatePostVolume_C
// 0x0018 (0x02C8 - 0x02B0)
class ASceneEffectStatePostVolume_C final : public AActor
{
public:
	class UKuroPostProcessComponent*              KuroPostProcess;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         value;                                             // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetAirWall(float value_0);
	void SetToxicFog(float Value);
	void EnableVolume();
	void DisableVolume();
	void SetEffect(float Value);
	void SetWall_Debug();
	void SetToxicFog_Debug();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SceneEffectStatePostVolume_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SceneEffectStatePostVolume_C")
	}
	static class ASceneEffectStatePostVolume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASceneEffectStatePostVolume_C>();
	}
};
DUMPER7_ASSERTS_ASceneEffectStatePostVolume_C;

}

