#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKuroInteractionLimbsConfig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SKuroInteractionLimbsConfig.SKuroInteractionLimbsConfig
// 0x0040 (0x0040 - 0x0000)
struct FSKuroInteractionLimbsConfig final
{
public:
	class FName                                   插槽名字_2_317A3C8F4FFE42EDB0464A976636B5F3;       // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                相对位置_6_8240CCB94D0AB05628FDF589E18667D6;       // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         半径_16_2F3754A64F23BAD88E622A8399F42FC4;          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         半高_17_0D2473BB4F4208A2C647B48AF1FF77B1;          // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        交互配置_46_566E7D084E146CC131B2C4A95FEFCCE6;      // 0x0020(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSKuroInteractionLimbsConfig;

}

