#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMovementSetting_State

#include "Basic.hpp"

#include "SMovementSetting_Posture_structs.hpp"
#include "EWanderDirectionType_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct SMovementSetting_State.SMovementSetting_State
// 0x0648 (0x0648 - 0x0000)
struct FSMovementSetting_State final
{
public:
	struct FSMovementSetting_Posture              FaceDirection_35_752904864FF4C6441610D6BA533CEAD3; // 0x0000(0x00B0)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSMovementSetting_Posture              LockDirection_36_3DDFB2394C43B3CFC79E85B754344D3B; // 0x00B0(0x00B0)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSMovementSetting_Posture              AimDirection_37_F202F3C642A28CAD3AB506BF93B9A8B1;  // 0x0160(0x00B0)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSMovementSetting_Posture              CustomSetting00_39_58F522F44BBCF73B91D2A78E0108BF2B; // 0x0210(0x00B0)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSMovementSetting_Posture              CustomSetting01_28_C869024D4F347CBF69D96B9915B8F823; // 0x02C0(0x00B0)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSMovementSetting_Posture              CustomSetting02_29_E386C1B64DD0DA80C052F3ABC69899D1; // 0x0370(0x00B0)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSMovementSetting_Posture              CustomSetting03_30_8A4C568C4F510227ED0154A2B98360E3; // 0x0420(0x00B0)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSMovementSetting_Posture              CustomSetting04_31_006E59BA4CA1B36C7D00BE997360C0CB; // 0x04D0(0x00B0)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSMovementSetting_Posture              CustomSetting05_32_FFFCFAB24E8044CFC2634C8F0FAEC69E; // 0x0580(0x00B0)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWanderDirectionType                          WanderDirection_42_6DD7B6E046D2732FDAD16FAC63BAE9FC; // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           EnableTag_45_6335230A44F8B743C29963A7E3C593E5;     // 0x0634(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	float                                         WalkableFloorAngle_49_CB6590054FEDF71C43205F9A9E2604A9; // 0x0640(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSMovementSetting_State;

}

