#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SReBulletDataTime

#include "Basic.hpp"

#include "STimeScale_structs.hpp"


namespace SDK
{

// UserDefinedStruct SReBulletDataTime.SReBulletDataTime
// 0x0088 (0x0088 - 0x0000)
struct FSReBulletDataTime final
{
public:
	bool                                          是否跟随攻击者顿帧_19_70214E954FB3BADC741AF48FBE764009; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          攻击顿帧忽略攻击者_13_0C59E9914A89FCFF2D8D4B80006B1DA2; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTimeScale                            攻击顿帧_9_4DD306D7471FB55EBE1CFE9EF7DE479C;       // 0x0008(0x0018)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTimeScale                            受击顿帧_10_EA8FC4B84E94603ADE21D487F73FE019;      // 0x0020(0x0018)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTimeScale                            命中弱点攻击者顿帧_27_54A1BD5E4B4D7B2EB3B3DDA32E46698D; // 0x0038(0x0018)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTimeScale                            命中弱点受击者顿帧_28_351606F4477B9930E1263EA97242EAB7; // 0x0050(0x0018)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          强制影响区域内子弹_18_1AE83F71493CBD6D150BA58256E9B71A; // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          区域受击者时间膨胀_16_2881454C4F3ABE13EEAB41828F012DEC; // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 自定义连携顿帧单位key_22_9B4DB46141B55B2BEF36BDA184946546; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         时间膨胀失效_31_760572114252DA9DB585EB931434500A;  // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          子弹销毁时移除受击顿帧_34_D89BB7144388331E7DC7118056D2D3AD; // 0x0084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FSReBulletDataTime;

}

