#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SVarRefContext

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct SVarRefContext.SVarRefContext
// 0x0068 (0x0068 - 0x0000)
struct FSVarRefContext final
{
public:
	class FString                                 Type_24_1DA19796453718C4F6046AA7DAD248E9;          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 VarRefSource_21_30EBD7954A68543D9507668105946D4E;  // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 VarRefType_22_387552474272BE6FF46D9C9A8F4A39B6;    // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         RefId_9_FEDF41FD442646FFB008D09D00966D22;          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Key_14_4F3208CB4AA09A8A69DC6598BE58C852;           // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StringValue_28_2FA3ABA049BDA532750201B80E1D8733;   // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          BoolValue_32_704AD1264CB586B5ADC2FD8E0E6CFE6C;     // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatValue_34_94A077494570AC394828DD9B775BB10F;    // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IntValue_38_4C0671064B56516F4EF7BA9C37A3F18A;      // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsClientVariable_27_4F9202CC4BF93335C2D83DBA16047507; // 0x0064(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FSVarRefContext;

}

