#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsBasePlayerController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KuroInput_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsBasePlayerController.TsBasePlayerController_C
// 0x00B8 (0x0788 - 0x06D0)
class ATsBasePlayerController_C : public ABasePlayerController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 ActionHandleClass;                                 // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UTsActionHandle_C*> ActionHandleMap;                                   // 0x06E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 AxisHandleClass;                                   // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UTsAxisHandle_C*>   AxisHandleMap;                                     // 0x0738(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_TsBasePlayerController(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReceiveSetupInputComponent();
	class UTsActionHandle_C* GetActionHandle(const class FString& actionName);
	void RemoveActionHandle(const class FString& actionName);
	void RemoveAxisHandle(const class FString& axisName);
	class UTsAxisHandle_C* GetAxisHandle(const class FString& actionName);
	void BindTouchHandle();
	void OnTouchBegin(ETouchIndex touchIndex, const struct FVector& position);
	void OnTouchEnd(ETouchIndex touchIndex, const struct FVector& position);
	void OnTouchMove(ETouchIndex touchIndex, const struct FVector& position);
	void OnSetupInputComponent();
	void OnPressAnyKey(const struct FKey& key);
	bool IsInTouch(float touchId);
	void ClearInputBinding();
	void AddInputBinding();
	void OnReleaseAnyKey(const struct FKey& key);
	void SetIsPrintKeyName(bool bPrintKeyName);
	void InitInputHandle();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TsBasePlayerController_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TsBasePlayerController_C")
	}
	static class ATsBasePlayerController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATsBasePlayerController_C>();
	}
};
DUMPER7_ASSERTS_ATsBasePlayerController_C;

}

