#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsSimpleNpc

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsSimpleNpc.TsSimpleNpc_C
// 0x0050 (0x0308 - 0x02B8)
class ATsSimpleNpc_C final : public AKuroEffectActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CapsuleCollision;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharRenderingComponent_C*              CharRenderingComponent;                            // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        DA;                                                // 0x02D8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          DisappearOnSunny;                                  // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DisappearOnCloudy;                                 // 0x02F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DisappearOnRainy;                                  // 0x02FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DisappearOnThunderRain;                            // 0x02FB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DisappearOnSnowy;                                  // 0x02FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DebugDitherValue;                                  // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LodLevel;                                          // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TsSimpleNpc(int32 EntryPoint);
	void ReceiveBeginPlay();
	void EditorInit();
	void EditorTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void LoadModel();
	void FindFloor();
	void SetDefaultCollision();
	void ResetMeshLocation();
	void ShowDialog(const class FString& text1, float removeFrame1);
	bool TryPlayMontage(const class FString& montagePath);
	void HideDialog();
	void StopMontage();
	void HandleLoadedDaConfig(class UPD_NpcSetupData_C* daConfig1, bool isEditor);
	void DebugSetNpcDitherValue(float value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TsSimpleNpc_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TsSimpleNpc_C")
	}
	static class ATsSimpleNpc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATsSimpleNpc_C>();
	}
};
DUMPER7_ASSERTS_ATsSimpleNpc_C;

}

