#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WindowsDeviceProfileSelector

#include "Basic.hpp"


namespace SDK
{

// Enum WindowsDeviceProfileSelector.EDataCompareType
// NumValues: 0x000F
enum class EDataCompareType : uint8
{
	WDCT_Equal                               = 0,
	WDCT_Less                                = 1,
	WDCT_LessEqual                           = 2,
	WDCT_Greater                             = 3,
	WDCT_GreaterEqual                        = 4,
	WDCT_NotEqual                            = 5,
	WDCT_Regex                               = 6,
	WDCT_EqualIgnore                         = 7,
	WDCT_LessIgnore                          = 8,
	WDCT_LessEqualIgnore                     = 9,
	WDCT_GreaterIgnore                       = 10,
	WDCT_GreaterEqualIgnore                  = 11,
	WDCT_NotEqualIgnore                      = 12,
	WDCT_Hash                                = 13,
	WDCT_MAX                                 = 14,
};

// Enum WindowsDeviceProfileSelector.EDataSourceType
// NumValues: 0x0004
enum class EDataSourceType : uint8
{
	WDST_PreviousRegexMatch                  = 0,
	WDST_CPUBrand                            = 1,
	WDST_GPUBrand                            = 2,
	WDST_MAX                                 = 3,
};

// ScriptStruct WindowsDeviceProfileSelector.WindowsDeviceProfileMatchItem
// 0x0018 (0x0018 - 0x0000)
struct FWindowsDeviceProfileMatchItem final
{
public:
	EDataSourceType                               SourceType;                                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataCompareType                              CompareType;                                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MatchString;                                       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWindowsDeviceProfileMatchItem;

// ScriptStruct WindowsDeviceProfileSelector.WindowsDeviceProfileMatch
// 0x0020 (0x0020 - 0x0000)
struct FWindowsDeviceProfileMatch final
{
public:
	class FString                                 Profile;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWindowsDeviceProfileMatchItem> Match;                                             // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWindowsDeviceProfileMatch;

}

